una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* - ----------------------------------------------------------------------------*/
/* -          ATMEL Microcontroller Software Support  -  ROUSSET  -*/
/* - ----------------------------------------------------------------------------*/
/* -  DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR*/
/* -  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF*/
/* -  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE*/
/* -  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,*/
/* -  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT*/
/* -  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,*/
/* -  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF*/
/* -  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING*/
/* -  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,*/
/* -  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.*/
/* - ----------------------------------------------------------------------------*/
/* - File Name           : AT91SAM9263.h*/
/* - Object              : AT91SAM9263 definitions*/
/* - Generated           : AT91 SW Application Group  12/07/2006 (13:13:31)*/
/* - */
/* - CVS Reference       : /AT91SAM9263.pl/1.2/Fri Nov 10 12:56:00 2006  */
/* - CVS Reference       : /SYS_SAM9262.pl/1.4/Tue Jan 18 17:06:33 2005  */
/* - CVS Reference       : /HMATRIX1_SAM9262.pl/1.10/Thu Oct 13 12:44:26 2005  */
/* - CVS Reference       : /CCR_SAM9262.pl/1.7/Fri Nov 10 13:23:00 2006  */
/* - CVS Reference       : /PMC_SAM9262.pl/1.4/Mon Mar  7 18:03:13 2005  */
/* - CVS Reference       : /HSDRAMC1_6100A.pl/1.2/Mon Aug  9 10:52:25 2004  */
/* - CVS Reference       : /HSMC3_6105A.pl/1.4/Tue Nov 16 09:16:23 2004  */
/* - CVS Reference       : /AIC_6075B.pl/1.3/Fri May 20 14:21:42 2005  */
/* - CVS Reference       : /PDC_6074C.pl/1.2/Thu Feb  3 09:02:11 2005  */
/* - CVS Reference       : /DBGU_6059D.pl/1.1/Mon Jan 31 13:54:41 2005  */
/* - CVS Reference       : /PIO_6057A.pl/1.2/Thu Feb  3 10:29:42 2005  */
/* - CVS Reference       : /RSTC_6098A.pl/1.3/Thu Nov  4 13:57:00 2004  */
/* - CVS Reference       : /SHDWC_6122A.pl/1.3/Wed Oct  6 14:16:58 2004  */
/* - CVS Reference       : /RTTC_6081A.pl/1.2/Thu Nov  4 13:57:22 2004  */
/* - CVS Reference       : /PITC_6079A.pl/1.2/Thu Nov  4 13:56:22 2004  */
/* - CVS Reference       : /WDTC_6080A.pl/1.3/Thu Nov  4 13:58:52 2004  */
/* - CVS Reference       : /TC_6082A.pl/1.7/Wed Mar  9 16:31:51 2005  */
/* - CVS Reference       : /MCI_6101E.pl/1.1/Fri Jun  3 13:20:23 2005  */
/* - CVS Reference       : /TWI_6061A.pl/1.2/Wed Oct 25 15:03:34 2006  */
/* - CVS Reference       : /US_6089C.pl/1.1/Mon Jan 31 13:56:02 2005  */
/* - CVS Reference       : /SSC_6078B.pl/1.1/Wed Jul 13 15:25:46 2005  */
/* - CVS Reference       : /SPI_6088D.pl/1.3/Fri May 20 14:23:02 2005  */
/* - CVS Reference       : /AC97C_XXXX.pl/1.3/Tue Feb 22 17:08:27 2005  */
/* - CVS Reference       : /CAN_6019B.pl/1.1/Mon Jan 31 13:54:30 2005  */
/* - CVS Reference       : /PWM_6044D.pl/1.2/Tue May 10 12:39:09 2005  */
/* - CVS Reference       : /LCDC_6063A.pl/1.3/Fri Dec  9 10:59:26 2005  */
/* - CVS Reference       : /EMACB_6119A.pl/1.6/Wed Jul 13 15:25:00 2005  */
/* - CVS Reference       : /DMA_XXXX.pl/1.6/Tue Jan 11 09:40:44 2005  */
/* - CVS Reference       : /UDP_6ept_puon.pl/1.1/Wed Aug 30 14:20:53 2006  */
/* - CVS Reference       : /UHP_6127A.pl/1.1/Wed Feb 23 16:03:17 2005  */
/* - CVS Reference       : /TBOX_XXXX.pl/1.15/Thu Jun  9 07:05:57 2005  */
/* - CVS Reference       : /EBI_nadia2.pl/1.1/Wed Dec 29 11:28:03 2004  */
/* - CVS Reference       : /HECC_6143A.pl/1.1/Wed Feb  9 17:16:57 2005  */
/* - CVS Reference       : /ISI_xxxxx.pl/1.3/Thu Mar  3 11:11:48 2005  */
/* - ----------------------------------------------------------------------------*/

#ifndef AT91SAM9263_H
#define AT91SAM9263_H

#ifdef __IAR_SYSTEMS_ICC__

typedef volatile unsigned int AT91_REG;/* Hardware register definition*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* ******************************************************************************/
typedef struct _AT91S_SYS {
	AT91_REG	 SYS_ECC0; 	/* ECC 0*/
	AT91_REG	 Reserved0[127]; 	/* */
	AT91_REG	 SYS_SDRAMC0_MR; 	/* SDRAM Controller Mode Register*/
	AT91_REG	 SYS_SDRAMC0_TR; 	/* SDRAM Controller Refresh Timer Register*/
	AT91_REG	 SYS_SDRAMC0_CR; 	/* SDRAM Controller Configuration Register*/
	AT91_REG	 SYS_SDRAMC0_HSR; 	/* SDRAM Controller High Speed Register*/
	AT91_REG	 SYS_SDRAMC0_LPR; 	/* SDRAM Controller Low Power Register*/
	AT91_REG	 SYS_SDRAMC0_IER; 	/* SDRAM Controller Interrupt Enable Register*/
	AT91_REG	 SYS_SDRAMC0_IDR; 	/* SDRAM Controller Interrupt Disable Register*/
	AT91_REG	 SYS_SDRAMC0_IMR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SYS_SDRAMC0_ISR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SYS_SDRAMC0_MDR; 	/* SDRAM Memory Device Register*/
	AT91_REG	 Reserved1[118]; 	/* */
	AT91_REG	 SYS_SMC0_SETUP0; 	/*  Setup Register for CS 0*/
	AT91_REG	 SYS_SMC0_PULSE0; 	/*  Pulse Register for CS 0*/
	AT91_REG	 SYS_SMC0_CYCLE0; 	/*  Cycle Register for CS 0*/
	AT91_REG	 SYS_SMC0_CTRL0; 	/*  Control Register for CS 0*/
	AT91_REG	 SYS_SMC0_SETUP1; 	/*  Setup Register for CS 1*/
	AT91_REG	 SYS_SMC0_PULSE1; 	/*  Pulse Register for CS 1*/
	AT91_REG	 SYS_SMC0_CYCLE1; 	/*  Cycle Register for CS 1*/
	AT91_REG	 SYS_SMC0_CTRL1; 	/*  Control Register for CS 1*/
	AT91_REG	 SYS_SMC0_SETUP2; 	/*  Setup Register for CS 2*/
	AT91_REG	 SYS_SMC0_PULSE2; 	/*  Pulse Register for CS 2*/
	AT91_REG	 SYS_SMC0_CYCLE2; 	/*  Cycle Register for CS 2*/
	AT91_REG	 SYS_SMC0_CTRL2; 	/*  Control Register for CS 2*/
	AT91_REG	 SYS_SMC0_SETUP3; 	/*  Setup Register for CS 3*/
	AT91_REG	 SYS_SMC0_PULSE3; 	/*  Pulse Register for CS 3*/
	AT91_REG	 SYS_SMC0_CYCLE3; 	/*  Cycle Register for CS 3*/
	AT91_REG	 SYS_SMC0_CTRL3; 	/*  Control Register for CS 3*/
	AT91_REG	 SYS_SMC0_SETUP4; 	/*  Setup Register for CS 4*/
	AT91_REG	 SYS_SMC0_PULSE4; 	/*  Pulse Register for CS 4*/
	AT91_REG	 SYS_SMC0_CYCLE4; 	/*  Cycle Register for CS 4*/
	AT91_REG	 SYS_SMC0_CTRL4; 	/*  Control Register for CS 4*/
	AT91_REG	 SYS_SMC0_SETUP5; 	/*  Setup Register for CS 5*/
	AT91_REG	 SYS_SMC0_PULSE5; 	/*  Pulse Register for CS 5*/
	AT91_REG	 SYS_SMC0_CYCLE5; 	/*  Cycle Register for CS 5*/
	AT91_REG	 SYS_SMC0_CTRL5; 	/*  Control Register for CS 5*/
	AT91_REG	 SYS_SMC0_SETUP6; 	/*  Setup Register for CS 6*/
	AT91_REG	 SYS_SMC0_PULSE6; 	/*  Pulse Register for CS 6*/
	AT91_REG	 SYS_SMC0_CYCLE6; 	/*  Cycle Register for CS 6*/
	AT91_REG	 SYS_SMC0_CTRL6; 	/*  Control Register for CS 6*/
	AT91_REG	 SYS_SMC0_SETUP7; 	/*  Setup Register for CS 7*/
	AT91_REG	 SYS_SMC0_PULSE7; 	/*  Pulse Register for CS 7*/
	AT91_REG	 SYS_SMC0_CYCLE7; 	/*  Cycle Register for CS 7*/
	AT91_REG	 SYS_SMC0_CTRL7; 	/*  Control Register for CS 7*/
	AT91_REG	 Reserved2[96]; 	/* */
	AT91_REG	 SYS_ECC1; 	/* ECC 0*/
	AT91_REG	 Reserved3[127]; 	/* */
	AT91_REG	 SYS_SDRAMC1_MR; 	/* SDRAM Controller Mode Register*/
	AT91_REG	 SYS_SDRAMC1_TR; 	/* SDRAM Controller Refresh Timer Register*/
	AT91_REG	 SYS_SDRAMC1_CR; 	/* SDRAM Controller Configuration Register*/
	AT91_REG	 SYS_SDRAMC1_HSR; 	/* SDRAM Controller High Speed Register*/
	AT91_REG	 SYS_SDRAMC1_LPR; 	/* SDRAM Controller Low Power Register*/
	AT91_REG	 SYS_SDRAMC1_IER; 	/* SDRAM Controller Interrupt Enable Register*/
	AT91_REG	 SYS_SDRAMC1_IDR; 	/* SDRAM Controller Interrupt Disable Register*/
	AT91_REG	 SYS_SDRAMC1_IMR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SYS_SDRAMC1_ISR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SYS_SDRAMC1_MDR; 	/* SDRAM Memory Device Register*/
	AT91_REG	 Reserved4[118]; 	/* */
	AT91_REG	 SYS_SMC1_SETUP0; 	/*  Setup Register for CS 0*/
	AT91_REG	 SYS_SMC1_PULSE0; 	/*  Pulse Register for CS 0*/
	AT91_REG	 SYS_SMC1_CYCLE0; 	/*  Cycle Register for CS 0*/
	AT91_REG	 SYS_SMC1_CTRL0; 	/*  Control Register for CS 0*/
	AT91_REG	 SYS_SMC1_SETUP1; 	/*  Setup Register for CS 1*/
	AT91_REG	 SYS_SMC1_PULSE1; 	/*  Pulse Register for CS 1*/
	AT91_REG	 SYS_SMC1_CYCLE1; 	/*  Cycle Register for CS 1*/
	AT91_REG	 SYS_SMC1_CTRL1; 	/*  Control Register for CS 1*/
	AT91_REG	 SYS_SMC1_SETUP2; 	/*  Setup Register for CS 2*/
	AT91_REG	 SYS_SMC1_PULSE2; 	/*  Pulse Register for CS 2*/
	AT91_REG	 SYS_SMC1_CYCLE2; 	/*  Cycle Register for CS 2*/
	AT91_REG	 SYS_SMC1_CTRL2; 	/*  Control Register for CS 2*/
	AT91_REG	 SYS_SMC1_SETUP3; 	/*  Setup Register for CS 3*/
	AT91_REG	 SYS_SMC1_PULSE3; 	/*  Pulse Register for CS 3*/
	AT91_REG	 SYS_SMC1_CYCLE3; 	/*  Cycle Register for CS 3*/
	AT91_REG	 SYS_SMC1_CTRL3; 	/*  Control Register for CS 3*/
	AT91_REG	 SYS_SMC1_SETUP4; 	/*  Setup Register for CS 4*/
	AT91_REG	 SYS_SMC1_PULSE4; 	/*  Pulse Register for CS 4*/
	AT91_REG	 SYS_SMC1_CYCLE4; 	/*  Cycle Register for CS 4*/
	AT91_REG	 SYS_SMC1_CTRL4; 	/*  Control Register for CS 4*/
	AT91_REG	 SYS_SMC1_SETUP5; 	/*  Setup Register for CS 5*/
	AT91_REG	 SYS_SMC1_PULSE5; 	/*  Pulse Register for CS 5*/
	AT91_REG	 SYS_SMC1_CYCLE5; 	/*  Cycle Register for CS 5*/
	AT91_REG	 SYS_SMC1_CTRL5; 	/*  Control Register for CS 5*/
	AT91_REG	 SYS_SMC1_SETUP6; 	/*  Setup Register for CS 6*/
	AT91_REG	 SYS_SMC1_PULSE6; 	/*  Pulse Register for CS 6*/
	AT91_REG	 SYS_SMC1_CYCLE6; 	/*  Cycle Register for CS 6*/
	AT91_REG	 SYS_SMC1_CTRL6; 	/*  Control Register for CS 6*/
	AT91_REG	 SYS_SMC1_SETUP7; 	/*  Setup Register for CS 7*/
	AT91_REG	 SYS_SMC1_PULSE7; 	/*  Pulse Register for CS 7*/
	AT91_REG	 SYS_SMC1_CYCLE7; 	/*  Cycle Register for CS 7*/
	AT91_REG	 SYS_SMC1_CTRL7; 	/*  Control Register for CS 7*/
	AT91_REG	 Reserved5[96]; 	/* */
	AT91_REG	 SYS_MATRIX_MCFG0; 	/*  Master Configuration Register 0 */
	AT91_REG	 SYS_MATRIX_MCFG1; 	/*  Master Configuration Register 1 */
	AT91_REG	 SYS_MATRIX_MCFG2; 	/*  Master Configuration Register 2 */
	AT91_REG	 SYS_MATRIX_MCFG3; 	/*  Master Configuration Register 3 */
	AT91_REG	 SYS_MATRIX_MCFG4; 	/*  Master Configuration Register 4 */
	AT91_REG	 SYS_MATRIX_MCFG5; 	/*  Master Configuration Register 5 */
	AT91_REG	 SYS_MATRIX_MCFG6; 	/*  Master Configuration Register 6 */
	AT91_REG	 SYS_MATRIX_MCFG7; 	/*  Master Configuration Register 7 */
	AT91_REG	 SYS_MATRIX_MCFG8; 	/*  Master Configuration Register 8 */
	AT91_REG	 Reserved6[7]; 	/* */
	AT91_REG	 SYS_MATRIX_SCFG0; 	/*  Slave Configuration Register 0*/
	AT91_REG	 SYS_MATRIX_SCFG1; 	/*  Slave Configuration Register 1*/
	AT91_REG	 SYS_MATRIX_SCFG2; 	/*  Slave Configuration Register 2*/
	AT91_REG	 SYS_MATRIX_SCFG3; 	/*  Slave Configuration Register 3*/
	AT91_REG	 SYS_MATRIX_SCFG4; 	/*  Slave Configuration Register 4*/
	AT91_REG	 SYS_MATRIX_SCFG5; 	/*  Slave Configuration Register 5*/
	AT91_REG	 SYS_MATRIX_SCFG6; 	/*  Slave Configuration Register 6*/
	AT91_REG	 SYS_MATRIX_SCFG7; 	/*  Slave Configuration Register 7*/
	AT91_REG	 Reserved7[8]; 	/* */
	AT91_REG	 SYS_MATRIX_PRAS0; 	/*  PRAS0*/
	AT91_REG	 SYS_MATRIX_PRBS0; 	/*  PRBS0*/
	AT91_REG	 SYS_MATRIX_PRAS1; 	/*  PRAS1*/
	AT91_REG	 SYS_MATRIX_PRBS1; 	/*  PRBS1*/
	AT91_REG	 SYS_MATRIX_PRAS2; 	/*  PRAS2*/
	AT91_REG	 SYS_MATRIX_PRBS2; 	/*  PRBS2*/
	AT91_REG	 SYS_MATRIX_PRAS3; 	/*  PRAS3*/
	AT91_REG	 SYS_MATRIX_PRBS3; 	/*  PRBS3*/
	AT91_REG	 SYS_MATRIX_PRAS4; 	/*  PRAS4*/
	AT91_REG	 SYS_MATRIX_PRBS4; 	/*  PRBS4*/
	AT91_REG	 SYS_MATRIX_PRAS5; 	/*  PRAS5*/
	AT91_REG	 SYS_MATRIX_PRBS5; 	/*  PRBS5*/
	AT91_REG	 SYS_MATRIX_PRAS6; 	/*  PRAS6*/
	AT91_REG	 SYS_MATRIX_PRBS6; 	/*  PRBS6*/
	AT91_REG	 SYS_MATRIX_PRAS7; 	/*  PRAS7*/
	AT91_REG	 SYS_MATRIX_PRBS7; 	/*  PRBS7*/
	AT91_REG	 Reserved8[16]; 	/* */
	AT91_REG	 SYS_MATRIX_MRCR; 	/*  Master Remp Control Register */
	AT91_REG	 Reserved9[63]; 	/* */
	AT91_REG	 SYS_DBGU_CR; 	/* Control Register*/
	AT91_REG	 SYS_DBGU_MR; 	/* Mode Register*/
	AT91_REG	 SYS_DBGU_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_DBGU_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_DBGU_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_DBGU_CSR; 	/* Channel Status Register*/
	AT91_REG	 SYS_DBGU_RHR; 	/* Receiver Holding Register*/
	AT91_REG	 SYS_DBGU_THR; 	/* Transmitter Holding Register*/
	AT91_REG	 SYS_DBGU_BRGR; 	/* Baud Rate Generator Register*/
	AT91_REG	 Reserved10[7]; 	/* */
	AT91_REG	 SYS_DBGU_CIDR; 	/* Chip ID Register*/
	AT91_REG	 SYS_DBGU_EXID; 	/* Chip ID Extension Register*/
	AT91_REG	 SYS_DBGU_FNTR; 	/* Force NTRST Register*/
	AT91_REG	 Reserved11[45]; 	/* */
	AT91_REG	 SYS_DBGU_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 SYS_DBGU_RCR; 	/* Receive Counter Register*/
	AT91_REG	 SYS_DBGU_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 SYS_DBGU_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 SYS_DBGU_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 SYS_DBGU_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 SYS_DBGU_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 SYS_DBGU_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 SYS_DBGU_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 SYS_DBGU_PTSR; 	/* PDC Transfer Status Register*/
	AT91_REG	 Reserved12[54]; 	/* */
	AT91_REG	 SYS_AIC_SMR[32]; 	/* Source Mode Register*/
	AT91_REG	 SYS_AIC_SVR[32]; 	/* Source Vector Register*/
	AT91_REG	 SYS_AIC_IVR; 	/* IRQ Vector Register*/
	AT91_REG	 SYS_AIC_FVR; 	/* FIQ Vector Register*/
	AT91_REG	 SYS_AIC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_AIC_IPR; 	/* Interrupt Pending Register*/
	AT91_REG	 SYS_AIC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_AIC_CISR; 	/* Core Interrupt Status Register*/
	AT91_REG	 Reserved13[2]; 	/* */
	AT91_REG	 SYS_AIC_IECR; 	/* Interrupt Enable Command Register*/
	AT91_REG	 SYS_AIC_IDCR; 	/* Interrupt Disable Command Register*/
	AT91_REG	 SYS_AIC_ICCR; 	/* Interrupt Clear Command Register*/
	AT91_REG	 SYS_AIC_ISCR; 	/* Interrupt Set Command Register*/
	AT91_REG	 SYS_AIC_EOICR; 	/* End of Interrupt Command Register*/
	AT91_REG	 SYS_AIC_SPU; 	/* Spurious Vector Register*/
	AT91_REG	 SYS_AIC_DCR; 	/* Debug Control Register (Protect)*/
	AT91_REG	 Reserved14[1]; 	/* */
	AT91_REG	 SYS_AIC_FFER; 	/* Fast Forcing Enable Register*/
	AT91_REG	 SYS_AIC_FFDR; 	/* Fast Forcing Disable Register*/
	AT91_REG	 SYS_AIC_FFSR; 	/* Fast Forcing Status Register*/
	AT91_REG	 Reserved15[45]; 	/* */
	AT91_REG	 SYS_PIOA_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOA_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOA_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved16[1]; 	/* */
	AT91_REG	 SYS_PIOA_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOA_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOA_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved17[1]; 	/* */
	AT91_REG	 SYS_PIOA_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOA_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOA_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved18[1]; 	/* */
	AT91_REG	 SYS_PIOA_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOA_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOA_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOA_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOA_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOA_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOA_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOA_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOA_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOA_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOA_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved19[1]; 	/* */
	AT91_REG	 SYS_PIOA_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOA_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOA_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved20[1]; 	/* */
	AT91_REG	 SYS_PIOA_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOA_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOA_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved21[9]; 	/* */
	AT91_REG	 SYS_PIOA_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOA_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOA_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved22[85]; 	/* */
	AT91_REG	 SYS_PIOB_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOB_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOB_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved23[1]; 	/* */
	AT91_REG	 SYS_PIOB_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOB_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOB_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved24[1]; 	/* */
	AT91_REG	 SYS_PIOB_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOB_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOB_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved25[1]; 	/* */
	AT91_REG	 SYS_PIOB_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOB_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOB_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOB_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOB_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOB_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOB_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOB_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOB_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOB_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOB_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved26[1]; 	/* */
	AT91_REG	 SYS_PIOB_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOB_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOB_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved27[1]; 	/* */
	AT91_REG	 SYS_PIOB_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOB_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOB_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved28[9]; 	/* */
	AT91_REG	 SYS_PIOB_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOB_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOB_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved29[85]; 	/* */
	AT91_REG	 SYS_PIOC_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOC_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOC_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved30[1]; 	/* */
	AT91_REG	 SYS_PIOC_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOC_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOC_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved31[1]; 	/* */
	AT91_REG	 SYS_PIOC_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOC_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOC_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved32[1]; 	/* */
	AT91_REG	 SYS_PIOC_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOC_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOC_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOC_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOC_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOC_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOC_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved33[1]; 	/* */
	AT91_REG	 SYS_PIOC_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOC_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOC_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved34[1]; 	/* */
	AT91_REG	 SYS_PIOC_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOC_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOC_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved35[9]; 	/* */
	AT91_REG	 SYS_PIOC_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOC_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOC_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved36[85]; 	/* */
	AT91_REG	 SYS_PIOD_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOD_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOD_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved37[1]; 	/* */
	AT91_REG	 SYS_PIOD_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOD_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOD_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved38[1]; 	/* */
	AT91_REG	 SYS_PIOD_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOD_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOD_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved39[1]; 	/* */
	AT91_REG	 SYS_PIOD_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOD_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOD_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOD_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOD_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOD_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOD_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOD_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOD_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOD_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOD_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved40[1]; 	/* */
	AT91_REG	 SYS_PIOD_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOD_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOD_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved41[1]; 	/* */
	AT91_REG	 SYS_PIOD_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOD_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOD_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved42[9]; 	/* */
	AT91_REG	 SYS_PIOD_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOD_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOD_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved43[85]; 	/* */
	AT91_REG	 SYS_PIOE_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOE_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOE_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved44[1]; 	/* */
	AT91_REG	 SYS_PIOE_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOE_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOE_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved45[1]; 	/* */
	AT91_REG	 SYS_PIOE_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOE_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOE_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved46[1]; 	/* */
	AT91_REG	 SYS_PIOE_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOE_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOE_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOE_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOE_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOE_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOE_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOE_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOE_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOE_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOE_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved47[1]; 	/* */
	AT91_REG	 SYS_PIOE_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOE_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOE_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved48[1]; 	/* */
	AT91_REG	 SYS_PIOE_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOE_BSR; 	/* Select B Register*/
