una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* -------- PWMC_MR : (PWMC Offset: 0x0) PWMC Mode Register -------- */
#define AT91C_PWMC_DIVA       ((unsigned int) 0xFF <<  0) /* (PWMC) CLKA divide factor.*/
#define AT91C_PWMC_PREA       ((unsigned int) 0xF <<  8) /* (PWMC) Divider Input Clock Prescaler A*/
#define 	AT91C_PWMC_PREA_MCK                  ((unsigned int) 0x0 <<  8) /* (PWMC) */
#define AT91C_PWMC_DIVB       ((unsigned int) 0xFF << 16) /* (PWMC) CLKB divide factor.*/
#define AT91C_PWMC_PREB       ((unsigned int) 0xF << 24) /* (PWMC) Divider Input Clock Prescaler B*/
#define 	AT91C_PWMC_PREB_MCK                  ((unsigned int) 0x0 << 24) /* (PWMC) */
/* -------- PWMC_ENA : (PWMC Offset: 0x4) PWMC Enable Register -------- */
#define AT91C_PWMC_CHID0      ((unsigned int) 0x1 <<  0) /* (PWMC) Channel ID 0*/
#define AT91C_PWMC_CHID1      ((unsigned int) 0x1 <<  1) /* (PWMC) Channel ID 1*/
#define AT91C_PWMC_CHID2      ((unsigned int) 0x1 <<  2) /* (PWMC) Channel ID 2*/
#define AT91C_PWMC_CHID3      ((unsigned int) 0x1 <<  3) /* (PWMC) Channel ID 3*/
#define AT91C_PWMC_CHID4      ((unsigned int) 0x1 <<  4) /* (PWMC) Channel ID 4*/
#define AT91C_PWMC_CHID5      ((unsigned int) 0x1 <<  5) /* (PWMC) Channel ID 5*/
#define AT91C_PWMC_CHID6      ((unsigned int) 0x1 <<  6) /* (PWMC) Channel ID 6*/
#define AT91C_PWMC_CHID7      ((unsigned int) 0x1 <<  7) /* (PWMC) Channel ID 7*/
/* -------- PWMC_DIS : (PWMC Offset: 0x8) PWMC Disable Register -------- */
/* -------- PWMC_SR : (PWMC Offset: 0xc) PWMC Status Register -------- */
/* -------- PWMC_IER : (PWMC Offset: 0x10) PWMC Interrupt Enable Register -------- */
/* -------- PWMC_IDR : (PWMC Offset: 0x14) PWMC Interrupt Disable Register -------- */
/* -------- PWMC_IMR : (PWMC Offset: 0x18) PWMC Interrupt Mask Register -------- */
/* -------- PWMC_ISR : (PWMC Offset: 0x1c) PWMC Interrupt Status Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Ethernet MAC 10/100*/
/* ******************************************************************************/
typedef struct _AT91S_EMAC {
	AT91_REG	 EMAC_NCR; 	/* Network Control Register*/
	AT91_REG	 EMAC_NCFGR; 	/* Network Configuration Register*/
	AT91_REG	 EMAC_NSR; 	/* Network Status Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 EMAC_TSR; 	/* Transmit Status Register*/
	AT91_REG	 EMAC_RBQP; 	/* Receive Buffer Queue Pointer*/
	AT91_REG	 EMAC_TBQP; 	/* Transmit Buffer Queue Pointer*/
	AT91_REG	 EMAC_RSR; 	/* Receive Status Register*/
	AT91_REG	 EMAC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 EMAC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 EMAC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 EMAC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 EMAC_MAN; 	/* PHY Maintenance Register*/
	AT91_REG	 EMAC_PTR; 	/* Pause Time Register*/
	AT91_REG	 EMAC_PFR; 	/* Pause Frames received Register*/
	AT91_REG	 EMAC_FTO; 	/* Frames Transmitted OK Register*/
	AT91_REG	 EMAC_SCF; 	/* Single Collision Frame Register*/
	AT91_REG	 EMAC_MCF; 	/* Multiple Collision Frame Register*/
	AT91_REG	 EMAC_FRO; 	/* Frames Received OK Register*/
	AT91_REG	 EMAC_FCSE; 	/* Frame Check Sequence Error Register*/
	AT91_REG	 EMAC_ALE; 	/* Alignment Error Register*/
	AT91_REG	 EMAC_DTF; 	/* Deferred Transmission Frame Register*/
	AT91_REG	 EMAC_LCOL; 	/* Late Collision Register*/
	AT91_REG	 EMAC_ECOL; 	/* Excessive Collision Register*/
	AT91_REG	 EMAC_TUND; 	/* Transmit Underrun Error Register*/
	AT91_REG	 EMAC_CSE; 	/* Carrier Sense Error Register*/
	AT91_REG	 EMAC_RRE; 	/* Receive Ressource Error Register*/
	AT91_REG	 EMAC_ROV; 	/* Receive Overrun Errors Register*/
	AT91_REG	 EMAC_RSE; 	/* Receive Symbol Errors Register*/
	AT91_REG	 EMAC_ELE; 	/* Excessive Length Errors Register*/
	AT91_REG	 EMAC_RJA; 	/* Receive Jabbers Register*/
	AT91_REG	 EMAC_USF; 	/* Undersize Frames Register*/
	AT91_REG	 EMAC_STE; 	/* SQE Test Error Register*/
	AT91_REG	 EMAC_RLE; 	/* Receive Length Field Mismatch Register*/
	AT91_REG	 EMAC_TPF; 	/* Transmitted Pause Frames Register*/
	AT91_REG	 EMAC_HRB; 	/* Hash Address Bottom[31:0]*/
	AT91_REG	 EMAC_HRT; 	/* Hash Address Top[63:32]*/
	AT91_REG	 EMAC_SA1L; 	/* Specific Address 1 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA1H; 	/* Specific Address 1 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA2L; 	/* Specific Address 2 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA2H; 	/* Specific Address 2 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA3L; 	/* Specific Address 3 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA3H; 	/* Specific Address 3 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA4L; 	/* Specific Address 4 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA4H; 	/* Specific Address 4 Top, Last 2 bytes*/
	AT91_REG	 EMAC_TID; 	/* Type ID Checking Register*/
	AT91_REG	 EMAC_TPQ; 	/* Transmit Pause Quantum Register*/
	AT91_REG	 EMAC_USRIO; 	/* USER Input/Output Register*/
	AT91_REG	 EMAC_WOL; 	/* Wake On LAN Register*/
	AT91_REG	 Reserved1[13]; 	/* */
	AT91_REG	 EMAC_REV; 	/* Revision Register*/
} AT91S_EMAC, *AT91PS_EMAC;

/* -------- EMAC_NCR : (EMAC Offset: 0x0)  -------- */
#define AT91C_EMAC_LB         ((unsigned int) 0x1 <<  0) /* (EMAC) Loopback. Optional. When set, loopback signal is at high level.*/
#define AT91C_EMAC_LLB        ((unsigned int) 0x1 <<  1) /* (EMAC) Loopback local. */
#define AT91C_EMAC_RE         ((unsigned int) 0x1 <<  2) /* (EMAC) Receive enable. */
#define AT91C_EMAC_TE         ((unsigned int) 0x1 <<  3) /* (EMAC) Transmit enable. */
#define AT91C_EMAC_MPE        ((unsigned int) 0x1 <<  4) /* (EMAC) Management port enable. */
#define AT91C_EMAC_CLRSTAT    ((unsigned int) 0x1 <<  5) /* (EMAC) Clear statistics registers. */
#define AT91C_EMAC_INCSTAT    ((unsigned int) 0x1 <<  6) /* (EMAC) Increment statistics registers. */
#define AT91C_EMAC_WESTAT     ((unsigned int) 0x1 <<  7) /* (EMAC) Write enable for statistics registers. */
#define AT91C_EMAC_BP         ((unsigned int) 0x1 <<  8) /* (EMAC) Back pressure. */
#define AT91C_EMAC_TSTART     ((unsigned int) 0x1 <<  9) /* (EMAC) Start Transmission. */
#define AT91C_EMAC_THALT      ((unsigned int) 0x1 << 10) /* (EMAC) Transmission Halt. */
#define AT91C_EMAC_TPFR       ((unsigned int) 0x1 << 11) /* (EMAC) Transmit pause frame */
#define AT91C_EMAC_TZQ        ((unsigned int) 0x1 << 12) /* (EMAC) Transmit zero quantum pause frame*/
/* -------- EMAC_NCFGR : (EMAC Offset: 0x4) Network Configuration Register -------- */
#define AT91C_EMAC_SPD        ((unsigned int) 0x1 <<  0) /* (EMAC) Speed. */
#define AT91C_EMAC_FD         ((unsigned int) 0x1 <<  1) /* (EMAC) Full duplex. */
#define AT91C_EMAC_JFRAME     ((unsigned int) 0x1 <<  3) /* (EMAC) Jumbo Frames. */
#define AT91C_EMAC_CAF        ((unsigned int) 0x1 <<  4) /* (EMAC) Copy all frames. */
#define AT91C_EMAC_NBC        ((unsigned int) 0x1 <<  5) /* (EMAC) No broadcast. */
#define AT91C_EMAC_MTI        ((unsigned int) 0x1 <<  6) /* (EMAC) Multicast hash event enable*/
#define AT91C_EMAC_UNI        ((unsigned int) 0x1 <<  7) /* (EMAC) Unicast hash enable. */
#define AT91C_EMAC_BIG        ((unsigned int) 0x1 <<  8) /* (EMAC) Receive 1522 bytes. */
#define AT91C_EMAC_EAE        ((unsigned int) 0x1 <<  9) /* (EMAC) External address match enable. */
#define AT91C_EMAC_CLK        ((unsigned int) 0x3 << 10) /* (EMAC) */
#define 	AT91C_EMAC_CLK_HCLK_8               ((unsigned int) 0x0 << 10) /* (EMAC) HCLK divided by 8*/
#define 	AT91C_EMAC_CLK_HCLK_16              ((unsigned int) 0x1 << 10) /* (EMAC) HCLK divided by 16*/
#define 	AT91C_EMAC_CLK_HCLK_32              ((unsigned int) 0x2 << 10) /* (EMAC) HCLK divided by 32*/
#define 	AT91C_EMAC_CLK_HCLK_64              ((unsigned int) 0x3 << 10) /* (EMAC) HCLK divided by 64*/
#define AT91C_EMAC_RTY        ((unsigned int) 0x1 << 12) /* (EMAC) */
#define AT91C_EMAC_PAE        ((unsigned int) 0x1 << 13) /* (EMAC) */
#define AT91C_EMAC_RBOF       ((unsigned int) 0x3 << 14) /* (EMAC) */
#define 	AT91C_EMAC_RBOF_OFFSET_0             ((unsigned int) 0x0 << 14) /* (EMAC) no offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_1             ((unsigned int) 0x1 << 14) /* (EMAC) one byte offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_2             ((unsigned int) 0x2 << 14) /* (EMAC) two bytes offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_3             ((unsigned int) 0x3 << 14) /* (EMAC) three bytes offset from start of receive buffer*/
#define AT91C_EMAC_RLCE       ((unsigned int) 0x1 << 16) /* (EMAC) Receive Length field Checking Enable*/
#define AT91C_EMAC_DRFCS      ((unsigned int) 0x1 << 17) /* (EMAC) Discard Receive FCS*/
#define AT91C_EMAC_EFRHD      ((unsigned int) 0x1 << 18) /* (EMAC) */
#define AT91C_EMAC_IRXFCS     ((unsigned int) 0x1 << 19) /* (EMAC) Ignore RX FCS*/
/* -------- EMAC_NSR : (EMAC Offset: 0x8) Network Status Register -------- */
#define AT91C_EMAC_LINKR      ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_MDIO       ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_IDLE       ((unsigned int) 0x1 <<  2) /* (EMAC) */
/* -------- EMAC_TSR : (EMAC Offset: 0x14) Transmit Status Register -------- */
#define AT91C_EMAC_UBR        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_COL        ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_RLES       ((unsigned int) 0x1 <<  2) /* (EMAC) */
#define AT91C_EMAC_TGO        ((unsigned int) 0x1 <<  3) /* (EMAC) Transmit Go*/
#define AT91C_EMAC_BEX        ((unsigned int) 0x1 <<  4) /* (EMAC) Buffers exhausted mid frame*/
#define AT91C_EMAC_COMP       ((unsigned int) 0x1 <<  5) /* (EMAC) */
#define AT91C_EMAC_UND        ((unsigned int) 0x1 <<  6) /* (EMAC) */
/* -------- EMAC_RSR : (EMAC Offset: 0x20) Receive Status Register -------- */
#define AT91C_EMAC_BNA        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_REC        ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_OVR        ((unsigned int) 0x1 <<  2) /* (EMAC) */
/* -------- EMAC_ISR : (EMAC Offset: 0x24) Interrupt Status Register -------- */
#define AT91C_EMAC_MFD        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_RCOMP      ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_RXUBR      ((unsigned int) 0x1 <<  2) /* (EMAC) */
#define AT91C_EMAC_TXUBR      ((unsigned int) 0x1 <<  3) /* (EMAC) */
#define AT91C_EMAC_TUNDR      ((unsigned int) 0x1 <<  4) /* (EMAC) */
#define AT91C_EMAC_RLEX       ((unsigned int) 0x1 <<  5) /* (EMAC) */
#define AT91C_EMAC_TXERR      ((unsigned int) 0x1 <<  6) /* (EMAC) */
#define AT91C_EMAC_TCOMP      ((unsigned int) 0x1 <<  7) /* (EMAC) */
#define AT91C_EMAC_LINK       ((unsigned int) 0x1 <<  9) /* (EMAC) */
#define AT91C_EMAC_ROVR       ((unsigned int) 0x1 << 10) /* (EMAC) */
#define AT91C_EMAC_HRESP      ((unsigned int) 0x1 << 11) /* (EMAC) */
#define AT91C_EMAC_PFRE       ((unsigned int) 0x1 << 12) /* (EMAC) */
#define AT91C_EMAC_PTZ        ((unsigned int) 0x1 << 13) /* (EMAC) */
/* -------- EMAC_IER : (EMAC Offset: 0x28) Interrupt Enable Register -------- */
/* -------- EMAC_IDR : (EMAC Offset: 0x2c) Interrupt Disable Register -------- */
/* -------- EMAC_IMR : (EMAC Offset: 0x30) Interrupt Mask Register -------- */
/* -------- EMAC_MAN : (EMAC Offset: 0x34) PHY Maintenance Register -------- */
#define AT91C_EMAC_DATA       ((unsigned int) 0xFFFF <<  0) /* (EMAC) */
#define AT91C_EMAC_CODE       ((unsigned int) 0x3 << 16) /* (EMAC) */
#define AT91C_EMAC_REGA       ((unsigned int) 0x1F << 18) /* (EMAC) */
#define AT91C_EMAC_PHYA       ((unsigned int) 0x1F << 23) /* (EMAC) */
#define AT91C_EMAC_RW         ((unsigned int) 0x3 << 28) /* (EMAC) */
#define AT91C_EMAC_SOF        ((unsigned int) 0x3 << 30) /* (EMAC) */
/* -------- EMAC_USRIO : (EMAC Offset: 0xc0) USER Input Output Register -------- */
#define AT91C_EMAC_RMII       ((unsigned int) 0x1 <<  0) /* (EMAC) Reduce MII*/
#define AT91C_EMAC_CLKEN      ((unsigned int) 0x1 <<  1) /* (EMAC) Clock Enable*/
/* -------- EMAC_WOL : (EMAC Offset: 0xc4) Wake On LAN Register -------- */
#define AT91C_EMAC_IP         ((unsigned int) 0xFFFF <<  0) /* (EMAC) ARP request IP address*/
#define AT91C_EMAC_MAG        ((unsigned int) 0x1 << 16) /* (EMAC) Magic packet event enable*/
#define AT91C_EMAC_ARP        ((unsigned int) 0x1 << 17) /* (EMAC) ARP request event enable*/
#define AT91C_EMAC_SA1        ((unsigned int) 0x1 << 18) /* (EMAC) Specific address register 1 event enable*/
/* -------- EMAC_REV : (EMAC Offset: 0xfc) Revision Register -------- */
#define AT91C_EMAC_REVREF     ((unsigned int) 0xFFFF <<  0) /* (EMAC) */
#define AT91C_EMAC_PARTREF    ((unsigned int) 0xFFFF << 16) /* (EMAC) */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR LCD Controller*/
/* ******************************************************************************/
typedef struct _AT91S_LCDC {
	AT91_REG	 LCDC_BA1; 	/* DMA Base Address Register 1*/
	AT91_REG	 LCDC_BA2; 	/* DMA Base Address Register 2*/
	AT91_REG	 LCDC_FRMP1; 	/* DMA Frame Pointer Register 1*/
	AT91_REG	 LCDC_FRMP2; 	/* DMA Frame Pointer Register 2*/
	AT91_REG	 LCDC_FRMA1; 	/* DMA Frame Address Register 1*/
	AT91_REG	 LCDC_FRMA2; 	/* DMA Frame Address Register 2*/
	AT91_REG	 LCDC_FRMCFG; 	/* DMA Frame Configuration Register*/
	AT91_REG	 LCDC_DMACON; 	/* DMA Control Register*/
	AT91_REG	 LCDC_DMA2DCFG; 	/* DMA 2D addressing configuration*/
	AT91_REG	 Reserved0[503]; 	/* */
	AT91_REG	 LCDC_LCDCON1; 	/* LCD Control 1 Register*/
	AT91_REG	 LCDC_LCDCON2; 	/* LCD Control 2 Register*/
	AT91_REG	 LCDC_TIM1; 	/* LCD Timing Config 1 Register*/
	AT91_REG	 LCDC_TIM2; 	/* LCD Timing Config 2 Register*/
	AT91_REG	 LCDC_LCDFRCFG; 	/* LCD Frame Config Register*/
	AT91_REG	 LCDC_FIFO; 	/* LCD FIFO Register*/
	AT91_REG	 LCDC_MVAL; 	/* LCD Mode Toggle Rate Value Register*/
	AT91_REG	 LCDC_DP1_2; 	/* Dithering Pattern DP1_2 Register*/
	AT91_REG	 LCDC_DP4_7; 	/* Dithering Pattern DP4_7 Register*/
	AT91_REG	 LCDC_DP3_5; 	/* Dithering Pattern DP3_5 Register*/
	AT91_REG	 LCDC_DP2_3; 	/* Dithering Pattern DP2_3 Register*/
	AT91_REG	 LCDC_DP5_7; 	/* Dithering Pattern DP5_7 Register*/
	AT91_REG	 LCDC_DP3_4; 	/* Dithering Pattern DP3_4 Register*/
	AT91_REG	 LCDC_DP4_5; 	/* Dithering Pattern DP4_5 Register*/
	AT91_REG	 LCDC_DP6_7; 	/* Dithering Pattern DP6_7 Register*/
	AT91_REG	 LCDC_PWRCON; 	/* Power Control Register*/
	AT91_REG	 LCDC_CTRSTCON; 	/* Contrast Control Register*/
	AT91_REG	 LCDC_CTRSTVAL; 	/* Contrast Value Register*/
	AT91_REG	 LCDC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 LCDC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 LCDC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 LCDC_ISR; 	/* Interrupt Enable Register*/
	AT91_REG	 LCDC_ICR; 	/* Interrupt Clear Register*/
	AT91_REG	 LCDC_GPR; 	/* General Purpose Register*/
	AT91_REG	 LCDC_ITR; 	/* Interrupts Test Register*/
	AT91_REG	 LCDC_IRR; 	/* Interrupts Raw Status Register*/
	AT91_REG	 Reserved1[230]; 	/* */
	AT91_REG	 LCDC_LUT_ENTRY[256]; 	/* LUT Entries Register*/
} AT91S_LCDC, *AT91PS_LCDC;

