una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* -------- DMA_SAR : (DMA Offset: 0x0)  -------- */
#define AT91C_DMA_SADD        ((unsigned int) 0x0 <<  0) /* (DMA) Source Address of DMA Transfer*/
/* -------- DMA_DAR : (DMA Offset: 0x8)  -------- */
#define AT91C_DMA_DADD        ((unsigned int) 0x0 <<  0) /* (DMA) Destination Address of DMA Transfer*/
/* -------- DMA_LLP : (DMA Offset: 0x10)  -------- */
#define AT91C_DMA_LOC         ((unsigned int) 0x0 <<  0) /* (DMA) Address of the Next LLI*/
/* -------- DMA_CTLl : (DMA Offset: 0x18)  -------- */
#define AT91C_DMA_INT_EN      ((unsigned int) 0x1 <<  0) /* (DMA) Interrupt Enable Bit*/
#define AT91C_DMA_DST_TR_WIDTH ((unsigned int) 0x7 <<  1) /* (DMA) Destination Transfer Width*/
#define AT91C_DMA_SRC_TR_WIDTH ((unsigned int) 0x7 <<  4) /* (DMA) Source Transfer Width*/
#define AT91C_DMA_DINC        ((unsigned int) 0x3 <<  7) /* (DMA) Destination Address Increment*/
#define AT91C_DMA_SINC        ((unsigned int) 0x3 <<  9) /* (DMA) Source Address Increment*/
#define AT91C_DMA_DEST_MSIZE  ((unsigned int) 0x7 << 11) /* (DMA) Destination Burst Transaction Length*/
#define AT91C_DMA_SRC_MSIZE   ((unsigned int) 0x7 << 14) /* (DMA) Source Burst Transaction Length*/
#define AT91C_DMA_S_GATH_EN   ((unsigned int) 0x1 << 17) /* (DMA) Source Gather Enable Bit*/
#define AT91C_DMA_D_SCAT_EN   ((unsigned int) 0x1 << 18) /* (DMA) Destination Scatter Enable Bit*/
#define AT91C_DMA_TT_FC       ((unsigned int) 0x7 << 20) /* (DMA) Transfer Type and Flow Control*/
#define AT91C_DMA_DMS         ((unsigned int) 0x3 << 23) /* (DMA) Destination Master Select*/
#define AT91C_DMA_SMS         ((unsigned int) 0x3 << 25) /* (DMA) Source Master Select*/
#define AT91C_DMA_LLP_D_EN    ((unsigned int) 0x1 << 27) /* (DMA) Destination Block Chaining Enable*/
#define AT91C_DMA_LLP_S_EN    ((unsigned int) 0x1 << 28) /* (DMA) Source Block Chaining Enable*/
/* -------- DMA_CTLh : (DMA Offset: 0x1c)  -------- */
#define AT91C_DMA_BLOCK_TS    ((unsigned int) 0xFFF <<  0) /* (DMA) Block Transfer Size*/
#define AT91C_DMA_DONE        ((unsigned int) 0x1 << 12) /* (DMA) Done bit*/
/* -------- DMA_CFGl : (DMA Offset: 0x40)  -------- */
#define AT91C_DMA_CH_PRIOR    ((unsigned int) 0x7 <<  5) /* (DMA) Channel Priority*/
#define AT91C_DMA_CH_SUSP     ((unsigned int) 0x1 <<  8) /* (DMA) Channel Suspend*/
#define AT91C_DMA_FIFO_EMPT   ((unsigned int) 0x1 <<  9) /* (DMA) Fifo Empty*/
#define AT91C_DMA_HS_SEL_DS   ((unsigned int) 0x1 << 10) /* (DMA) Destination Software or Hardware Handshaking Select*/
#define AT91C_DMA_HS_SEL_SR   ((unsigned int) 0x1 << 11) /* (DMA) Source Software or Hardware Handshaking Select*/
#define AT91C_DMA_LOCK_CH_L   ((unsigned int) 0x3 << 12) /* (DMA) Channel Lock Level*/
#define AT91C_DMA_LOCK_B_L    ((unsigned int) 0x3 << 14) /* (DMA) Bus Lock Level*/
#define AT91C_DMA_LOCK_CH     ((unsigned int) 0x1 << 16) /* (DMA) Channel Lock Bit*/
#define AT91C_DMA_LOCK_B      ((unsigned int) 0x1 << 17) /* (DMA) Bus Lock Bit*/
#define AT91C_DMA_DS_HS_POL   ((unsigned int) 0x1 << 18) /* (DMA) Destination Handshaking Interface Polarity*/
#define AT91C_DMA_SR_HS_POL   ((unsigned int) 0x1 << 19) /* (DMA) Source Handshaking Interface Polarity*/
#define AT91C_DMA_MAX_ABRST   ((unsigned int) 0x3FF << 20) /* (DMA) Maximum AMBA Burst Length*/
#define AT91C_DMA_RELOAD_SR   ((unsigned int) 0x1 << 30) /* (DMA) Automatic Source Reload*/
#define AT91C_DMA_RELOAD_DS   ((unsigned int) 0x1 << 31) /* (DMA) Automatic Destination Reload*/
/* -------- DMA_CFGh : (DMA Offset: 0x44)  -------- */
#define AT91C_DMA_FCMODE      ((unsigned int) 0x1 <<  0) /* (DMA) Flow Control Mode*/
#define AT91C_DMA_FIFO_MODE   ((unsigned int) 0x1 <<  1) /* (DMA) Fifo Mode Select*/
#define AT91C_DMA_PROTCTL     ((unsigned int) 0x7 <<  2) /* (DMA) Protection Control*/
#define AT91C_DMA_DS_UPD_EN   ((unsigned int) 0x1 <<  5) /* (DMA) Destination Status Update Enable*/
#define AT91C_DMA_SS_UPD_EN   ((unsigned int) 0x1 <<  6) /* (DMA) Source Status Update Enable*/
#define AT91C_DMA_SRC_PER     ((unsigned int) 0xF <<  7) /* (DMA) Source Hardware Handshaking Interface*/
#define AT91C_DMA_DEST_PER    ((unsigned int) 0xF << 11) /* (DMA) Destination Hardware Handshaking Interface*/
/* -------- DMA_SGR : (DMA Offset: 0x48)  -------- */
#define AT91C_DMA_SGI         ((unsigned int) 0xFFFFF <<  0) /* (DMA) Source Gather Interval*/
#define AT91C_DMA_SGC         ((unsigned int) 0xFFF << 20) /* (DMA) Source Gather Count*/
/* -------- DMA_DSR : (DMA Offset: 0x50)  -------- */
#define AT91C_DMA_DSI         ((unsigned int) 0xFFFFF <<  0) /* (DMA) Destination Scatter Interval*/
#define AT91C_DMA_DSC         ((unsigned int) 0xFFF << 20) /* (DMA) Destination Scatter Count*/
/* -------- DMA_SAR : (DMA Offset: 0x58)  -------- */
/* -------- DMA_DAR : (DMA Offset: 0x60)  -------- */
/* -------- DMA_LLP : (DMA Offset: 0x68)  -------- */
/* -------- DMA_CTLl : (DMA Offset: 0x70)  -------- */
/* -------- DMA_CTLh : (DMA Offset: 0x74)  -------- */
/* -------- DMA_CFGl : (DMA Offset: 0x98)  -------- */
/* -------- DMA_CFGh : (DMA Offset: 0x9c)  -------- */
/* -------- DMA_SGR : (DMA Offset: 0xa0)  -------- */
/* -------- DMA_DSR : (DMA Offset: 0xa8)  -------- */
/* -------- DMA_RAWTFR : (DMA Offset: 0x2c0)  -------- */
#define AT91C_DMA_RAW         ((unsigned int) 0x7 <<  0) /* (DMA) Raw Interrupt for each Channel*/
/* -------- DMA_RAWBLOCK : (DMA Offset: 0x2c8)  -------- */
/* -------- DMA_RAWSRCTRAN : (DMA Offset: 0x2d0)  -------- */
/* -------- DMA_RAWDSTTRAN : (DMA Offset: 0x2d8)  -------- */
/* -------- DMA_RAWERR : (DMA Offset: 0x2e0)  -------- */
/* -------- DMA_STATUSTFR : (DMA Offset: 0x2e8)  -------- */
#define AT91C_DMA_STATUS      ((unsigned int) 0x7 <<  0) /* (DMA) Interrupt for each Channel*/
/* -------- DMA_STATUSBLOCK : (DMA Offset: 0x2f0)  -------- */
/* -------- DMA_STATUSSRCTRAN : (DMA Offset: 0x2f8)  -------- */
/* -------- DMA_STATUSDSTTRAN : (DMA Offset: 0x300)  -------- */
/* -------- DMA_STATUSERR : (DMA Offset: 0x308)  -------- */
/* -------- DMA_MASKTFR : (DMA Offset: 0x310)  -------- */
#define AT91C_DMA_INT_MASK    ((unsigned int) 0x7 <<  0) /* (DMA) Interrupt Mask for each Channel*/
#define AT91C_DMA_INT_M_WE    ((unsigned int) 0x7 <<  8) /* (DMA) Interrupt Mask Write Enable for each Channel*/
/* -------- DMA_MASKBLOCK : (DMA Offset: 0x318)  -------- */
/* -------- DMA_MASKSRCTRAN : (DMA Offset: 0x320)  -------- */
/* -------- DMA_MASKDSTTRAN : (DMA Offset: 0x328)  -------- */
/* -------- DMA_MASKERR : (DMA Offset: 0x330)  -------- */
/* -------- DMA_CLEARTFR : (DMA Offset: 0x338)  -------- */
#define AT91C_DMA_CLEAR       ((unsigned int) 0x7 <<  0) /* (DMA) Interrupt Clear for each Channel*/
/* -------- DMA_CLEARBLOCK : (DMA Offset: 0x340)  -------- */
/* -------- DMA_CLEARSRCTRAN : (DMA Offset: 0x348)  -------- */
/* -------- DMA_CLEARDSTTRAN : (DMA Offset: 0x350)  -------- */
/* -------- DMA_CLEARERR : (DMA Offset: 0x358)  -------- */
/* -------- DMA_STATUSINT : (DMA Offset: 0x360)  -------- */
#define AT91C_DMA_TFR         ((unsigned int) 0x1 <<  0) /* (DMA) OR of the content of StatusTfr Register*/
#define AT91C_DMA_BLOCK       ((unsigned int) 0x1 <<  1) /* (DMA) OR of the content of StatusBlock Register*/
#define AT91C_DMA_SRCT        ((unsigned int) 0x1 <<  2) /* (DMA) OR of the content of StatusSrcTran Register*/
#define AT91C_DMA_DSTT        ((unsigned int) 0x1 <<  3) /* (DMA) OR of the content of StatusDstTran Register*/
#define AT91C_DMA_ERR         ((unsigned int) 0x1 <<  4) /* (DMA) OR of the content of StatusErr Register*/
/* -------- DMA_REQSRCREG : (DMA Offset: 0x368)  -------- */
#define AT91C_DMA_SRC_REQ     ((unsigned int) 0x7 <<  0) /* (DMA) Source Request*/
#define AT91C_DMA_REQ_WE      ((unsigned int) 0x7 <<  8) /* (DMA) Request Write Enable*/
/* -------- DMA_REQDSTREG : (DMA Offset: 0x370)  -------- */
#define AT91C_DMA_DST_REQ     ((unsigned int) 0x7 <<  0) /* (DMA) Destination Request*/
/* -------- DMA_SGLREQSRCREG : (DMA Offset: 0x378)  -------- */
#define AT91C_DMA_S_SG_REQ    ((unsigned int) 0x7 <<  0) /* (DMA) Source Single Request*/
/* -------- DMA_SGLREQDSTREG : (DMA Offset: 0x380)  -------- */
#define AT91C_DMA_D_SG_REQ    ((unsigned int) 0x7 <<  0) /* (DMA) Destination Single Request*/
/* -------- DMA_LSTREQSRCREG : (DMA Offset: 0x388)  -------- */
#define AT91C_DMA_LSTSRC      ((unsigned int) 0x7 <<  0) /* (DMA) Source Last Transaction Request*/
#define AT91C_DMA_LSTSR_WE    ((unsigned int) 0x7 <<  8) /* (DMA) Source Last Transaction Request Write Enable*/
/* -------- DMA_LSTREQDSTREG : (DMA Offset: 0x390)  -------- */
#define AT91C_DMA_LSTDST      ((unsigned int) 0x7 <<  0) /* (DMA) Destination Last Transaction Request*/
#define AT91C_DMA_LSTDS_WE    ((unsigned int) 0x7 <<  8) /* (DMA) Destination Last Transaction Request Write Enable*/
/* -------- DMA_DMACFGREG : (DMA Offset: 0x398)  -------- */
#define AT91C_DMA_DMA_EN      ((unsigned int) 0x7 <<  0) /* (DMA) Controller Enable*/
/* -------- DMA_CHENREG : (DMA Offset: 0x3a0)  -------- */
#define AT91C_DMA_CH_EN       ((unsigned int) 0x7 <<  0) /* (DMA) Channel Enable*/
#define AT91C_DMA_CH_EN_WE    ((unsigned int) 0x7 <<  8) /* (DMA) Channel Enable Write Enable*/
/* -------- DMA_DMATESTREG : (DMA Offset: 0x3b0)  -------- */
#define AT91C_DMA_TEST_SLV_IF ((unsigned int) 0x1 <<  0) /* (DMA) Test Mode for Slave Interface*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR USB Device Interface*/
/* ******************************************************************************/
typedef struct _AT91S_UDP {
	AT91_REG	 UDP_NUM; 	/* Frame Number Register*/
	AT91_REG	 UDP_GLBSTATE; 	/* Global State Register*/
	AT91_REG	 UDP_FADDR; 	/* Function Address Register*/
	AT91_REG	 Reserved0[1]; 	/* */
	AT91_REG	 UDP_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 UDP_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 UDP_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 UDP_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 UDP_ICR; 	/* Interrupt Clear Register*/
	AT91_REG	 Reserved1[1]; 	/* */
	AT91_REG	 UDP_RSTEP; 	/* Reset Endpoint Register*/
	AT91_REG	 Reserved2[1]; 	/* */
	AT91_REG	 UDP_CSR[6]; 	/* Endpoint Control and Status Register*/
	AT91_REG	 Reserved3[2]; 	/* */
	AT91_REG	 UDP_FDR[6]; 	/* Endpoint FIFO Data Register*/
	AT91_REG	 Reserved4[3]; 	/* */
	AT91_REG	 UDP_TXVC; 	/* Transceiver Control Register*/
} AT91S_UDP, *AT91PS_UDP;

/* -------- UDP_FRM_NUM : (UDP Offset: 0x0) USB Frame Number Register -------- */
#define AT91C_UDP_FRM_NUM     ((unsigned int) 0x7FF <<  0) /* (UDP) Frame Number as Defined in the Packet Field Formats*/
#define AT91C_UDP_FRM_ERR     ((unsigned int) 0x1 << 16) /* (UDP) Frame Error*/
#define AT91C_UDP_FRM_OK      ((unsigned int) 0x1 << 17) /* (UDP) Frame OK*/
/* -------- UDP_GLB_STATE : (UDP Offset: 0x4) USB Global State Register -------- */
#define AT91C_UDP_FADDEN      ((unsigned int) 0x1 <<  0) /* (UDP) Function Address Enable*/
#define AT91C_UDP_CONFG       ((unsigned int) 0x1 <<  1) /* (UDP) Configured*/
#define AT91C_UDP_ESR         ((unsigned int) 0x1 <<  2) /* (UDP) Enable Send Resume*/
#define AT91C_UDP_RSMINPR     ((unsigned int) 0x1 <<  3) /* (UDP) A Resume Has Been Sent to the Host*/
#define AT91C_UDP_RMWUPE      ((unsigned int) 0x1 <<  4) /* (UDP) Remote Wake Up Enable*/
/* -------- UDP_FADDR : (UDP Offset: 0x8) USB Function Address Register -------- */
#define AT91C_UDP_FADD        ((unsigned int) 0xFF <<  0) /* (UDP) Function Address Value*/
#define AT91C_UDP_FEN         ((unsigned int) 0x1 <<  8) /* (UDP) Function Enable*/
/* -------- UDP_IER : (UDP Offset: 0x10) USB Interrupt Enable Register -------- */
#define AT91C_UDP_EPINT0      ((unsigned int) 0x1 <<  0) /* (UDP) Endpoint 0 Interrupt*/
#define AT91C_UDP_EPINT1      ((unsigned int) 0x1 <<  1) /* (UDP) Endpoint 0 Interrupt*/
#define AT91C_UDP_EPINT2      ((unsigned int) 0x1 <<  2) /* (UDP) Endpoint 2 Interrupt*/
#define AT91C_UDP_EPINT3      ((unsigned int) 0x1 <<  3) /* (UDP) Endpoint 3 Interrupt*/
#define AT91C_UDP_EPINT4      ((unsigned int) 0x1 <<  4) /* (UDP) Endpoint 4 Interrupt*/
#define AT91C_UDP_EPINT5      ((unsigned int) 0x1 <<  5) /* (UDP) Endpoint 5 Interrupt*/
#define AT91C_UDP_RXSUSP      ((unsigned int) 0x1 <<  8) /* (UDP) USB Suspend Interrupt*/
#define AT91C_UDP_RXRSM       ((unsigned int) 0x1 <<  9) /* (UDP) USB Resume Interrupt*/
#define AT91C_UDP_EXTRSM      ((unsigned int) 0x1 << 10) /* (UDP) USB External Resume Interrupt*/
#define AT91C_UDP_SOFINT      ((unsigned int) 0x1 << 11) /* (UDP) USB Start Of frame Interrupt*/
#define AT91C_UDP_WAKEUP      ((unsigned int) 0x1 << 13) /* (UDP) USB Resume Interrupt*/
/* -------- UDP_IDR : (UDP Offset: 0x14) USB Interrupt Disable Register -------- */
/* -------- UDP_IMR : (UDP Offset: 0x18) USB Interrupt Mask Register -------- */
/* -------- UDP_ISR : (UDP Offset: 0x1c) USB Interrupt Status Register -------- */
#define AT91C_UDP_ENDBUSRES   ((unsigned int) 0x1 << 12) /* (UDP) USB End Of Bus Reset Interrupt*/
/* -------- UDP_ICR : (UDP Offset: 0x20) USB Interrupt Clear Register -------- */
/* -------- UDP_RST_EP : (UDP Offset: 0x28) USB Reset Endpoint Register -------- */
#define AT91C_UDP_EP0         ((unsigned int) 0x1 <<  0) /* (UDP) Reset Endpoint 0*/
#define AT91C_UDP_EP1         ((unsigned int) 0x1 <<  1) /* (UDP) Reset Endpoint 1*/
#define AT91C_UDP_EP2         ((unsigned int) 0x1 <<  2) /* (UDP) Reset Endpoint 2*/
#define AT91C_UDP_EP3         ((unsigned int) 0x1 <<  3) /* (UDP) Reset Endpoint 3*/
#define AT91C_UDP_EP4         ((unsigned int) 0x1 <<  4) /* (UDP) Reset Endpoint 4*/
#define AT91C_UDP_EP5         ((unsigned int) 0x1 <<  5) /* (UDP) Reset Endpoint 5*/
/* -------- UDP_CSR : (UDP Offset: 0x30) USB Endpoint Control and Status Register -------- */
#define AT91C_UDP_TXCOMP      ((unsigned int) 0x1 <<  0) /* (UDP) Generates an IN packet with data previously written in the DPR*/
#define AT91C_UDP_RX_DATA_BK0 ((unsigned int) 0x1 <<  1) /* (UDP) Receive Data Bank 0*/
#define AT91C_UDP_RXSETUP     ((unsigned int) 0x1 <<  2) /* (UDP) Sends STALL to the Host (Control endpoints)*/
#define AT91C_UDP_ISOERROR    ((unsigned int) 0x1 <<  3) /* (UDP) Isochronous error (Isochronous endpoints)*/
#define AT91C_UDP_STALLSENT   ((unsigned int) 0x1 <<  3) /* (UDP) Stall sent (Control, bulk, interrupt endpoints)*/
#define AT91C_UDP_TXPKTRDY    ((unsigned int) 0x1 <<  4) /* (UDP) Transmit Packet Ready*/
#define AT91C_UDP_FORCESTALL  ((unsigned int) 0x1 <<  5) /* (UDP) Force Stall (used by Control, Bulk and Isochronous endpoints).*/
#define AT91C_UDP_RX_DATA_BK1 ((unsigned int) 0x1 <<  6) /* (UDP) Receive Data Bank 1 (only used by endpoints with ping-pong attributes).*/
#define AT91C_UDP_DIR         ((unsigned int) 0x1 <<  7) /* (UDP) Transfer Direction*/
#define AT91C_UDP_EPTYPE      ((unsigned int) 0x7 <<  8) /* (UDP) Endpoint type*/
#define 	AT91C_UDP_EPTYPE_CTRL                 ((unsigned int) 0x0 <<  8) /* (UDP) Control*/
#define 	AT91C_UDP_EPTYPE_ISO_OUT              ((unsigned int) 0x1 <<  8) /* (UDP) Isochronous OUT*/
#define 	AT91C_UDP_EPTYPE_BULK_OUT             ((unsigned int) 0x2 <<  8) /* (UDP) Bulk OUT*/
#define 	AT91C_UDP_EPTYPE_INT_OUT              ((unsigned int) 0x3 <<  8) /* (UDP) Interrupt OUT*/
#define 	AT91C_UDP_EPTYPE_ISO_IN               ((unsigned int) 0x5 <<  8) /* (UDP) Isochronous IN*/
#define 	AT91C_UDP_EPTYPE_BULK_IN              ((unsigned int) 0x6 <<  8) /* (UDP) Bulk IN*/
#define 	AT91C_UDP_EPTYPE_INT_IN               ((unsigned int) 0x7 <<  8) /* (UDP) Interrupt IN*/
#define AT91C_UDP_DTGLE       ((unsigned int) 0x1 << 11) /* (UDP) Data Toggle*/
#define AT91C_UDP_EPEDS       ((unsigned int) 0x1 << 15) /* (UDP) Endpoint Enable Disable*/
#define AT91C_UDP_RXBYTECNT   ((unsigned int) 0x7FF << 16) /* (UDP) Number Of Bytes Available in the FIFO*/
/* -------- UDP_TXVC : (UDP Offset: 0x74) Transceiver Control Register -------- */
#define AT91C_UDP_TXVDIS      ((unsigned int) 0x1 <<  8) /* (UDP) */
#define AT91C_UDP_PUON        ((unsigned int) 0x1 <<  9) /* (UDP) Pull-up ON*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR USB Host Interface*/
/* ******************************************************************************/
typedef struct _AT91S_UHP {
	AT91_REG	 UHP_HcRevision; 	/* Revision*/
	AT91_REG	 UHP_HcControl; 	/* Operating modes for the Host Controller*/
	AT91_REG	 UHP_HcCommandStatus; 	/* Command & status Register*/
	AT91_REG	 UHP_HcInterruptStatus; 	/* Interrupt Status Register*/
	AT91_REG	 UHP_HcInterruptEnable; 	/* Interrupt Enable Register*/
	AT91_REG	 UHP_HcInterruptDisable; 	/* Interrupt Disable Register*/
	AT91_REG	 UHP_HcHCCA; 	/* Pointer to the Host Controller Communication Area*/
	AT91_REG	 UHP_HcPeriodCurrentED; 	/* Current Isochronous or Interrupt Endpoint Descriptor*/
	AT91_REG	 UHP_HcControlHeadED; 	/* First Endpoint Descriptor of the Control list*/
	AT91_REG	 UHP_HcControlCurrentED; 	/* Endpoint Control and Status Register*/
	AT91_REG	 UHP_HcBulkHeadED; 	/* First endpoint register of the Bulk list*/
	AT91_REG	 UHP_HcBulkCurrentED; 	/* Current endpoint of the Bulk list*/
	AT91_REG	 UHP_HcBulkDoneHead; 	/* Last completed transfer descriptor*/
	AT91_REG	 UHP_HcFmInterval; 	/* Bit time between 2 consecutive SOFs*/
	AT91_REG	 UHP_HcFmRemaining; 	/* Bit time remaining in the current Frame*/
	AT91_REG	 UHP_HcFmNumber; 	/* Frame number*/
	AT91_REG	 UHP_HcPeriodicStart; 	/* Periodic Start*/
	AT91_REG	 UHP_HcLSThreshold; 	/* LS Threshold*/
	AT91_REG	 UHP_HcRhDescriptorA; 	/* Root Hub characteristics A*/
	AT91_REG	 UHP_HcRhDescriptorB; 	/* Root Hub characteristics B*/
	AT91_REG	 UHP_HcRhStatus; 	/* Root Hub Status register*/
	AT91_REG	 UHP_HcRhPortStatus[2]; 	/* Root Hub Port Status Register*/
} AT91S_UHP, *AT91PS_UHP;


/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Trickbox (external) / SIMULATION ONLY*/
/* ******************************************************************************/
typedef struct _AT91S_TBOX {
	AT91_REG	 TBOX_SHMCTRL; 	/* SHM Probe Control: 0-> shm probe stopped, 1: shm probe started*/
	AT91_REG	 Reserved0[515]; 	/* */
	AT91_REG	 TBOX_DMAEXTREQ; 	/* DMA External request lines 3 to 0*/
	AT91_REG	 Reserved1[59]; 	/* */
	AT91_REG	 TBOX_PIOAPUN; 	/* Spy on PIO PUN inputs*/
	AT91_REG	 TBOX_PIOBPUN; 	/* Spy on PIO PUN inputs*/
	AT91_REG	 TBOX_PIOCPUN; 	/* Spy on PIO PUN inputs*/
	AT91_REG	 TBOX_PIODPUN; 	/* Spy on PIO PUN inputs*/
	AT91_REG	 TBOX_PIOEPUN; 	/* Spy on PIO PUN inputs*/
	AT91_REG	 TBOX_PIOAENABLEFORCE; 	/* If each bit is 1, the corresponding bit of PIOA is controlled by TBOX_PIOAFORCEVALUE*/
	AT91_REG	 TBOX_PIOAFORCEVALUE; 	/* Value to force on PIOA when bits TBOX_PIOAENABLEFORCE are 1*/
	AT91_REG	 TBOX_PIOBENABLEFORCE; 	/* If each bit is 1, the corresponding bit of PIOB is controlled by TBOX_PIOBFORCEVALUE*/
	AT91_REG	 TBOX_PIOBFORCEVALUE; 	/* Value to force on PIOA when bits TBOX_PIOBENABLEFORCE are 1*/
	AT91_REG	 TBOX_PIOCENABLEFORCE; 	/* If each bit is 1, the corresponding bit of PIOC is controlled by TBOX_PIOCFORCEVALUE*/
	AT91_REG	 TBOX_PIOCFORCEVALUE; 	/* Value to force on PIOA when bits TBOX_PIOCENABLEFORCE are 1*/
	AT91_REG	 TBOX_PIODENABLEFORCE; 	/* If each bit is 1, the corresponding bit of PIOD is controlled by TBOX_PIODFORCEVALUE*/
	AT91_REG	 TBOX_PIODFORCEVALUE; 	/* Value to force on PIOA when bits TBOX_PIODENABLEFORCE are 1*/
	AT91_REG	 TBOX_PIOEENABLEFORCE; 	/* If each bit is 1, the corresponding bit of PIOE is controlled by TBOX_PIOEFORCEVALUE*/
	AT91_REG	 TBOX_PIOEFORCEVALUE; 	/* Value to force on PIOA when bits TBOX_PIOEENABLEFORCE are 1*/
	AT91_REG	 TBOX_PIOA; 	/* Value Of PIOA*/
	AT91_REG	 TBOX_PIOB; 	/* Value Of PIOB*/
	AT91_REG	 TBOX_PIOC; 	/* Value Of PIOC*/
	AT91_REG	 TBOX_PIOD; 	/* Value Of PIOD*/
	AT91_REG	 TBOX_PIOE; 	/* Value Of PIOE*/
	AT91_REG	 Reserved2[44]; 	/* */
	AT91_REG	 TBOX_AC97START; 	/* Start of AC97 test: swith PIO mux to connect PIOs to audio codec model.*/
	AT91_REG	 TBOX_PWMSTART; 	/* Start of PWM test: Start to count edges on PWM IOs*/
	AT91_REG	 TBOX_PWM1; 	/* PWM1[4:0]=nb pulses on pb7, PWM1[9:5]=nb pulses on pc28, PWM1[20:16]=nb pulses on pb8, PWM1[25:21]=nb pulses on pc3*/
	AT91_REG	 TBOX_PWM2; 	/* PWM2[3:0]=nb pulses on pb27, PWM2[7:4]=nb pulses on pc29, PWM2[19:16]=nb pulses on pb29, PWM2[23:20]=nb pulses on pe10*/
	AT91_REG	 TBOX_MAC; 	/* MAC testbench : bit 0 = rxtrig, bit 1 = clkofftester, bit 2 = err_sig_loops*/
	AT91_REG	 TBOX_USBDEV; 	/* USB device testbench : bit 0 = flag0, bit 1 = flag1*/
	AT91_REG	 TBOX_KBD; 	/* Keyboard testbench : bit 0 = keypressed; bits[7:6] = key column; bits[5:4] = key row;*/
	AT91_REG	 TBOX_STOPAPBSPY; 	/* When 1, no more APB SPY messages*/
	AT91_REG	 Reserved3[56]; 	/* */
	AT91_REG	 TBOX_GPSSYNCHRO; 	/* GPS synchronization (Stimulus)*/
	AT91_REG	 TBOX_GPSRAND; 	/* GPS random data for correlator (Stimulus - Internal Node)*/
	AT91_REG	 TBOX_GPSACQSTATUS; 	/* GPS acquisition status (Probe - Internal Node)*/
	AT91_REG	 TBOX_GPSACQDATA; 	/* GPS acquisition data (Probe - Internal Node)*/
	AT91_REG	 Reserved4[36]; 	/* */
	AT91_REG	 TBOX_GPSSIGFILE; 	/* GPS RFIN/DRFIN driven from files/Samples_GPS.data*/
	AT91_REG	 TBOX_GPSSIGIA; 	/* GPS DRFIN[1:0] aka SIGI_A (Stimulus)*/
	AT91_REG	 TBOX_GPSSIGQA; 	/* GPS DRFIN[3:2] aka SIGQ_A (Stimulus)*/
	AT91_REG	 Reserved5[1]; 	/* */
	AT91_REG	 TBOX_GPSSIGIB; 	/* GPS DRFIN[5:4] aka SIGI_B (Stimulus)*/
	AT91_REG	 TBOX_GPSSIGQB; 	/* GPS DRFIN[7:6] aka SIGQ_B (Stimulus)*/
	AT91_REG	 Reserved6[2]; 	/* */
	AT91_REG	 TBOX_GPSDUMPRES; 	/* GPS Dump results and errors*/
} AT91S_TBOX, *AT91PS_TBOX;

/* -------- TBOX_DMAEXTREQ : (TBOX Offset: 0x810)  -------- */
#define AT91C_TBOX_DMAEXTREQ0 ((unsigned int) 0x1 <<  0) /* (TBOX) DMA external request 0*/
#define AT91C_TBOX_DMAEXTREQ1 ((unsigned int) 0x1 <<  1) /* (TBOX) DMA external request 1*/
#define AT91C_TBOX_DMAEXTREQ2 ((unsigned int) 0x1 <<  2) /* (TBOX) DMA external request 2*/
#define AT91C_TBOX_DMAEXTREQ3 ((unsigned int) 0x1 <<  3) /* (TBOX) DMA external request 3*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Error Correction Code controller*/
/* ******************************************************************************/
typedef struct _AT91S_ECC {
	AT91_REG	 ECC_CR; 	/*  ECC reset register*/
	AT91_REG	 ECC_MR; 	/*  ECC Page size register*/
	AT91_REG	 ECC_SR; 	/*  ECC Status register*/
	AT91_REG	 ECC_PR; 	/*  ECC Parity register*/
	AT91_REG	 ECC_NPR; 	/*  ECC Parity N register*/
	AT91_REG	 Reserved0[58]; 	/* */
	AT91_REG	 ECC_VR; 	/*  ECC Version register*/
} AT91S_ECC, *AT91PS_ECC;

