una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- */
#define AT91C_ECC_RST         ((unsigned int) 0x1 <<  0) /* (ECC) ECC reset parity*/
/* -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- */
#define AT91C_ECC_PAGE_SIZE   ((unsigned int) 0x3 <<  0) /* (ECC) Nand Flash page size*/
/* -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- */
#define AT91C_ECC_RECERR      ((unsigned int) 0x1 <<  0) /* (ECC) ECC error*/
#define AT91C_ECC_ECCERR      ((unsigned int) 0x1 <<  1) /* (ECC) ECC single error*/
#define AT91C_ECC_MULERR      ((unsigned int) 0x1 <<  2) /* (ECC) ECC_MULERR*/
/* -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- */
#define AT91C_ECC_BITADDR     ((unsigned int) 0xF <<  0) /* (ECC) Bit address error*/
#define AT91C_ECC_WORDADDR    ((unsigned int) 0xFFF <<  4) /* (ECC) address of the failing bit*/
/* -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- */
#define AT91C_ECC_NPARITY     ((unsigned int) 0xFFFF <<  0) /* (ECC) ECC parity N */
/* -------- ECC_VR : (ECC Offset: 0xfc) ECC version register -------- */
#define AT91C_ECC_VR          ((unsigned int) 0xF <<  0) /* (ECC) ECC version register*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Image Sensor Interface*/
/* ******************************************************************************/
typedef struct _AT91S_ISI {
	AT91_REG	 ISI_CR1; 	/* Control Register 1*/
	AT91_REG	 ISI_CR2; 	/* Control Register 2*/
	AT91_REG	 ISI_SR; 	/* Status Register*/
	AT91_REG	 ISI_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 ISI_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 ISI_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 ISI_PSIZE; 	/* Preview Size Register*/
	AT91_REG	 ISI_PDECF; 	/* Preview Decimation Factor Register*/
	AT91_REG	 ISI_PFBD; 	/* Preview Frame Buffer Address Register*/
	AT91_REG	 ISI_CDBA; 	/* Codec Dma Address Register*/
	AT91_REG	 ISI_Y2RSET0; 	/* Color Space Conversion Register*/
	AT91_REG	 ISI_Y2RSET1; 	/* Color Space Conversion Register*/
	AT91_REG	 ISI_R2YSET0; 	/* Color Space Conversion Register*/
	AT91_REG	 ISI_R2YSET1; 	/* Color Space Conversion Register*/
	AT91_REG	 ISI_R2YSET2; 	/* Color Space Conversion Register*/
} AT91S_ISI, *AT91PS_ISI;

/* -------- ISI_CR1 : (ISI Offset: 0x0) ISI Control Register 1 -------- */
#define AT91C_ISI_RST         ((unsigned int) 0x1 <<  0) /* (ISI) Image sensor interface reset*/
#define AT91C_ISI_DISABLE     ((unsigned int) 0x1 <<  1) /* (ISI) image sensor disable.*/
#define AT91C_ISI_HSYNC_POL   ((unsigned int) 0x1 <<  2) /* (ISI) Horizontal synchronisation polarity*/
#define AT91C_ISI_PIXCLK_POL  ((unsigned int) 0x1 <<  4) /* (ISI) Pixel Clock Polarity*/
#define AT91C_ISI_EMB_SYNC    ((unsigned int) 0x1 <<  6) /* (ISI) Embedded synchronisation*/
#define AT91C_ISI_CRC_SYNC    ((unsigned int) 0x1 <<  7) /* (ISI) CRC correction*/
#define AT91C_ISI_FULL        ((unsigned int) 0x1 << 12) /* (ISI) Full mode is allowed*/
#define AT91C_ISI_THMASK      ((unsigned int) 0x3 << 13) /* (ISI) DMA Burst Mask*/
#define 	AT91C_ISI_THMASK_4_8_16_BURST         ((unsigned int) 0x0 << 13) /* (ISI) 4,8 and 16 AHB burst are allowed*/
#define 	AT91C_ISI_THMASK_8_16_BURST           ((unsigned int) 0x1 << 13) /* (ISI) 8 and 16 AHB burst are allowed*/
#define 	AT91C_ISI_THMASK_16_BURST             ((unsigned int) 0x2 << 13) /* (ISI) Only 16 AHB burst are allowed*/
#define AT91C_ISI_CODEC_ON    ((unsigned int) 0x1 << 15) /* (ISI) Enable the codec path*/
#define AT91C_ISI_SLD         ((unsigned int) 0xFF << 16) /* (ISI) Start of Line Delay*/
#define AT91C_ISI_SFD         ((unsigned int) 0xFF << 24) /* (ISI) Start of frame Delay*/
/* -------- ISI_CR2 : (ISI Offset: 0x4) ISI Control Register 2 -------- */
#define AT91C_ISI_IM_VSIZE    ((unsigned int) 0x7FF <<  0) /* (ISI) Vertical size of the Image sensor [0..2047]*/
#define AT91C_ISI_GS_MODE     ((unsigned int) 0x1 << 11) /* (ISI) Grayscale Memory Mode*/
#define AT91C_ISI_RGB_MODE    ((unsigned int) 0x3 << 12) /* (ISI) RGB mode*/
#define 	AT91C_ISI_RGB_MODE_RGB_888              ((unsigned int) 0x0 << 12) /* (ISI) RGB 8:8:8 24 bits*/
#define 	AT91C_ISI_RGB_MODE_RGB_565              ((unsigned int) 0x1 << 12) /* (ISI) RGB 5:6:5 16 bits*/
#define 	AT91C_ISI_RGB_MODE_RGB_555              ((unsigned int) 0x2 << 12) /* (ISI) RGB 5:5:5 16 bits*/
#define AT91C_ISI_GRAYSCALE   ((unsigned int) 0x1 << 13) /* (ISI) Grayscale Mode*/
#define AT91C_ISI_RGB_SWAP    ((unsigned int) 0x1 << 14) /* (ISI) RGB Swap*/
#define AT91C_ISI_COL_SPACE   ((unsigned int) 0x1 << 15) /* (ISI) Color space for the image data*/
#define AT91C_ISI_IM_HSIZE    ((unsigned int) 0x7FF << 16) /* (ISI) Horizontal size of the Image sensor [0..2047]*/
#define 	AT91C_ISI_RGB_MODE_YCC_DEF              ((unsigned int) 0x0 << 28) /* (ISI) Cb(i) Y(i) Cr(i) Y(i+1)*/
#define 	AT91C_ISI_RGB_MODE_YCC_MOD1             ((unsigned int) 0x1 << 28) /* (ISI) Cr(i) Y(i) Cb(i) Y(i+1)*/
#define 	AT91C_ISI_RGB_MODE_YCC_MOD2             ((unsigned int) 0x2 << 28) /* (ISI) Y(i) Cb(i) Y(i+1) Cr(i)*/
#define 	AT91C_ISI_RGB_MODE_YCC_MOD3             ((unsigned int) 0x3 << 28) /* (ISI) Y(i) Cr(i) Y(i+1) Cb(i)*/
#define AT91C_ISI_RGB_CFG     ((unsigned int) 0x3 << 30) /* (ISI) RGB configuration*/
#define 	AT91C_ISI_RGB_CFG_RGB_DEF              ((unsigned int) 0x0 << 30) /* (ISI) R/G(MSB)  G(LSB)/B  R/G(MSB)  G(LSB)/B*/
#define 	AT91C_ISI_RGB_CFG_RGB_MOD1             ((unsigned int) 0x1 << 30) /* (ISI) B/G(MSB)  G(LSB)/R  B/G(MSB)  G(LSB)/R*/
#define 	AT91C_ISI_RGB_CFG_RGB_MOD2             ((unsigned int) 0x2 << 30) /* (ISI) G(LSB)/R  B/G(MSB)  G(LSB)/R  B/G(MSB)*/
#define 	AT91C_ISI_RGB_CFG_RGB_MOD3             ((unsigned int) 0x3 << 30) /* (ISI) G(LSB)/B  R/G(MSB)  G(LSB)/B  R/G(MSB)*/
/* -------- ISI_SR : (ISI Offset: 0x8) ISI Status Register -------- */
#define AT91C_ISI_SOF         ((unsigned int) 0x1 <<  0) /* (ISI) Start of Frame*/
#define AT91C_ISI_DIS         ((unsigned int) 0x1 <<  1) /* (ISI) Image Sensor Interface disable*/
#define AT91C_ISI_SOFTRST     ((unsigned int) 0x1 <<  2) /* (ISI) Software Reset*/
#define AT91C_ISI_CRC_ERR     ((unsigned int) 0x1 <<  4) /* (ISI) CRC synchronisation error*/
#define AT91C_ISI_FO_C_OVF    ((unsigned int) 0x1 <<  5) /* (ISI) Fifo Codec Overflow */
#define AT91C_ISI_FO_P_OVF    ((unsigned int) 0x1 <<  6) /* (ISI) Fifo Preview Overflow */
#define AT91C_ISI_FO_P_EMP    ((unsigned int) 0x1 <<  7) /* (ISI) Fifo Preview Empty*/
#define AT91C_ISI_FO_C_EMP    ((unsigned int) 0x1 <<  8) /* (ISI) Fifo Codec Empty*/
#define AT91C_ISI_FR_OVR      ((unsigned int) 0x1 <<  9) /* (ISI) Frame rate overun*/
/* -------- ISI_IER : (ISI Offset: 0xc) ISI Interrupt Enable Register -------- */
/* -------- ISI_IDR : (ISI Offset: 0x10) ISI Interrupt Disable Register -------- */
/* -------- ISI_IMR : (ISI Offset: 0x14) ISI Interrupt Mask Register -------- */
/* -------- ISI_PSIZE : (ISI Offset: 0x20) ISI Preview Register -------- */
#define AT91C_ISI_PREV_VSIZE  ((unsigned int) 0x3FF <<  0) /* (ISI) Vertical size for the preview path*/
#define AT91C_ISI_PREV_HSIZE  ((unsigned int) 0x3FF << 16) /* (ISI) Horizontal size for the preview path*/
/* -------- ISI_Y2R_SET0 : (ISI Offset: 0x30) Color Space Conversion YCrCb to RGB Register -------- */
#define AT91C_ISI_Y2R_C0      ((unsigned int) 0xFF <<  0) /* (ISI) Color Space Conversion Matrix Coefficient C0*/
#define AT91C_ISI_Y2R_C1      ((unsigned int) 0xFF <<  8) /* (ISI) Color Space Conversion Matrix Coefficient C1*/
#define AT91C_ISI_Y2R_C2      ((unsigned int) 0xFF << 16) /* (ISI) Color Space Conversion Matrix Coefficient C2*/
#define AT91C_ISI_Y2R_C3      ((unsigned int) 0xFF << 24) /* (ISI) Color Space Conversion Matrix Coefficient C3*/
/* -------- ISI_Y2R_SET1 : (ISI Offset: 0x34) ISI Color Space Conversion YCrCb to RGB set 1 Register -------- */
#define AT91C_ISI_Y2R_C4      ((unsigned int) 0x1FF <<  0) /* (ISI) Color Space Conversion Matrix Coefficient C4*/
#define AT91C_ISI_Y2R_YOFF    ((unsigned int) 0xFF << 12) /* (ISI) Color Space Conversion Luninance default offset*/
#define AT91C_ISI_Y2R_CROFF   ((unsigned int) 0xFF << 13) /* (ISI) Color Space Conversion Red Chrominance default offset*/
#define AT91C_ISI_Y2R_CBFF    ((unsigned int) 0xFF << 14) /* (ISI) Color Space Conversion Luninance default offset*/
/* -------- ISI_R2Y_SET0 : (ISI Offset: 0x38) Color Space Conversion RGB to YCrCb set 0 register -------- */
#define AT91C_ISI_R2Y_C0      ((unsigned int) 0x7F <<  0) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C0*/
#define AT91C_ISI_R2Y_C1      ((unsigned int) 0x7F <<  1) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C1*/
#define AT91C_ISI_R2Y_C2      ((unsigned int) 0x7F <<  3) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C2*/
#define AT91C_ISI_R2Y_ROFF    ((unsigned int) 0x1 <<  4) /* (ISI) Color Space Conversion Red component offset*/
/* -------- ISI_R2Y_SET1 : (ISI Offset: 0x3c) Color Space Conversion RGB to YCrCb set 1 register -------- */
#define AT91C_ISI_R2Y_C3      ((unsigned int) 0x7F <<  0) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C3*/
#define AT91C_ISI_R2Y_C4      ((unsigned int) 0x7F <<  1) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C4*/
#define AT91C_ISI_R2Y_C5      ((unsigned int) 0x7F <<  3) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C5*/
#define AT91C_ISI_R2Y_GOFF    ((unsigned int) 0x1 <<  4) /* (ISI) Color Space Conversion Green component offset*/
/* -------- ISI_R2Y_SET2 : (ISI Offset: 0x40) Color Space Conversion RGB to YCrCb set 2 register -------- */
#define AT91C_ISI_R2Y_C6      ((unsigned int) 0x7F <<  0) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C6*/
#define AT91C_ISI_R2Y_C7      ((unsigned int) 0x7F <<  1) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C7*/
#define AT91C_ISI_R2Y_C8      ((unsigned int) 0x7F <<  3) /* (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C8*/
#define AT91C_ISI_R2Y_BOFF    ((unsigned int) 0x1 <<  4) /* (ISI) Color Space Conversion Blue component offset*/

