una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* ******************************************************************************/
/*               REGISTER ADDRESS DEFINITION FOR AT91SAM9263*/
/* ******************************************************************************/
/* ========== Register definition for SYS peripheral ========== */
#define AT91C_SYS_ECC1  ((AT91_REG *) 	0xFFFFE600) /* (SYS) ECC 0*/
#define AT91C_SYS_ECC0  ((AT91_REG *) 	0xFFFFE000) /* (SYS) ECC 0*/
#define AT91C_SYS_GPBR  ((AT91_REG *) 	0xFFFFFD60) /* (SYS) General Purpose Register*/
/* ========== Register definition for EBI0 peripheral ========== */
#define AT91C_EBI0_DUMMY ((AT91_REG *) 	0xFFFFE200) /* (EBI0) Dummy register - Do not use*/
/* ========== Register definition for SDRAMC0 peripheral ========== */
#define AT91C_SDRAMC0_MDR ((AT91_REG *) 	0xFFFFE224) /* (SDRAMC0) SDRAM Memory Device Register*/
#define AT91C_SDRAMC0_IDR ((AT91_REG *) 	0xFFFFE218) /* (SDRAMC0) SDRAM Controller Interrupt Disable Register*/
#define AT91C_SDRAMC0_IMR ((AT91_REG *) 	0xFFFFE21C) /* (SDRAMC0) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRAMC0_ISR ((AT91_REG *) 	0xFFFFE220) /* (SDRAMC0) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRAMC0_HSR ((AT91_REG *) 	0xFFFFE20C) /* (SDRAMC0) SDRAM Controller High Speed Register*/
#define AT91C_SDRAMC0_TR ((AT91_REG *) 	0xFFFFE204) /* (SDRAMC0) SDRAM Controller Refresh Timer Register*/
#define AT91C_SDRAMC0_CR ((AT91_REG *) 	0xFFFFE208) /* (SDRAMC0) SDRAM Controller Configuration Register*/
#define AT91C_SDRAMC0_MR ((AT91_REG *) 	0xFFFFE200) /* (SDRAMC0) SDRAM Controller Mode Register*/
#define AT91C_SDRAMC0_LPR ((AT91_REG *) 	0xFFFFE210) /* (SDRAMC0) SDRAM Controller Low Power Register*/
#define AT91C_SDRAMC0_IER ((AT91_REG *) 	0xFFFFE214) /* (SDRAMC0) SDRAM Controller Interrupt Enable Register*/
/* ========== Register definition for SMC0 peripheral ========== */
#define AT91C_SMC0_CYCLE6 ((AT91_REG *) 	0xFFFFE468) /* (SMC0)  Cycle Register for CS 6*/
#define AT91C_SMC0_SETUP6 ((AT91_REG *) 	0xFFFFE460) /* (SMC0)  Setup Register for CS 6*/
#define AT91C_SMC0_PULSE3 ((AT91_REG *) 	0xFFFFE434) /* (SMC0)  Pulse Register for CS 3*/
#define AT91C_SMC0_CYCLE1 ((AT91_REG *) 	0xFFFFE418) /* (SMC0)  Cycle Register for CS 1*/
#define AT91C_SMC0_SETUP5 ((AT91_REG *) 	0xFFFFE450) /* (SMC0)  Setup Register for CS 5*/
#define AT91C_SMC0_CYCLE7 ((AT91_REG *) 	0xFFFFE478) /* (SMC0)  Cycle Register for CS 7*/
#define AT91C_SMC0_PULSE0 ((AT91_REG *) 	0xFFFFE404) /* (SMC0)  Pulse Register for CS 0*/
#define AT91C_SMC0_CYCLE5 ((AT91_REG *) 	0xFFFFE458) /* (SMC0)  Cycle Register for CS 5*/
#define AT91C_SMC0_CTRL0 ((AT91_REG *) 	0xFFFFE40C) /* (SMC0)  Control Register for CS 0*/
#define AT91C_SMC0_SETUP7 ((AT91_REG *) 	0xFFFFE470) /* (SMC0)  Setup Register for CS 7*/
#define AT91C_SMC0_CTRL4 ((AT91_REG *) 	0xFFFFE44C) /* (SMC0)  Control Register for CS 4*/
#define AT91C_SMC0_CTRL1 ((AT91_REG *) 	0xFFFFE41C) /* (SMC0)  Control Register for CS 1*/
#define AT91C_SMC0_CYCLE2 ((AT91_REG *) 	0xFFFFE428) /* (SMC0)  Cycle Register for CS 2*/
#define AT91C_SMC0_PULSE7 ((AT91_REG *) 	0xFFFFE474) /* (SMC0)  Pulse Register for CS 7*/
#define AT91C_SMC0_PULSE6 ((AT91_REG *) 	0xFFFFE464) /* (SMC0)  Pulse Register for CS 6*/
#define AT91C_SMC0_CYCLE4 ((AT91_REG *) 	0xFFFFE448) /* (SMC0)  Cycle Register for CS 4*/
#define AT91C_SMC0_CYCLE0 ((AT91_REG *) 	0xFFFFE408) /* (SMC0)  Cycle Register for CS 0*/
#define AT91C_SMC0_CTRL6 ((AT91_REG *) 	0xFFFFE46C) /* (SMC0)  Control Register for CS 6*/
#define AT91C_SMC0_CTRL5 ((AT91_REG *) 	0xFFFFE45C) /* (SMC0)  Control Register for CS 5*/
#define AT91C_SMC0_SETUP0 ((AT91_REG *) 	0xFFFFE400) /* (SMC0)  Setup Register for CS 0*/
#define AT91C_SMC0_SETUP4 ((AT91_REG *) 	0xFFFFE440) /* (SMC0)  Setup Register for CS 4*/
#define AT91C_SMC0_PULSE1 ((AT91_REG *) 	0xFFFFE414) /* (SMC0)  Pulse Register for CS 1*/
#define AT91C_SMC0_CTRL2 ((AT91_REG *) 	0xFFFFE42C) /* (SMC0)  Control Register for CS 2*/
#define AT91C_SMC0_SETUP2 ((AT91_REG *) 	0xFFFFE420) /* (SMC0)  Setup Register for CS 2*/
#define AT91C_SMC0_CTRL3 ((AT91_REG *) 	0xFFFFE43C) /* (SMC0)  Control Register for CS 3*/
#define AT91C_SMC0_SETUP3 ((AT91_REG *) 	0xFFFFE430) /* (SMC0)  Setup Register for CS 3*/
#define AT91C_SMC0_CTRL7 ((AT91_REG *) 	0xFFFFE47C) /* (SMC0)  Control Register for CS 7*/
#define AT91C_SMC0_PULSE5 ((AT91_REG *) 	0xFFFFE454) /* (SMC0)  Pulse Register for CS 5*/
#define AT91C_SMC0_PULSE4 ((AT91_REG *) 	0xFFFFE444) /* (SMC0)  Pulse Register for CS 4*/
#define AT91C_SMC0_PULSE2 ((AT91_REG *) 	0xFFFFE424) /* (SMC0)  Pulse Register for CS 2*/
#define AT91C_SMC0_CYCLE3 ((AT91_REG *) 	0xFFFFE438) /* (SMC0)  Cycle Register for CS 3*/
#define AT91C_SMC0_SETUP1 ((AT91_REG *) 	0xFFFFE410) /* (SMC0)  Setup Register for CS 1*/
/* ========== Register definition for EBI1 peripheral ========== */
#define AT91C_EBI1_DUMMY ((AT91_REG *) 	0xFFFFE800) /* (EBI1) Dummy register - Do not use*/
/* ========== Register definition for SDRAMC1 peripheral ========== */
#define AT91C_SDRAMC1_IMR ((AT91_REG *) 	0xFFFFE81C) /* (SDRAMC1) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRAMC1_LPR ((AT91_REG *) 	0xFFFFE810) /* (SDRAMC1) SDRAM Controller Low Power Register*/
#define AT91C_SDRAMC1_CR ((AT91_REG *) 	0xFFFFE808) /* (SDRAMC1) SDRAM Controller Configuration Register*/
#define AT91C_SDRAMC1_HSR ((AT91_REG *) 	0xFFFFE80C) /* (SDRAMC1) SDRAM Controller High Speed Register*/
#define AT91C_SDRAMC1_MDR ((AT91_REG *) 	0xFFFFE824) /* (SDRAMC1) SDRAM Memory Device Register*/
#define AT91C_SDRAMC1_MR ((AT91_REG *) 	0xFFFFE800) /* (SDRAMC1) SDRAM Controller Mode Register*/
#define AT91C_SDRAMC1_ISR ((AT91_REG *) 	0xFFFFE820) /* (SDRAMC1) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRAMC1_IDR ((AT91_REG *) 	0xFFFFE818) /* (SDRAMC1) SDRAM Controller Interrupt Disable Register*/
#define AT91C_SDRAMC1_IER ((AT91_REG *) 	0xFFFFE814) /* (SDRAMC1) SDRAM Controller Interrupt Enable Register*/
#define AT91C_SDRAMC1_TR ((AT91_REG *) 	0xFFFFE804) /* (SDRAMC1) SDRAM Controller Refresh Timer Register*/
/* ========== Register definition for SMC1 peripheral ========== */
#define AT91C_SMC1_PULSE4 ((AT91_REG *) 	0xFFFFEA44) /* (SMC1)  Pulse Register for CS 4*/
#define AT91C_SMC1_SETUP2 ((AT91_REG *) 	0xFFFFEA20) /* (SMC1)  Setup Register for CS 2*/
#define AT91C_SMC1_CYCLE0 ((AT91_REG *) 	0xFFFFEA08) /* (SMC1)  Cycle Register for CS 0*/
#define AT91C_SMC1_SETUP7 ((AT91_REG *) 	0xFFFFEA70) /* (SMC1)  Setup Register for CS 7*/
#define AT91C_SMC1_PULSE7 ((AT91_REG *) 	0xFFFFEA74) /* (SMC1)  Pulse Register for CS 7*/
#define AT91C_SMC1_CTRL0 ((AT91_REG *) 	0xFFFFEA0C) /* (SMC1)  Control Register for CS 0*/
#define AT91C_SMC1_SETUP3 ((AT91_REG *) 	0xFFFFEA30) /* (SMC1)  Setup Register for CS 3*/
#define AT91C_SMC1_SETUP4 ((AT91_REG *) 	0xFFFFEA40) /* (SMC1)  Setup Register for CS 4*/
#define AT91C_SMC1_CYCLE6 ((AT91_REG *) 	0xFFFFEA68) /* (SMC1)  Cycle Register for CS 6*/
#define AT91C_SMC1_CTRL1 ((AT91_REG *) 	0xFFFFEA1C) /* (SMC1)  Control Register for CS 1*/
#define AT91C_SMC1_CYCLE3 ((AT91_REG *) 	0xFFFFEA38) /* (SMC1)  Cycle Register for CS 3*/
#define AT91C_SMC1_CTRL5 ((AT91_REG *) 	0xFFFFEA5C) /* (SMC1)  Control Register for CS 5*/
#define AT91C_SMC1_CTRL3 ((AT91_REG *) 	0xFFFFEA3C) /* (SMC1)  Control Register for CS 3*/
#define AT91C_SMC1_CYCLE4 ((AT91_REG *) 	0xFFFFEA48) /* (SMC1)  Cycle Register for CS 4*/
#define AT91C_SMC1_SETUP6 ((AT91_REG *) 	0xFFFFEA60) /* (SMC1)  Setup Register for CS 6*/
#define AT91C_SMC1_PULSE3 ((AT91_REG *) 	0xFFFFEA34) /* (SMC1)  Pulse Register for CS 3*/
#define AT91C_SMC1_CTRL7 ((AT91_REG *) 	0xFFFFEA7C) /* (SMC1)  Control Register for CS 7*/
#define AT91C_SMC1_SETUP1 ((AT91_REG *) 	0xFFFFEA10) /* (SMC1)  Setup Register for CS 1*/
#define AT91C_SMC1_PULSE5 ((AT91_REG *) 	0xFFFFEA54) /* (SMC1)  Pulse Register for CS 5*/
#define AT91C_SMC1_PULSE0 ((AT91_REG *) 	0xFFFFEA04) /* (SMC1)  Pulse Register for CS 0*/
#define AT91C_SMC1_CYCLE5 ((AT91_REG *) 	0xFFFFEA58) /* (SMC1)  Cycle Register for CS 5*/
#define AT91C_SMC1_PULSE6 ((AT91_REG *) 	0xFFFFEA64) /* (SMC1)  Pulse Register for CS 6*/
#define AT91C_SMC1_SETUP5 ((AT91_REG *) 	0xFFFFEA50) /* (SMC1)  Setup Register for CS 5*/
#define AT91C_SMC1_CTRL6 ((AT91_REG *) 	0xFFFFEA6C) /* (SMC1)  Control Register for CS 6*/
#define AT91C_SMC1_CTRL2 ((AT91_REG *) 	0xFFFFEA2C) /* (SMC1)  Control Register for CS 2*/
#define AT91C_SMC1_SETUP0 ((AT91_REG *) 	0xFFFFEA00) /* (SMC1)  Setup Register for CS 0*/
#define AT91C_SMC1_CYCLE7 ((AT91_REG *) 	0xFFFFEA78) /* (SMC1)  Cycle Register for CS 7*/
#define AT91C_SMC1_CYCLE1 ((AT91_REG *) 	0xFFFFEA18) /* (SMC1)  Cycle Register for CS 1*/
#define AT91C_SMC1_PULSE2 ((AT91_REG *) 	0xFFFFEA24) /* (SMC1)  Pulse Register for CS 2*/
#define AT91C_SMC1_PULSE1 ((AT91_REG *) 	0xFFFFEA14) /* (SMC1)  Pulse Register for CS 1*/
#define AT91C_SMC1_CYCLE2 ((AT91_REG *) 	0xFFFFEA28) /* (SMC1)  Cycle Register for CS 2*/
#define AT91C_SMC1_CTRL4 ((AT91_REG *) 	0xFFFFEA4C) /* (SMC1)  Control Register for CS 4*/
/* ========== Register definition for MATRIX peripheral ========== */
#define AT91C_MATRIX_MCFG7 ((AT91_REG *) 	0xFFFFEC1C) /* (MATRIX)  Master Configuration Register 7 */
#define AT91C_MATRIX_MRCR ((AT91_REG *) 	0xFFFFED00) /* (MATRIX)  Master Remp Control Register */
#define AT91C_MATRIX_PRBS5 ((AT91_REG *) 	0xFFFFECAC) /* (MATRIX)  PRBS5*/
#define AT91C_MATRIX_SCFG6 ((AT91_REG *) 	0xFFFFEC58) /* (MATRIX)  Slave Configuration Register 6*/
#define AT91C_MATRIX_MCFG3 ((AT91_REG *) 	0xFFFFEC0C) /* (MATRIX)  Master Configuration Register 3 */
#define AT91C_MATRIX_SCFG5 ((AT91_REG *) 	0xFFFFEC54) /* (MATRIX)  Slave Configuration Register 5*/
#define AT91C_MATRIX_MCFG1 ((AT91_REG *) 	0xFFFFEC04) /* (MATRIX)  Master Configuration Register 1 */
#define AT91C_MATRIX_SCFG3 ((AT91_REG *) 	0xFFFFEC4C) /* (MATRIX)  Slave Configuration Register 3*/
#define AT91C_MATRIX_MCFG4 ((AT91_REG *) 	0xFFFFEC10) /* (MATRIX)  Master Configuration Register 4 */
#define AT91C_MATRIX_MCFG2 ((AT91_REG *) 	0xFFFFEC08) /* (MATRIX)  Master Configuration Register 2 */
#define AT91C_MATRIX_PRBS6 ((AT91_REG *) 	0xFFFFECB4) /* (MATRIX)  PRBS6*/
#define AT91C_MATRIX_SCFG4 ((AT91_REG *) 	0xFFFFEC50) /* (MATRIX)  Slave Configuration Register 4*/
#define AT91C_MATRIX_MCFG8 ((AT91_REG *) 	0xFFFFEC20) /* (MATRIX)  Master Configuration Register 8 */
#define AT91C_MATRIX_PRAS3 ((AT91_REG *) 	0xFFFFEC98) /* (MATRIX)  PRAS3*/
#define AT91C_MATRIX_PRAS4 ((AT91_REG *) 	0xFFFFECA0) /* (MATRIX)  PRAS4*/
#define AT91C_MATRIX_PRAS1 ((AT91_REG *) 	0xFFFFEC88) /* (MATRIX)  PRAS1*/
#define AT91C_MATRIX_PRAS0 ((AT91_REG *) 	0xFFFFEC80) /* (MATRIX)  PRAS0*/
#define AT91C_MATRIX_SCFG0 ((AT91_REG *) 	0xFFFFEC40) /* (MATRIX)  Slave Configuration Register 0*/
#define AT91C_MATRIX_PRBS7 ((AT91_REG *) 	0xFFFFECBC) /* (MATRIX)  PRBS7*/
#define AT91C_MATRIX_PRBS4 ((AT91_REG *) 	0xFFFFECA4) /* (MATRIX)  PRBS4*/
#define AT91C_MATRIX_PRBS2 ((AT91_REG *) 	0xFFFFEC94) /* (MATRIX)  PRBS2*/
#define AT91C_MATRIX_MCFG5 ((AT91_REG *) 	0xFFFFEC14) /* (MATRIX)  Master Configuration Register 5 */
#define AT91C_MATRIX_SCFG7 ((AT91_REG *) 	0xFFFFEC5C) /* (MATRIX)  Slave Configuration Register 7*/
#define AT91C_MATRIX_PRBS1 ((AT91_REG *) 	0xFFFFEC8C) /* (MATRIX)  PRBS1*/
#define AT91C_MATRIX_MCFG6 ((AT91_REG *) 	0xFFFFEC18) /* (MATRIX)  Master Configuration Register 6 */
#define AT91C_MATRIX_PRBS0 ((AT91_REG *) 	0xFFFFEC84) /* (MATRIX)  PRBS0*/
#define AT91C_MATRIX_MCFG0 ((AT91_REG *) 	0xFFFFEC00) /* (MATRIX)  Master Configuration Register 0 */
#define AT91C_MATRIX_PRAS5 ((AT91_REG *) 	0xFFFFECA8) /* (MATRIX)  PRAS5*/
#define AT91C_MATRIX_SCFG1 ((AT91_REG *) 	0xFFFFEC44) /* (MATRIX)  Slave Configuration Register 1*/
#define AT91C_MATRIX_PRAS7 ((AT91_REG *) 	0xFFFFECB8) /* (MATRIX)  PRAS7*/
#define AT91C_MATRIX_PRAS2 ((AT91_REG *) 	0xFFFFEC90) /* (MATRIX)  PRAS2*/
#define AT91C_MATRIX_PRAS6 ((AT91_REG *) 	0xFFFFECB0) /* (MATRIX)  PRAS6*/
#define AT91C_MATRIX_SCFG2 ((AT91_REG *) 	0xFFFFEC48) /* (MATRIX)  Slave Configuration Register 2*/
#define AT91C_MATRIX_PRBS3 ((AT91_REG *) 	0xFFFFEC9C) /* (MATRIX)  PRBS3*/
/* ========== Register definition for CCFG peripheral ========== */
#define AT91C_CCFG_MATRIXVERSION ((AT91_REG *) 	0xFFFFEDFC) /* (CCFG)  Version Register*/
#define AT91C_CCFG_TCMR ((AT91_REG *) 	0xFFFFED14) /* (CCFG)  TCM configuration*/
#define AT91C_CCFG_EBI0CSA ((AT91_REG *) 	0xFFFFED20) /* (CCFG)  EBI0 Chip Select Assignement Register*/
#define AT91C_CCFG_EBI1CSA ((AT91_REG *) 	0xFFFFED24) /* (CCFG)  EBI1 Chip Select Assignement Register*/
/* ========== Register definition for PDC_DBGU peripheral ========== */
#define AT91C_DBGU_PTCR ((AT91_REG *) 	0xFFFFEF20) /* (PDC_DBGU) PDC Transfer Control Register*/
#define AT91C_DBGU_RCR  ((AT91_REG *) 	0xFFFFEF04) /* (PDC_DBGU) Receive Counter Register*/
#define AT91C_DBGU_TCR  ((AT91_REG *) 	0xFFFFEF0C) /* (PDC_DBGU) Transmit Counter Register*/
#define AT91C_DBGU_RNCR ((AT91_REG *) 	0xFFFFEF14) /* (PDC_DBGU) Receive Next Counter Register*/
#define AT91C_DBGU_TNPR ((AT91_REG *) 	0xFFFFEF18) /* (PDC_DBGU) Transmit Next Pointer Register*/
#define AT91C_DBGU_RNPR ((AT91_REG *) 	0xFFFFEF10) /* (PDC_DBGU) Receive Next Pointer Register*/
#define AT91C_DBGU_PTSR ((AT91_REG *) 	0xFFFFEF24) /* (PDC_DBGU) PDC Transfer Status Register*/
#define AT91C_DBGU_RPR  ((AT91_REG *) 	0xFFFFEF00) /* (PDC_DBGU) Receive Pointer Register*/
#define AT91C_DBGU_TPR  ((AT91_REG *) 	0xFFFFEF08) /* (PDC_DBGU) Transmit Pointer Register*/
#define AT91C_DBGU_TNCR ((AT91_REG *) 	0xFFFFEF1C) /* (PDC_DBGU) Transmit Next Counter Register*/
/* ========== Register definition for DBGU peripheral ========== */
#define AT91C_DBGU_BRGR ((AT91_REG *) 	0xFFFFEE20) /* (DBGU) Baud Rate Generator Register*/
#define AT91C_DBGU_CR   ((AT91_REG *) 	0xFFFFEE00) /* (DBGU) Control Register*/
#define AT91C_DBGU_THR  ((AT91_REG *) 	0xFFFFEE1C) /* (DBGU) Transmitter Holding Register*/
#define AT91C_DBGU_IDR  ((AT91_REG *) 	0xFFFFEE0C) /* (DBGU) Interrupt Disable Register*/
#define AT91C_DBGU_EXID ((AT91_REG *) 	0xFFFFEE44) /* (DBGU) Chip ID Extension Register*/
#define AT91C_DBGU_IMR  ((AT91_REG *) 	0xFFFFEE10) /* (DBGU) Interrupt Mask Register*/
#define AT91C_DBGU_FNTR ((AT91_REG *) 	0xFFFFEE48) /* (DBGU) Force NTRST Register*/
#define AT91C_DBGU_IER  ((AT91_REG *) 	0xFFFFEE08) /* (DBGU) Interrupt Enable Register*/
#define AT91C_DBGU_CSR  ((AT91_REG *) 	0xFFFFEE14) /* (DBGU) Channel Status Register*/
#define AT91C_DBGU_MR   ((AT91_REG *) 	0xFFFFEE04) /* (DBGU) Mode Register*/
#define AT91C_DBGU_RHR  ((AT91_REG *) 	0xFFFFEE18) /* (DBGU) Receiver Holding Register*/
#define AT91C_DBGU_CIDR ((AT91_REG *) 	0xFFFFEE40) /* (DBGU) Chip ID Register*/
/* ========== Register definition for AIC peripheral ========== */
#define AT91C_AIC_IVR   ((AT91_REG *) 	0xFFFFF100) /* (AIC) IRQ Vector Register*/
#define AT91C_AIC_SMR   ((AT91_REG *) 	0xFFFFF000) /* (AIC) Source Mode Register*/
#define AT91C_AIC_FVR   ((AT91_REG *) 	0xFFFFF104) /* (AIC) FIQ Vector Register*/
#define AT91C_AIC_DCR   ((AT91_REG *) 	0xFFFFF138) /* (AIC) Debug Control Register (Protect)*/
#define AT91C_AIC_EOICR ((AT91_REG *) 	0xFFFFF130) /* (AIC) End of Interrupt Command Register*/
#define AT91C_AIC_SVR   ((AT91_REG *) 	0xFFFFF080) /* (AIC) Source Vector Register*/
#define AT91C_AIC_FFSR  ((AT91_REG *) 	0xFFFFF148) /* (AIC) Fast Forcing Status Register*/
#define AT91C_AIC_ICCR  ((AT91_REG *) 	0xFFFFF128) /* (AIC) Interrupt Clear Command Register*/
#define AT91C_AIC_ISR   ((AT91_REG *) 	0xFFFFF108) /* (AIC) Interrupt Status Register*/
#define AT91C_AIC_IMR   ((AT91_REG *) 	0xFFFFF110) /* (AIC) Interrupt Mask Register*/
#define AT91C_AIC_IPR   ((AT91_REG *) 	0xFFFFF10C) /* (AIC) Interrupt Pending Register*/
#define AT91C_AIC_FFER  ((AT91_REG *) 	0xFFFFF140) /* (AIC) Fast Forcing Enable Register*/
#define AT91C_AIC_IECR  ((AT91_REG *) 	0xFFFFF120) /* (AIC) Interrupt Enable Command Register*/
#define AT91C_AIC_ISCR  ((AT91_REG *) 	0xFFFFF12C) /* (AIC) Interrupt Set Command Register*/
#define AT91C_AIC_FFDR  ((AT91_REG *) 	0xFFFFF144) /* (AIC) Fast Forcing Disable Register*/
#define AT91C_AIC_CISR  ((AT91_REG *) 	0xFFFFF114) /* (AIC) Core Interrupt Status Register*/
#define AT91C_AIC_IDCR  ((AT91_REG *) 	0xFFFFF124) /* (AIC) Interrupt Disable Command Register*/
#define AT91C_AIC_SPU   ((AT91_REG *) 	0xFFFFF134) /* (AIC) Spurious Vector Register*/
/* ========== Register definition for PIOA peripheral ========== */
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0xFFFFF2A4) /* (PIOA) Output Write Disable Register*/
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0xFFFFF254) /* (PIOA) Multi-driver Disable Register*/
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0xFFFFF228) /* (PIOA) Input Filter Status Register*/
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0xFFFFF24C) /* (PIOA) Interrupt Status Register*/
#define AT91C_PIOA_CODR ((AT91_REG *) 	0xFFFFF234) /* (PIOA) Clear Output Data Register*/
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0xFFFFF204) /* (PIOA) PIO Disable Register*/
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0xFFFFF2A8) /* (PIOA) Output Write Status Register*/
#define AT91C_PIOA_ASR  ((AT91_REG *) 	0xFFFFF270) /* (PIOA) Select A Register*/
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0xFFFFF268) /* (PIOA) Pull-up Status Register*/
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0xFFFFF248) /* (PIOA) Interrupt Mask Register*/
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0xFFFFF218) /* (PIOA) Output Status Register*/
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0xFFFFF278) /* (PIOA) AB Select Status Register*/
#define AT91C_PIOA_MDER ((AT91_REG *) 	0xFFFFF250) /* (PIOA) Multi-driver Enable Register*/
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0xFFFFF224) /* (PIOA) Input Filter Disable Register*/
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0xFFFFF23C) /* (PIOA) Pin Data Status Register*/
#define AT91C_PIOA_SODR ((AT91_REG *) 	0xFFFFF230) /* (PIOA) Set Output Data Register*/
#define AT91C_PIOA_BSR  ((AT91_REG *) 	0xFFFFF274) /* (PIOA) Select B Register*/
#define AT91C_PIOA_OWER ((AT91_REG *) 	0xFFFFF2A0) /* (PIOA) Output Write Enable Register*/
#define AT91C_PIOA_IFER ((AT91_REG *) 	0xFFFFF220) /* (PIOA) Input Filter Enable Register*/
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0xFFFFF244) /* (PIOA) Interrupt Disable Register*/
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0xFFFFF214) /* (PIOA) Output Disable Registerr*/
#define AT91C_PIOA_IER  ((AT91_REG *) 	0xFFFFF240) /* (PIOA) Interrupt Enable Register*/
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0xFFFFF264) /* (PIOA) Pull-up Enable Register*/
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0xFFFFF258) /* (PIOA) Multi-driver Status Register*/
#define AT91C_PIOA_OER  ((AT91_REG *) 	0xFFFFF210) /* (PIOA) Output Enable Register*/
#define AT91C_PIOA_PER  ((AT91_REG *) 	0xFFFFF200) /* (PIOA) PIO Enable Register*/
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0xFFFFF260) /* (PIOA) Pull-up Disable Register*/
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0xFFFFF238) /* (PIOA) Output Data Status Register*/
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0xFFFFF208) /* (PIOA) PIO Status Register*/
/* ========== Register definition for PIOB peripheral ========== */
#define AT91C_PIOB_ODR  ((AT91_REG *) 	0xFFFFF414) /* (PIOB) Output Disable Registerr*/
#define AT91C_PIOB_SODR ((AT91_REG *) 	0xFFFFF430) /* (PIOB) Set Output Data Register*/
#define AT91C_PIOB_ISR  ((AT91_REG *) 	0xFFFFF44C) /* (PIOB) Interrupt Status Register*/
#define AT91C_PIOB_ABSR ((AT91_REG *) 	0xFFFFF478) /* (PIOB) AB Select Status Register*/
#define AT91C_PIOB_IER  ((AT91_REG *) 	0xFFFFF440) /* (PIOB) Interrupt Enable Register*/
#define AT91C_PIOB_PPUDR ((AT91_REG *) 	0xFFFFF460) /* (PIOB) Pull-up Disable Register*/
#define AT91C_PIOB_IMR  ((AT91_REG *) 	0xFFFFF448) /* (PIOB) Interrupt Mask Register*/
#define AT91C_PIOB_PER  ((AT91_REG *) 	0xFFFFF400) /* (PIOB) PIO Enable Register*/
#define AT91C_PIOB_IFDR ((AT91_REG *) 	0xFFFFF424) /* (PIOB) Input Filter Disable Register*/
#define AT91C_PIOB_OWDR ((AT91_REG *) 	0xFFFFF4A4) /* (PIOB) Output Write Disable Register*/
#define AT91C_PIOB_MDSR ((AT91_REG *) 	0xFFFFF458) /* (PIOB) Multi-driver Status Register*/
#define AT91C_PIOB_IDR  ((AT91_REG *) 	0xFFFFF444) /* (PIOB) Interrupt Disable Register*/
#define AT91C_PIOB_ODSR ((AT91_REG *) 	0xFFFFF438) /* (PIOB) Output Data Status Register*/
#define AT91C_PIOB_PPUSR ((AT91_REG *) 	0xFFFFF468) /* (PIOB) Pull-up Status Register*/
#define AT91C_PIOB_OWSR ((AT91_REG *) 	0xFFFFF4A8) /* (PIOB) Output Write Status Register*/
#define AT91C_PIOB_BSR  ((AT91_REG *) 	0xFFFFF474) /* (PIOB) Select B Register*/
#define AT91C_PIOB_OWER ((AT91_REG *) 	0xFFFFF4A0) /* (PIOB) Output Write Enable Register*/
#define AT91C_PIOB_IFER ((AT91_REG *) 	0xFFFFF420) /* (PIOB) Input Filter Enable Register*/
#define AT91C_PIOB_PDSR ((AT91_REG *) 	0xFFFFF43C) /* (PIOB) Pin Data Status Register*/
#define AT91C_PIOB_PPUER ((AT91_REG *) 	0xFFFFF464) /* (PIOB) Pull-up Enable Register*/
#define AT91C_PIOB_OSR  ((AT91_REG *) 	0xFFFFF418) /* (PIOB) Output Status Register*/
#define AT91C_PIOB_ASR  ((AT91_REG *) 	0xFFFFF470) /* (PIOB) Select A Register*/
#define AT91C_PIOB_MDDR ((AT91_REG *) 	0xFFFFF454) /* (PIOB) Multi-driver Disable Register*/
#define AT91C_PIOB_CODR ((AT91_REG *) 	0xFFFFF434) /* (PIOB) Clear Output Data Register*/
#define AT91C_PIOB_MDER ((AT91_REG *) 	0xFFFFF450) /* (PIOB) Multi-driver Enable Register*/
#define AT91C_PIOB_PDR  ((AT91_REG *) 	0xFFFFF404) /* (PIOB) PIO Disable Register*/
#define AT91C_PIOB_IFSR ((AT91_REG *) 	0xFFFFF428) /* (PIOB) Input Filter Status Register*/
#define AT91C_PIOB_OER  ((AT91_REG *) 	0xFFFFF410) /* (PIOB) Output Enable Register*/
#define AT91C_PIOB_PSR  ((AT91_REG *) 	0xFFFFF408) /* (PIOB) PIO Status Register*/
/* ========== Register definition for PIOC peripheral ========== */
#define AT91C_PIOC_OWDR ((AT91_REG *) 	0xFFFFF6A4) /* (PIOC) Output Write Disable Register*/
#define AT91C_PIOC_MDER ((AT91_REG *) 	0xFFFFF650) /* (PIOC) Multi-driver Enable Register*/
#define AT91C_PIOC_PPUSR ((AT91_REG *) 	0xFFFFF668) /* (PIOC) Pull-up Status Register*/
#define AT91C_PIOC_IMR  ((AT91_REG *) 	0xFFFFF648) /* (PIOC) Interrupt Mask Register*/
#define AT91C_PIOC_ASR  ((AT91_REG *) 	0xFFFFF670) /* (PIOC) Select A Register*/
#define AT91C_PIOC_PPUDR ((AT91_REG *) 	0xFFFFF660) /* (PIOC) Pull-up Disable Register*/
#define AT91C_PIOC_PSR  ((AT91_REG *) 	0xFFFFF608) /* (PIOC) PIO Status Register*/
#define AT91C_PIOC_IER  ((AT91_REG *) 	0xFFFFF640) /* (PIOC) Interrupt Enable Register*/
#define AT91C_PIOC_CODR ((AT91_REG *) 	0xFFFFF634) /* (PIOC) Clear Output Data Register*/
#define AT91C_PIOC_OWER ((AT91_REG *) 	0xFFFFF6A0) /* (PIOC) Output Write Enable Register*/
#define AT91C_PIOC_ABSR ((AT91_REG *) 	0xFFFFF678) /* (PIOC) AB Select Status Register*/
#define AT91C_PIOC_IFDR ((AT91_REG *) 	0xFFFFF624) /* (PIOC) Input Filter Disable Register*/
#define AT91C_PIOC_PDSR ((AT91_REG *) 	0xFFFFF63C) /* (PIOC) Pin Data Status Register*/
#define AT91C_PIOC_IDR  ((AT91_REG *) 	0xFFFFF644) /* (PIOC) Interrupt Disable Register*/
#define AT91C_PIOC_OWSR ((AT91_REG *) 	0xFFFFF6A8) /* (PIOC) Output Write Status Register*/
#define AT91C_PIOC_PDR  ((AT91_REG *) 	0xFFFFF604) /* (PIOC) PIO Disable Register*/
#define AT91C_PIOC_ODR  ((AT91_REG *) 	0xFFFFF614) /* (PIOC) Output Disable Registerr*/
#define AT91C_PIOC_IFSR ((AT91_REG *) 	0xFFFFF628) /* (PIOC) Input Filter Status Register*/
#define AT91C_PIOC_PPUER ((AT91_REG *) 	0xFFFFF664) /* (PIOC) Pull-up Enable Register*/
#define AT91C_PIOC_SODR ((AT91_REG *) 	0xFFFFF630) /* (PIOC) Set Output Data Register*/
#define AT91C_PIOC_ISR  ((AT91_REG *) 	0xFFFFF64C) /* (PIOC) Interrupt Status Register*/
#define AT91C_PIOC_ODSR ((AT91_REG *) 	0xFFFFF638) /* (PIOC) Output Data Status Register*/
