una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
#define AT91C_PIOC_OSR  ((AT91_REG *) 	0xFFFFF618) /* (PIOC) Output Status Register*/
#define AT91C_PIOC_MDSR ((AT91_REG *) 	0xFFFFF658) /* (PIOC) Multi-driver Status Register*/
#define AT91C_PIOC_IFER ((AT91_REG *) 	0xFFFFF620) /* (PIOC) Input Filter Enable Register*/
#define AT91C_PIOC_BSR  ((AT91_REG *) 	0xFFFFF674) /* (PIOC) Select B Register*/
#define AT91C_PIOC_MDDR ((AT91_REG *) 	0xFFFFF654) /* (PIOC) Multi-driver Disable Register*/
#define AT91C_PIOC_OER  ((AT91_REG *) 	0xFFFFF610) /* (PIOC) Output Enable Register*/
#define AT91C_PIOC_PER  ((AT91_REG *) 	0xFFFFF600) /* (PIOC) PIO Enable Register*/
/* ========== Register definition for PIOD peripheral ========== */
#define AT91C_PIOD_OWDR ((AT91_REG *) 	0xFFFFF8A4) /* (PIOD) Output Write Disable Register*/
#define AT91C_PIOD_SODR ((AT91_REG *) 	0xFFFFF830) /* (PIOD) Set Output Data Register*/
#define AT91C_PIOD_PPUER ((AT91_REG *) 	0xFFFFF864) /* (PIOD) Pull-up Enable Register*/
#define AT91C_PIOD_CODR ((AT91_REG *) 	0xFFFFF834) /* (PIOD) Clear Output Data Register*/
#define AT91C_PIOD_PSR  ((AT91_REG *) 	0xFFFFF808) /* (PIOD) PIO Status Register*/
#define AT91C_PIOD_PDR  ((AT91_REG *) 	0xFFFFF804) /* (PIOD) PIO Disable Register*/
#define AT91C_PIOD_ODR  ((AT91_REG *) 	0xFFFFF814) /* (PIOD) Output Disable Registerr*/
#define AT91C_PIOD_PPUSR ((AT91_REG *) 	0xFFFFF868) /* (PIOD) Pull-up Status Register*/
#define AT91C_PIOD_ABSR ((AT91_REG *) 	0xFFFFF878) /* (PIOD) AB Select Status Register*/
#define AT91C_PIOD_IFSR ((AT91_REG *) 	0xFFFFF828) /* (PIOD) Input Filter Status Register*/
#define AT91C_PIOD_OER  ((AT91_REG *) 	0xFFFFF810) /* (PIOD) Output Enable Register*/
#define AT91C_PIOD_IMR  ((AT91_REG *) 	0xFFFFF848) /* (PIOD) Interrupt Mask Register*/
#define AT91C_PIOD_ASR  ((AT91_REG *) 	0xFFFFF870) /* (PIOD) Select A Register*/
#define AT91C_PIOD_MDDR ((AT91_REG *) 	0xFFFFF854) /* (PIOD) Multi-driver Disable Register*/
#define AT91C_PIOD_OWSR ((AT91_REG *) 	0xFFFFF8A8) /* (PIOD) Output Write Status Register*/
#define AT91C_PIOD_PER  ((AT91_REG *) 	0xFFFFF800) /* (PIOD) PIO Enable Register*/
#define AT91C_PIOD_IDR  ((AT91_REG *) 	0xFFFFF844) /* (PIOD) Interrupt Disable Register*/
#define AT91C_PIOD_MDER ((AT91_REG *) 	0xFFFFF850) /* (PIOD) Multi-driver Enable Register*/
#define AT91C_PIOD_PDSR ((AT91_REG *) 	0xFFFFF83C) /* (PIOD) Pin Data Status Register*/
#define AT91C_PIOD_MDSR ((AT91_REG *) 	0xFFFFF858) /* (PIOD) Multi-driver Status Register*/
#define AT91C_PIOD_OWER ((AT91_REG *) 	0xFFFFF8A0) /* (PIOD) Output Write Enable Register*/
#define AT91C_PIOD_BSR  ((AT91_REG *) 	0xFFFFF874) /* (PIOD) Select B Register*/
#define AT91C_PIOD_PPUDR ((AT91_REG *) 	0xFFFFF860) /* (PIOD) Pull-up Disable Register*/
#define AT91C_PIOD_IFDR ((AT91_REG *) 	0xFFFFF824) /* (PIOD) Input Filter Disable Register*/
#define AT91C_PIOD_IER  ((AT91_REG *) 	0xFFFFF840) /* (PIOD) Interrupt Enable Register*/
#define AT91C_PIOD_OSR  ((AT91_REG *) 	0xFFFFF818) /* (PIOD) Output Status Register*/
#define AT91C_PIOD_ODSR ((AT91_REG *) 	0xFFFFF838) /* (PIOD) Output Data Status Register*/
#define AT91C_PIOD_ISR  ((AT91_REG *) 	0xFFFFF84C) /* (PIOD) Interrupt Status Register*/
#define AT91C_PIOD_IFER ((AT91_REG *) 	0xFFFFF820) /* (PIOD) Input Filter Enable Register*/
/* ========== Register definition for PIOE peripheral ========== */
#define AT91C_PIOE_ODSR ((AT91_REG *) 	0xFFFFFA38) /* (PIOE) Output Data Status Register*/
#define AT91C_PIOE_ABSR ((AT91_REG *) 	0xFFFFFA78) /* (PIOE) AB Select Status Register*/
#define AT91C_PIOE_PSR  ((AT91_REG *) 	0xFFFFFA08) /* (PIOE) PIO Status Register*/
#define AT91C_PIOE_PPUDR ((AT91_REG *) 	0xFFFFFA60) /* (PIOE) Pull-up Disable Register*/
#define AT91C_PIOE_OER  ((AT91_REG *) 	0xFFFFFA10) /* (PIOE) Output Enable Register*/
#define AT91C_PIOE_OWDR ((AT91_REG *) 	0xFFFFFAA4) /* (PIOE) Output Write Disable Register*/
#define AT91C_PIOE_PER  ((AT91_REG *) 	0xFFFFFA00) /* (PIOE) PIO Enable Register*/
#define AT91C_PIOE_IFSR ((AT91_REG *) 	0xFFFFFA28) /* (PIOE) Input Filter Status Register*/
#define AT91C_PIOE_IFER ((AT91_REG *) 	0xFFFFFA20) /* (PIOE) Input Filter Enable Register*/
#define AT91C_PIOE_ODR  ((AT91_REG *) 	0xFFFFFA14) /* (PIOE) Output Disable Registerr*/
#define AT91C_PIOE_PPUSR ((AT91_REG *) 	0xFFFFFA68) /* (PIOE) Pull-up Status Register*/
#define AT91C_PIOE_IFDR ((AT91_REG *) 	0xFFFFFA24) /* (PIOE) Input Filter Disable Register*/
#define AT91C_PIOE_PDSR ((AT91_REG *) 	0xFFFFFA3C) /* (PIOE) Pin Data Status Register*/
#define AT91C_PIOE_PPUER ((AT91_REG *) 	0xFFFFFA64) /* (PIOE) Pull-up Enable Register*/
#define AT91C_PIOE_IDR  ((AT91_REG *) 	0xFFFFFA44) /* (PIOE) Interrupt Disable Register*/
#define AT91C_PIOE_MDDR ((AT91_REG *) 	0xFFFFFA54) /* (PIOE) Multi-driver Disable Register*/
#define AT91C_PIOE_ISR  ((AT91_REG *) 	0xFFFFFA4C) /* (PIOE) Interrupt Status Register*/
#define AT91C_PIOE_OSR  ((AT91_REG *) 	0xFFFFFA18) /* (PIOE) Output Status Register*/
#define AT91C_PIOE_CODR ((AT91_REG *) 	0xFFFFFA34) /* (PIOE) Clear Output Data Register*/
#define AT91C_PIOE_MDSR ((AT91_REG *) 	0xFFFFFA58) /* (PIOE) Multi-driver Status Register*/
#define AT91C_PIOE_PDR  ((AT91_REG *) 	0xFFFFFA04) /* (PIOE) PIO Disable Register*/
#define AT91C_PIOE_IER  ((AT91_REG *) 	0xFFFFFA40) /* (PIOE) Interrupt Enable Register*/
#define AT91C_PIOE_OWSR ((AT91_REG *) 	0xFFFFFAA8) /* (PIOE) Output Write Status Register*/
#define AT91C_PIOE_BSR  ((AT91_REG *) 	0xFFFFFA74) /* (PIOE) Select B Register*/
#define AT91C_PIOE_ASR  ((AT91_REG *) 	0xFFFFFA70) /* (PIOE) Select A Register*/
#define AT91C_PIOE_SODR ((AT91_REG *) 	0xFFFFFA30) /* (PIOE) Set Output Data Register*/
#define AT91C_PIOE_IMR  ((AT91_REG *) 	0xFFFFFA48) /* (PIOE) Interrupt Mask Register*/
#define AT91C_PIOE_OWER ((AT91_REG *) 	0xFFFFFAA0) /* (PIOE) Output Write Enable Register*/
#define AT91C_PIOE_MDER ((AT91_REG *) 	0xFFFFFA50) /* (PIOE) Multi-driver Enable Register*/
/* ========== Register definition for CKGR peripheral ========== */
#define AT91C_CKGR_MOR  ((AT91_REG *) 	0xFFFFFC20) /* (CKGR) Main Oscillator Register*/
#define AT91C_CKGR_PLLBR ((AT91_REG *) 	0xFFFFFC2C) /* (CKGR) PLL B Register*/
#define AT91C_CKGR_MCFR ((AT91_REG *) 	0xFFFFFC24) /* (CKGR) Main Clock  Frequency Register*/
#define AT91C_CKGR_PLLAR ((AT91_REG *) 	0xFFFFFC28) /* (CKGR) PLL A Register*/
/* ========== Register definition for PMC peripheral ========== */
#define AT91C_PMC_PCER  ((AT91_REG *) 	0xFFFFFC10) /* (PMC) Peripheral Clock Enable Register*/
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0xFFFFFC40) /* (PMC) Programmable Clock Register*/
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0xFFFFFC30) /* (PMC) Master Clock Register*/
#define AT91C_PMC_PLLAR ((AT91_REG *) 	0xFFFFFC28) /* (PMC) PLL A Register*/
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0xFFFFFC14) /* (PMC) Peripheral Clock Disable Register*/
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0xFFFFFC08) /* (PMC) System Clock Status Register*/
#define AT91C_PMC_MCFR  ((AT91_REG *) 	0xFFFFFC24) /* (PMC) Main Clock  Frequency Register*/
#define AT91C_PMC_IMR   ((AT91_REG *) 	0xFFFFFC6C) /* (PMC) Interrupt Mask Register*/
#define AT91C_PMC_IER   ((AT91_REG *) 	0xFFFFFC60) /* (PMC) Interrupt Enable Register*/
#define AT91C_PMC_MOR   ((AT91_REG *) 	0xFFFFFC20) /* (PMC) Main Oscillator Register*/
#define AT91C_PMC_IDR   ((AT91_REG *) 	0xFFFFFC64) /* (PMC) Interrupt Disable Register*/
#define AT91C_PMC_PLLBR ((AT91_REG *) 	0xFFFFFC2C) /* (PMC) PLL B Register*/
#define AT91C_PMC_SCDR  ((AT91_REG *) 	0xFFFFFC04) /* (PMC) System Clock Disable Register*/
#define AT91C_PMC_PCSR  ((AT91_REG *) 	0xFFFFFC18) /* (PMC) Peripheral Clock Status Register*/
#define AT91C_PMC_SCER  ((AT91_REG *) 	0xFFFFFC00) /* (PMC) System Clock Enable Register*/
#define AT91C_PMC_SR    ((AT91_REG *) 	0xFFFFFC68) /* (PMC) Status Register*/
/* ========== Register definition for RSTC peripheral ========== */
#define AT91C_RSTC_RCR  ((AT91_REG *) 	0xFFFFFD00) /* (RSTC) Reset Control Register*/
#define AT91C_RSTC_RMR  ((AT91_REG *) 	0xFFFFFD08) /* (RSTC) Reset Mode Register*/
#define AT91C_RSTC_RSR  ((AT91_REG *) 	0xFFFFFD04) /* (RSTC) Reset Status Register*/
/* ========== Register definition for SHDWC peripheral ========== */
#define AT91C_SHDWC_SHSR ((AT91_REG *) 	0xFFFFFD18) /* (SHDWC) Shut Down Status Register*/
#define AT91C_SHDWC_SHMR ((AT91_REG *) 	0xFFFFFD14) /* (SHDWC) Shut Down Mode Register*/
#define AT91C_SHDWC_SHCR ((AT91_REG *) 	0xFFFFFD10) /* (SHDWC) Shut Down Control Register*/
/* ========== Register definition for RTTC0 peripheral ========== */
#define AT91C_RTTC0_RTSR ((AT91_REG *) 	0xFFFFFD2C) /* (RTTC0) Real-time Status Register*/
#define AT91C_RTTC0_RTMR ((AT91_REG *) 	0xFFFFFD20) /* (RTTC0) Real-time Mode Register*/
#define AT91C_RTTC0_RTVR ((AT91_REG *) 	0xFFFFFD28) /* (RTTC0) Real-time Value Register*/
#define AT91C_RTTC0_RTAR ((AT91_REG *) 	0xFFFFFD24) /* (RTTC0) Real-time Alarm Register*/
/* ========== Register definition for RTTC1 peripheral ========== */
#define AT91C_RTTC1_RTAR ((AT91_REG *) 	0xFFFFFD54) /* (RTTC1) Real-time Alarm Register*/
#define AT91C_RTTC1_RTSR ((AT91_REG *) 	0xFFFFFD5C) /* (RTTC1) Real-time Status Register*/
#define AT91C_RTTC1_RTVR ((AT91_REG *) 	0xFFFFFD58) /* (RTTC1) Real-time Value Register*/
#define AT91C_RTTC1_RTMR ((AT91_REG *) 	0xFFFFFD50) /* (RTTC1) Real-time Mode Register*/
/* ========== Register definition for PITC peripheral ========== */
#define AT91C_PITC_PIVR ((AT91_REG *) 	0xFFFFFD38) /* (PITC) Period Interval Value Register*/
#define AT91C_PITC_PISR ((AT91_REG *) 	0xFFFFFD34) /* (PITC) Period Interval Status Register*/
#define AT91C_PITC_PIIR ((AT91_REG *) 	0xFFFFFD3C) /* (PITC) Period Interval Image Register*/
#define AT91C_PITC_PIMR ((AT91_REG *) 	0xFFFFFD30) /* (PITC) Period Interval Mode Register*/
/* ========== Register definition for WDTC peripheral ========== */
#define AT91C_WDTC_WDCR ((AT91_REG *) 	0xFFFFFD40) /* (WDTC) Watchdog Control Register*/
#define AT91C_WDTC_WDSR ((AT91_REG *) 	0xFFFFFD48) /* (WDTC) Watchdog Status Register*/
#define AT91C_WDTC_WDMR ((AT91_REG *) 	0xFFFFFD44) /* (WDTC) Watchdog Mode Register*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFF7C024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFF7C02C) /* (TC0) Interrupt Mask Register*/
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFF7C000) /* (TC0) Channel Control Register*/
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFF7C018) /* (TC0) Register B*/
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFF7C010) /* (TC0) Counter Value*/
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFF7C020) /* (TC0) Status Register*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFF7C004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFF7C014) /* (TC0) Register A*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFF7C01C) /* (TC0) Register C*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFF7C028) /* (TC0) Interrupt Disable Register*/
/* ========== Register definition for TC1 peripheral ========== */
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFF7C064) /* (TC1) Interrupt Enable Register*/
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFF7C060) /* (TC1) Status Register*/
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFF7C05C) /* (TC1) Register C*/
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFF7C050) /* (TC1) Counter Value*/
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFF7C054) /* (TC1) Register A*/
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFF7C044) /* (TC1) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFF7C068) /* (TC1) Interrupt Disable Register*/
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFF7C058) /* (TC1) Register B*/
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFF7C06C) /* (TC1) Interrupt Mask Register*/
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFF7C040) /* (TC1) Channel Control Register*/
/* ========== Register definition for TC2 peripheral ========== */
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFF7C0A0) /* (TC2) Status Register*/
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFF7C0AC) /* (TC2) Interrupt Mask Register*/
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFF7C0A4) /* (TC2) Interrupt Enable Register*/
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFF7C090) /* (TC2) Counter Value*/
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFF7C098) /* (TC2) Register B*/
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFF7C080) /* (TC2) Channel Control Register*/
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFF7C084) /* (TC2) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFF7C094) /* (TC2) Register A*/
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFF7C0A8) /* (TC2) Interrupt Disable Register*/
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFF7C09C) /* (TC2) Register C*/
/* ========== Register definition for TCB0 peripheral ========== */
#define AT91C_TCB0_BCR  ((AT91_REG *) 	0xFFF7C0C0) /* (TCB0) TC Block Control Register*/
#define AT91C_TCB0_BMR  ((AT91_REG *) 	0xFFF7C0C4) /* (TCB0) TC Block Mode Register*/
/* ========== Register definition for TCB1 peripheral ========== */
#define AT91C_TCB1_BMR  ((AT91_REG *) 	0xFFF7C104) /* (TCB1) TC Block Mode Register*/
#define AT91C_TCB1_BCR  ((AT91_REG *) 	0xFFF7C100) /* (TCB1) TC Block Control Register*/
/* ========== Register definition for TCB2 peripheral ========== */
#define AT91C_TCB2_BCR  ((AT91_REG *) 	0xFFF7C140) /* (TCB2) TC Block Control Register*/
#define AT91C_TCB2_BMR  ((AT91_REG *) 	0xFFF7C144) /* (TCB2) TC Block Mode Register*/
/* ========== Register definition for PDC_MCI0 peripheral ========== */
#define AT91C_MCI0_TCR  ((AT91_REG *) 	0xFFF8010C) /* (PDC_MCI0) Transmit Counter Register*/
#define AT91C_MCI0_TNCR ((AT91_REG *) 	0xFFF8011C) /* (PDC_MCI0) Transmit Next Counter Register*/
#define AT91C_MCI0_RNPR ((AT91_REG *) 	0xFFF80110) /* (PDC_MCI0) Receive Next Pointer Register*/
#define AT91C_MCI0_TPR  ((AT91_REG *) 	0xFFF80108) /* (PDC_MCI0) Transmit Pointer Register*/
#define AT91C_MCI0_TNPR ((AT91_REG *) 	0xFFF80118) /* (PDC_MCI0) Transmit Next Pointer Register*/
#define AT91C_MCI0_PTSR ((AT91_REG *) 	0xFFF80124) /* (PDC_MCI0) PDC Transfer Status Register*/
#define AT91C_MCI0_RCR  ((AT91_REG *) 	0xFFF80104) /* (PDC_MCI0) Receive Counter Register*/
#define AT91C_MCI0_PTCR ((AT91_REG *) 	0xFFF80120) /* (PDC_MCI0) PDC Transfer Control Register*/
#define AT91C_MCI0_RPR  ((AT91_REG *) 	0xFFF80100) /* (PDC_MCI0) Receive Pointer Register*/
#define AT91C_MCI0_RNCR ((AT91_REG *) 	0xFFF80114) /* (PDC_MCI0) Receive Next Counter Register*/
/* ========== Register definition for MCI0 peripheral ========== */
#define AT91C_MCI0_CMDR ((AT91_REG *) 	0xFFF80014) /* (MCI0) MCI Command Register*/
#define AT91C_MCI0_IMR  ((AT91_REG *) 	0xFFF8004C) /* (MCI0) MCI Interrupt Mask Register*/
#define AT91C_MCI0_MR   ((AT91_REG *) 	0xFFF80004) /* (MCI0) MCI Mode Register*/
#define AT91C_MCI0_CR   ((AT91_REG *) 	0xFFF80000) /* (MCI0) MCI Control Register*/
#define AT91C_MCI0_IER  ((AT91_REG *) 	0xFFF80044) /* (MCI0) MCI Interrupt Enable Register*/
#define AT91C_MCI0_RDR  ((AT91_REG *) 	0xFFF80030) /* (MCI0) MCI Receive Data Register*/
#define AT91C_MCI0_SR   ((AT91_REG *) 	0xFFF80040) /* (MCI0) MCI Status Register*/
#define AT91C_MCI0_DTOR ((AT91_REG *) 	0xFFF80008) /* (MCI0) MCI Data Timeout Register*/
#define AT91C_MCI0_SDCR ((AT91_REG *) 	0xFFF8000C) /* (MCI0) MCI SD Card Register*/
#define AT91C_MCI0_BLKR ((AT91_REG *) 	0xFFF80018) /* (MCI0) MCI Block Register*/
#define AT91C_MCI0_VR   ((AT91_REG *) 	0xFFF800FC) /* (MCI0) MCI Version Register*/
#define AT91C_MCI0_TDR  ((AT91_REG *) 	0xFFF80034) /* (MCI0) MCI Transmit Data Register*/
#define AT91C_MCI0_ARGR ((AT91_REG *) 	0xFFF80010) /* (MCI0) MCI Argument Register*/
#define AT91C_MCI0_RSPR ((AT91_REG *) 	0xFFF80020) /* (MCI0) MCI Response Register*/
#define AT91C_MCI0_IDR  ((AT91_REG *) 	0xFFF80048) /* (MCI0) MCI Interrupt Disable Register*/
/* ========== Register definition for PDC_MCI1 peripheral ========== */
#define AT91C_MCI1_PTCR ((AT91_REG *) 	0xFFF84120) /* (PDC_MCI1) PDC Transfer Control Register*/
#define AT91C_MCI1_PTSR ((AT91_REG *) 	0xFFF84124) /* (PDC_MCI1) PDC Transfer Status Register*/
#define AT91C_MCI1_TPR  ((AT91_REG *) 	0xFFF84108) /* (PDC_MCI1) Transmit Pointer Register*/
#define AT91C_MCI1_RPR  ((AT91_REG *) 	0xFFF84100) /* (PDC_MCI1) Receive Pointer Register*/
#define AT91C_MCI1_TNCR ((AT91_REG *) 	0xFFF8411C) /* (PDC_MCI1) Transmit Next Counter Register*/
#define AT91C_MCI1_RCR  ((AT91_REG *) 	0xFFF84104) /* (PDC_MCI1) Receive Counter Register*/
#define AT91C_MCI1_TNPR ((AT91_REG *) 	0xFFF84118) /* (PDC_MCI1) Transmit Next Pointer Register*/
#define AT91C_MCI1_TCR  ((AT91_REG *) 	0xFFF8410C) /* (PDC_MCI1) Transmit Counter Register*/
#define AT91C_MCI1_RNPR ((AT91_REG *) 	0xFFF84110) /* (PDC_MCI1) Receive Next Pointer Register*/
#define AT91C_MCI1_RNCR ((AT91_REG *) 	0xFFF84114) /* (PDC_MCI1) Receive Next Counter Register*/
/* ========== Register definition for MCI1 peripheral ========== */
#define AT91C_MCI1_SR   ((AT91_REG *) 	0xFFF84040) /* (MCI1) MCI Status Register*/
#define AT91C_MCI1_RDR  ((AT91_REG *) 	0xFFF84030) /* (MCI1) MCI Receive Data Register*/
#define AT91C_MCI1_RSPR ((AT91_REG *) 	0xFFF84020) /* (MCI1) MCI Response Register*/
#define AT91C_MCI1_CMDR ((AT91_REG *) 	0xFFF84014) /* (MCI1) MCI Command Register*/
#define AT91C_MCI1_IMR  ((AT91_REG *) 	0xFFF8404C) /* (MCI1) MCI Interrupt Mask Register*/
#define AT91C_MCI1_DTOR ((AT91_REG *) 	0xFFF84008) /* (MCI1) MCI Data Timeout Register*/
#define AT91C_MCI1_SDCR ((AT91_REG *) 	0xFFF8400C) /* (MCI1) MCI SD Card Register*/
#define AT91C_MCI1_IDR  ((AT91_REG *) 	0xFFF84048) /* (MCI1) MCI Interrupt Disable Register*/
#define AT91C_MCI1_ARGR ((AT91_REG *) 	0xFFF84010) /* (MCI1) MCI Argument Register*/
#define AT91C_MCI1_TDR  ((AT91_REG *) 	0xFFF84034) /* (MCI1) MCI Transmit Data Register*/
#define AT91C_MCI1_BLKR ((AT91_REG *) 	0xFFF84018) /* (MCI1) MCI Block Register*/
#define AT91C_MCI1_VR   ((AT91_REG *) 	0xFFF840FC) /* (MCI1) MCI Version Register*/
#define AT91C_MCI1_CR   ((AT91_REG *) 	0xFFF84000) /* (MCI1) MCI Control Register*/
#define AT91C_MCI1_MR   ((AT91_REG *) 	0xFFF84004) /* (MCI1) MCI Mode Register*/
#define AT91C_MCI1_IER  ((AT91_REG *) 	0xFFF84044) /* (MCI1) MCI Interrupt Enable Register*/
/* ========== Register definition for TWI peripheral ========== */
#define AT91C_TWI_IDR   ((AT91_REG *) 	0xFFF88028) /* (TWI) Interrupt Disable Register*/
#define AT91C_TWI_RHR   ((AT91_REG *) 	0xFFF88030) /* (TWI) Receive Holding Register*/
#define AT91C_TWI_IMR   ((AT91_REG *) 	0xFFF8802C) /* (TWI) Interrupt Mask Register*/
#define AT91C_TWI_THR   ((AT91_REG *) 	0xFFF88034) /* (TWI) Transmit Holding Register*/
#define AT91C_TWI_IER   ((AT91_REG *) 	0xFFF88024) /* (TWI) Interrupt Enable Register*/
#define AT91C_TWI_IADR  ((AT91_REG *) 	0xFFF8800C) /* (TWI) Internal Address Register*/
#define AT91C_TWI_SMR   ((AT91_REG *) 	0xFFF88008) /* (TWI) Slave Mode Register*/
#define AT91C_TWI_MMR   ((AT91_REG *) 	0xFFF88004) /* (TWI) Master Mode Register*/
#define AT91C_TWI_CR    ((AT91_REG *) 	0xFFF88000) /* (TWI) Control Register*/
#define AT91C_TWI_SR    ((AT91_REG *) 	0xFFF88020) /* (TWI) Status Register*/
#define AT91C_TWI_CWGR  ((AT91_REG *) 	0xFFF88010) /* (TWI) Clock Waveform Generator Register*/
/* ========== Register definition for PDC_US0 peripheral ========== */
#define AT91C_US0_TNPR  ((AT91_REG *) 	0xFFF8C118) /* (PDC_US0) Transmit Next Pointer Register*/
#define AT91C_US0_PTSR  ((AT91_REG *) 	0xFFF8C124) /* (PDC_US0) PDC Transfer Status Register*/
#define AT91C_US0_PTCR  ((AT91_REG *) 	0xFFF8C120) /* (PDC_US0) PDC Transfer Control Register*/
#define AT91C_US0_RNCR  ((AT91_REG *) 	0xFFF8C114) /* (PDC_US0) Receive Next Counter Register*/
#define AT91C_US0_RCR   ((AT91_REG *) 	0xFFF8C104) /* (PDC_US0) Receive Counter Register*/
#define AT91C_US0_TNCR  ((AT91_REG *) 	0xFFF8C11C) /* (PDC_US0) Transmit Next Counter Register*/
#define AT91C_US0_TCR   ((AT91_REG *) 	0xFFF8C10C) /* (PDC_US0) Transmit Counter Register*/
#define AT91C_US0_RNPR  ((AT91_REG *) 	0xFFF8C110) /* (PDC_US0) Receive Next Pointer Register*/
#define AT91C_US0_RPR   ((AT91_REG *) 	0xFFF8C100) /* (PDC_US0) Receive Pointer Register*/
#define AT91C_US0_TPR   ((AT91_REG *) 	0xFFF8C108) /* (PDC_US0) Transmit Pointer Register*/
/* ========== Register definition for US0 peripheral ========== */
#define AT91C_US0_RTOR  ((AT91_REG *) 	0xFFF8C024) /* (US0) Receiver Time-out Register*/
#define AT91C_US0_NER   ((AT91_REG *) 	0xFFF8C044) /* (US0) Nb Errors Register*/
#define AT91C_US0_THR   ((AT91_REG *) 	0xFFF8C01C) /* (US0) Transmitter Holding Register*/
#define AT91C_US0_MR    ((AT91_REG *) 	0xFFF8C004) /* (US0) Mode Register*/
#define AT91C_US0_RHR   ((AT91_REG *) 	0xFFF8C018) /* (US0) Receiver Holding Register*/
#define AT91C_US0_CSR   ((AT91_REG *) 	0xFFF8C014) /* (US0) Channel Status Register*/
#define AT91C_US0_IMR   ((AT91_REG *) 	0xFFF8C010) /* (US0) Interrupt Mask Register*/
#define AT91C_US0_IDR   ((AT91_REG *) 	0xFFF8C00C) /* (US0) Interrupt Disable Register*/
#define AT91C_US0_FIDI  ((AT91_REG *) 	0xFFF8C040) /* (US0) FI_DI_Ratio Register*/
#define AT91C_US0_CR    ((AT91_REG *) 	0xFFF8C000) /* (US0) Control Register*/
#define AT91C_US0_IER   ((AT91_REG *) 	0xFFF8C008) /* (US0) Interrupt Enable Register*/
#define AT91C_US0_TTGR  ((AT91_REG *) 	0xFFF8C028) /* (US0) Transmitter Time-guard Register*/
#define AT91C_US0_BRGR  ((AT91_REG *) 	0xFFF8C020) /* (US0) Baud Rate Generator Register*/
#define AT91C_US0_IF    ((AT91_REG *) 	0xFFF8C04C) /* (US0) IRDA_FILTER Register*/
/* ========== Register definition for PDC_US1 peripheral ========== */
#define AT91C_US1_PTCR  ((AT91_REG *) 	0xFFF90120) /* (PDC_US1) PDC Transfer Control Register*/
#define AT91C_US1_TNCR  ((AT91_REG *) 	0xFFF9011C) /* (PDC_US1) Transmit Next Counter Register*/
#define AT91C_US1_RCR   ((AT91_REG *) 	0xFFF90104) /* (PDC_US1) Receive Counter Register*/
#define AT91C_US1_RPR   ((AT91_REG *) 	0xFFF90100) /* (PDC_US1) Receive Pointer Register*/
#define AT91C_US1_TPR   ((AT91_REG *) 	0xFFF90108) /* (PDC_US1) Transmit Pointer Register*/
#define AT91C_US1_TCR   ((AT91_REG *) 	0xFFF9010C) /* (PDC_US1) Transmit Counter Register*/
#define AT91C_US1_RNPR  ((AT91_REG *) 	0xFFF90110) /* (PDC_US1) Receive Next Pointer Register*/
#define AT91C_US1_TNPR  ((AT91_REG *) 	0xFFF90118) /* (PDC_US1) Transmit Next Pointer Register*/
#define AT91C_US1_RNCR  ((AT91_REG *) 	0xFFF90114) /* (PDC_US1) Receive Next Counter Register*/
#define AT91C_US1_PTSR  ((AT91_REG *) 	0xFFF90124) /* (PDC_US1) PDC Transfer Status Register*/
/* ========== Register definition for US1 peripheral ========== */
#define AT91C_US1_NER   ((AT91_REG *) 	0xFFF90044) /* (US1) Nb Errors Register*/
#define AT91C_US1_RHR   ((AT91_REG *) 	0xFFF90018) /* (US1) Receiver Holding Register*/
#define AT91C_US1_RTOR  ((AT91_REG *) 	0xFFF90024) /* (US1) Receiver Time-out Register*/
#define AT91C_US1_IER   ((AT91_REG *) 	0xFFF90008) /* (US1) Interrupt Enable Register*/
#define AT91C_US1_IF    ((AT91_REG *) 	0xFFF9004C) /* (US1) IRDA_FILTER Register*/
#define AT91C_US1_CR    ((AT91_REG *) 	0xFFF90000) /* (US1) Control Register*/
#define AT91C_US1_IMR   ((AT91_REG *) 	0xFFF90010) /* (US1) Interrupt Mask Register*/
#define AT91C_US1_TTGR  ((AT91_REG *) 	0xFFF90028) /* (US1) Transmitter Time-guard Register*/
#define AT91C_US1_MR    ((AT91_REG *) 	0xFFF90004) /* (US1) Mode Register*/
#define AT91C_US1_IDR   ((AT91_REG *) 	0xFFF9000C) /* (US1) Interrupt Disable Register*/
#define AT91C_US1_FIDI  ((AT91_REG *) 	0xFFF90040) /* (US1) FI_DI_Ratio Register*/
#define AT91C_US1_CSR   ((AT91_REG *) 	0xFFF90014) /* (US1) Channel Status Register*/
