una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
#define AT91C_US1_THR   ((AT91_REG *) 	0xFFF9001C) /* (US1) Transmitter Holding Register*/
#define AT91C_US1_BRGR  ((AT91_REG *) 	0xFFF90020) /* (US1) Baud Rate Generator Register*/
/* ========== Register definition for PDC_US2 peripheral ========== */
#define AT91C_US2_RNCR  ((AT91_REG *) 	0xFFF94114) /* (PDC_US2) Receive Next Counter Register*/
#define AT91C_US2_PTCR  ((AT91_REG *) 	0xFFF94120) /* (PDC_US2) PDC Transfer Control Register*/
#define AT91C_US2_TNPR  ((AT91_REG *) 	0xFFF94118) /* (PDC_US2) Transmit Next Pointer Register*/
#define AT91C_US2_TNCR  ((AT91_REG *) 	0xFFF9411C) /* (PDC_US2) Transmit Next Counter Register*/
#define AT91C_US2_TPR   ((AT91_REG *) 	0xFFF94108) /* (PDC_US2) Transmit Pointer Register*/
#define AT91C_US2_RCR   ((AT91_REG *) 	0xFFF94104) /* (PDC_US2) Receive Counter Register*/
#define AT91C_US2_PTSR  ((AT91_REG *) 	0xFFF94124) /* (PDC_US2) PDC Transfer Status Register*/
#define AT91C_US2_TCR   ((AT91_REG *) 	0xFFF9410C) /* (PDC_US2) Transmit Counter Register*/
#define AT91C_US2_RPR   ((AT91_REG *) 	0xFFF94100) /* (PDC_US2) Receive Pointer Register*/
#define AT91C_US2_RNPR  ((AT91_REG *) 	0xFFF94110) /* (PDC_US2) Receive Next Pointer Register*/
/* ========== Register definition for US2 peripheral ========== */
#define AT91C_US2_TTGR  ((AT91_REG *) 	0xFFF94028) /* (US2) Transmitter Time-guard Register*/
#define AT91C_US2_RHR   ((AT91_REG *) 	0xFFF94018) /* (US2) Receiver Holding Register*/
#define AT91C_US2_IMR   ((AT91_REG *) 	0xFFF94010) /* (US2) Interrupt Mask Register*/
#define AT91C_US2_IER   ((AT91_REG *) 	0xFFF94008) /* (US2) Interrupt Enable Register*/
#define AT91C_US2_NER   ((AT91_REG *) 	0xFFF94044) /* (US2) Nb Errors Register*/
#define AT91C_US2_CR    ((AT91_REG *) 	0xFFF94000) /* (US2) Control Register*/
#define AT91C_US2_FIDI  ((AT91_REG *) 	0xFFF94040) /* (US2) FI_DI_Ratio Register*/
#define AT91C_US2_MR    ((AT91_REG *) 	0xFFF94004) /* (US2) Mode Register*/
#define AT91C_US2_IDR   ((AT91_REG *) 	0xFFF9400C) /* (US2) Interrupt Disable Register*/
#define AT91C_US2_THR   ((AT91_REG *) 	0xFFF9401C) /* (US2) Transmitter Holding Register*/
#define AT91C_US2_IF    ((AT91_REG *) 	0xFFF9404C) /* (US2) IRDA_FILTER Register*/
#define AT91C_US2_BRGR  ((AT91_REG *) 	0xFFF94020) /* (US2) Baud Rate Generator Register*/
#define AT91C_US2_CSR   ((AT91_REG *) 	0xFFF94014) /* (US2) Channel Status Register*/
#define AT91C_US2_RTOR  ((AT91_REG *) 	0xFFF94024) /* (US2) Receiver Time-out Register*/
/* ========== Register definition for PDC_SSC0 peripheral ========== */
#define AT91C_SSC0_PTSR ((AT91_REG *) 	0xFFF98124) /* (PDC_SSC0) PDC Transfer Status Register*/
#define AT91C_SSC0_TCR  ((AT91_REG *) 	0xFFF9810C) /* (PDC_SSC0) Transmit Counter Register*/
#define AT91C_SSC0_RNPR ((AT91_REG *) 	0xFFF98110) /* (PDC_SSC0) Receive Next Pointer Register*/
#define AT91C_SSC0_RNCR ((AT91_REG *) 	0xFFF98114) /* (PDC_SSC0) Receive Next Counter Register*/
#define AT91C_SSC0_TNPR ((AT91_REG *) 	0xFFF98118) /* (PDC_SSC0) Transmit Next Pointer Register*/
#define AT91C_SSC0_RPR  ((AT91_REG *) 	0xFFF98100) /* (PDC_SSC0) Receive Pointer Register*/
#define AT91C_SSC0_TPR  ((AT91_REG *) 	0xFFF98108) /* (PDC_SSC0) Transmit Pointer Register*/
#define AT91C_SSC0_RCR  ((AT91_REG *) 	0xFFF98104) /* (PDC_SSC0) Receive Counter Register*/
#define AT91C_SSC0_TNCR ((AT91_REG *) 	0xFFF9811C) /* (PDC_SSC0) Transmit Next Counter Register*/
#define AT91C_SSC0_PTCR ((AT91_REG *) 	0xFFF98120) /* (PDC_SSC0) PDC Transfer Control Register*/
/* ========== Register definition for SSC0 peripheral ========== */
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0xFFF98014) /* (SSC0) Receive Frame Mode Register*/
#define AT91C_SSC0_RHR  ((AT91_REG *) 	0xFFF98020) /* (SSC0) Receive Holding Register*/
#define AT91C_SSC0_THR  ((AT91_REG *) 	0xFFF98024) /* (SSC0) Transmit Holding Register*/
#define AT91C_SSC0_CMR  ((AT91_REG *) 	0xFFF98004) /* (SSC0) Clock Mode Register*/
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0xFFF9804C) /* (SSC0) Interrupt Mask Register*/
#define AT91C_SSC0_IDR  ((AT91_REG *) 	0xFFF98048) /* (SSC0) Interrupt Disable Register*/
#define AT91C_SSC0_IER  ((AT91_REG *) 	0xFFF98044) /* (SSC0) Interrupt Enable Register*/
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0xFFF98034) /* (SSC0) Transmit Sync Holding Register*/
#define AT91C_SSC0_SR   ((AT91_REG *) 	0xFFF98040) /* (SSC0) Status Register*/
#define AT91C_SSC0_CR   ((AT91_REG *) 	0xFFF98000) /* (SSC0) Control Register*/
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0xFFF98010) /* (SSC0) Receive Clock ModeRegister*/
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0xFFF9801C) /* (SSC0) Transmit Frame Mode Register*/
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0xFFF98030) /* (SSC0) Receive Sync Holding Register*/
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0xFFF98018) /* (SSC0) Transmit Clock Mode Register*/
/* ========== Register definition for PDC_SSC1 peripheral ========== */
#define AT91C_SSC1_TNPR ((AT91_REG *) 	0xFFF9C118) /* (PDC_SSC1) Transmit Next Pointer Register*/
#define AT91C_SSC1_PTSR ((AT91_REG *) 	0xFFF9C124) /* (PDC_SSC1) PDC Transfer Status Register*/
#define AT91C_SSC1_TNCR ((AT91_REG *) 	0xFFF9C11C) /* (PDC_SSC1) Transmit Next Counter Register*/
#define AT91C_SSC1_RNCR ((AT91_REG *) 	0xFFF9C114) /* (PDC_SSC1) Receive Next Counter Register*/
#define AT91C_SSC1_TPR  ((AT91_REG *) 	0xFFF9C108) /* (PDC_SSC1) Transmit Pointer Register*/
#define AT91C_SSC1_RCR  ((AT91_REG *) 	0xFFF9C104) /* (PDC_SSC1) Receive Counter Register*/
#define AT91C_SSC1_PTCR ((AT91_REG *) 	0xFFF9C120) /* (PDC_SSC1) PDC Transfer Control Register*/
#define AT91C_SSC1_RNPR ((AT91_REG *) 	0xFFF9C110) /* (PDC_SSC1) Receive Next Pointer Register*/
#define AT91C_SSC1_TCR  ((AT91_REG *) 	0xFFF9C10C) /* (PDC_SSC1) Transmit Counter Register*/
#define AT91C_SSC1_RPR  ((AT91_REG *) 	0xFFF9C100) /* (PDC_SSC1) Receive Pointer Register*/
/* ========== Register definition for SSC1 peripheral ========== */
#define AT91C_SSC1_CMR  ((AT91_REG *) 	0xFFF9C004) /* (SSC1) Clock Mode Register*/
#define AT91C_SSC1_SR   ((AT91_REG *) 	0xFFF9C040) /* (SSC1) Status Register*/
#define AT91C_SSC1_TSHR ((AT91_REG *) 	0xFFF9C034) /* (SSC1) Transmit Sync Holding Register*/
#define AT91C_SSC1_TCMR ((AT91_REG *) 	0xFFF9C018) /* (SSC1) Transmit Clock Mode Register*/
#define AT91C_SSC1_IMR  ((AT91_REG *) 	0xFFF9C04C) /* (SSC1) Interrupt Mask Register*/
#define AT91C_SSC1_IDR  ((AT91_REG *) 	0xFFF9C048) /* (SSC1) Interrupt Disable Register*/
#define AT91C_SSC1_RCMR ((AT91_REG *) 	0xFFF9C010) /* (SSC1) Receive Clock ModeRegister*/
#define AT91C_SSC1_IER  ((AT91_REG *) 	0xFFF9C044) /* (SSC1) Interrupt Enable Register*/
#define AT91C_SSC1_RSHR ((AT91_REG *) 	0xFFF9C030) /* (SSC1) Receive Sync Holding Register*/
#define AT91C_SSC1_CR   ((AT91_REG *) 	0xFFF9C000) /* (SSC1) Control Register*/
#define AT91C_SSC1_RHR  ((AT91_REG *) 	0xFFF9C020) /* (SSC1) Receive Holding Register*/
#define AT91C_SSC1_THR  ((AT91_REG *) 	0xFFF9C024) /* (SSC1) Transmit Holding Register*/
#define AT91C_SSC1_RFMR ((AT91_REG *) 	0xFFF9C014) /* (SSC1) Receive Frame Mode Register*/
#define AT91C_SSC1_TFMR ((AT91_REG *) 	0xFFF9C01C) /* (SSC1) Transmit Frame Mode Register*/
/* ========== Register definition for PDC_AC97C peripheral ========== */
#define AT91C_AC97C_RNPR ((AT91_REG *) 	0xFFFA0110) /* (PDC_AC97C) Receive Next Pointer Register*/
#define AT91C_AC97C_TCR ((AT91_REG *) 	0xFFFA010C) /* (PDC_AC97C) Transmit Counter Register*/
#define AT91C_AC97C_TNCR ((AT91_REG *) 	0xFFFA011C) /* (PDC_AC97C) Transmit Next Counter Register*/
#define AT91C_AC97C_RCR ((AT91_REG *) 	0xFFFA0104) /* (PDC_AC97C) Receive Counter Register*/
#define AT91C_AC97C_RNCR ((AT91_REG *) 	0xFFFA0114) /* (PDC_AC97C) Receive Next Counter Register*/
#define AT91C_AC97C_PTCR ((AT91_REG *) 	0xFFFA0120) /* (PDC_AC97C) PDC Transfer Control Register*/
#define AT91C_AC97C_TPR ((AT91_REG *) 	0xFFFA0108) /* (PDC_AC97C) Transmit Pointer Register*/
#define AT91C_AC97C_RPR ((AT91_REG *) 	0xFFFA0100) /* (PDC_AC97C) Receive Pointer Register*/
#define AT91C_AC97C_PTSR ((AT91_REG *) 	0xFFFA0124) /* (PDC_AC97C) PDC Transfer Status Register*/
#define AT91C_AC97C_TNPR ((AT91_REG *) 	0xFFFA0118) /* (PDC_AC97C) Transmit Next Pointer Register*/
/* ========== Register definition for AC97C peripheral ========== */
#define AT91C_AC97C_CORHR ((AT91_REG *) 	0xFFFA0040) /* (AC97C) COdec Transmit Holding Register*/
#define AT91C_AC97C_MR  ((AT91_REG *) 	0xFFFA0008) /* (AC97C) Mode Register*/
#define AT91C_AC97C_CATHR ((AT91_REG *) 	0xFFFA0024) /* (AC97C) Channel A Transmit Holding Register*/
#define AT91C_AC97C_IER ((AT91_REG *) 	0xFFFA0054) /* (AC97C) Interrupt Enable Register*/
#define AT91C_AC97C_CASR ((AT91_REG *) 	0xFFFA0028) /* (AC97C) Channel A Status Register*/
#define AT91C_AC97C_CBTHR ((AT91_REG *) 	0xFFFA0034) /* (AC97C) Channel B Transmit Holding Register (optional)*/
#define AT91C_AC97C_ICA ((AT91_REG *) 	0xFFFA0010) /* (AC97C) Input Channel AssignementRegister*/
#define AT91C_AC97C_IMR ((AT91_REG *) 	0xFFFA005C) /* (AC97C) Interrupt Mask Register*/
#define AT91C_AC97C_IDR ((AT91_REG *) 	0xFFFA0058) /* (AC97C) Interrupt Disable Register*/
#define AT91C_AC97C_CARHR ((AT91_REG *) 	0xFFFA0020) /* (AC97C) Channel A Receive Holding Register*/
#define AT91C_AC97C_VERSION ((AT91_REG *) 	0xFFFA00FC) /* (AC97C) Version Register*/
#define AT91C_AC97C_CBRHR ((AT91_REG *) 	0xFFFA0030) /* (AC97C) Channel B Receive Holding Register (optional)*/
#define AT91C_AC97C_COTHR ((AT91_REG *) 	0xFFFA0044) /* (AC97C) COdec Transmit Holding Register*/
#define AT91C_AC97C_OCA ((AT91_REG *) 	0xFFFA0014) /* (AC97C) Output Channel Assignement Register*/
#define AT91C_AC97C_CBMR ((AT91_REG *) 	0xFFFA003C) /* (AC97C) Channel B Mode Register*/
#define AT91C_AC97C_COMR ((AT91_REG *) 	0xFFFA004C) /* (AC97C) CODEC Mask Status Register*/
#define AT91C_AC97C_CBSR ((AT91_REG *) 	0xFFFA0038) /* (AC97C) Channel B Status Register*/
#define AT91C_AC97C_COSR ((AT91_REG *) 	0xFFFA0048) /* (AC97C) CODEC Status Register*/
#define AT91C_AC97C_CAMR ((AT91_REG *) 	0xFFFA002C) /* (AC97C) Channel A Mode Register*/
#define AT91C_AC97C_SR  ((AT91_REG *) 	0xFFFA0050) /* (AC97C) Status Register*/
/* ========== Register definition for PDC_SPI0 peripheral ========== */
#define AT91C_SPI0_TPR  ((AT91_REG *) 	0xFFFA4108) /* (PDC_SPI0) Transmit Pointer Register*/
#define AT91C_SPI0_PTCR ((AT91_REG *) 	0xFFFA4120) /* (PDC_SPI0) PDC Transfer Control Register*/
#define AT91C_SPI0_RNPR ((AT91_REG *) 	0xFFFA4110) /* (PDC_SPI0) Receive Next Pointer Register*/
#define AT91C_SPI0_TNCR ((AT91_REG *) 	0xFFFA411C) /* (PDC_SPI0) Transmit Next Counter Register*/
#define AT91C_SPI0_TCR  ((AT91_REG *) 	0xFFFA410C) /* (PDC_SPI0) Transmit Counter Register*/
#define AT91C_SPI0_RCR  ((AT91_REG *) 	0xFFFA4104) /* (PDC_SPI0) Receive Counter Register*/
#define AT91C_SPI0_RNCR ((AT91_REG *) 	0xFFFA4114) /* (PDC_SPI0) Receive Next Counter Register*/
#define AT91C_SPI0_TNPR ((AT91_REG *) 	0xFFFA4118) /* (PDC_SPI0) Transmit Next Pointer Register*/
#define AT91C_SPI0_RPR  ((AT91_REG *) 	0xFFFA4100) /* (PDC_SPI0) Receive Pointer Register*/
#define AT91C_SPI0_PTSR ((AT91_REG *) 	0xFFFA4124) /* (PDC_SPI0) PDC Transfer Status Register*/
/* ========== Register definition for SPI0 peripheral ========== */
#define AT91C_SPI0_MR   ((AT91_REG *) 	0xFFFA4004) /* (SPI0) Mode Register*/
#define AT91C_SPI0_RDR  ((AT91_REG *) 	0xFFFA4008) /* (SPI0) Receive Data Register*/
#define AT91C_SPI0_CR   ((AT91_REG *) 	0xFFFA4000) /* (SPI0) Control Register*/
#define AT91C_SPI0_IER  ((AT91_REG *) 	0xFFFA4014) /* (SPI0) Interrupt Enable Register*/
#define AT91C_SPI0_TDR  ((AT91_REG *) 	0xFFFA400C) /* (SPI0) Transmit Data Register*/
#define AT91C_SPI0_IDR  ((AT91_REG *) 	0xFFFA4018) /* (SPI0) Interrupt Disable Register*/
#define AT91C_SPI0_CSR  ((AT91_REG *) 	0xFFFA4030) /* (SPI0) Chip Select Register*/
#define AT91C_SPI0_SR   ((AT91_REG *) 	0xFFFA4010) /* (SPI0) Status Register*/
#define AT91C_SPI0_IMR  ((AT91_REG *) 	0xFFFA401C) /* (SPI0) Interrupt Mask Register*/
/* ========== Register definition for PDC_SPI1 peripheral ========== */
#define AT91C_SPI1_RNCR ((AT91_REG *) 	0xFFFA8114) /* (PDC_SPI1) Receive Next Counter Register*/
#define AT91C_SPI1_TCR  ((AT91_REG *) 	0xFFFA810C) /* (PDC_SPI1) Transmit Counter Register*/
#define AT91C_SPI1_RCR  ((AT91_REG *) 	0xFFFA8104) /* (PDC_SPI1) Receive Counter Register*/
#define AT91C_SPI1_TNPR ((AT91_REG *) 	0xFFFA8118) /* (PDC_SPI1) Transmit Next Pointer Register*/
#define AT91C_SPI1_RNPR ((AT91_REG *) 	0xFFFA8110) /* (PDC_SPI1) Receive Next Pointer Register*/
#define AT91C_SPI1_RPR  ((AT91_REG *) 	0xFFFA8100) /* (PDC_SPI1) Receive Pointer Register*/
#define AT91C_SPI1_TNCR ((AT91_REG *) 	0xFFFA811C) /* (PDC_SPI1) Transmit Next Counter Register*/
#define AT91C_SPI1_TPR  ((AT91_REG *) 	0xFFFA8108) /* (PDC_SPI1) Transmit Pointer Register*/
#define AT91C_SPI1_PTSR ((AT91_REG *) 	0xFFFA8124) /* (PDC_SPI1) PDC Transfer Status Register*/
#define AT91C_SPI1_PTCR ((AT91_REG *) 	0xFFFA8120) /* (PDC_SPI1) PDC Transfer Control Register*/
/* ========== Register definition for SPI1 peripheral ========== */
#define AT91C_SPI1_CSR  ((AT91_REG *) 	0xFFFA8030) /* (SPI1) Chip Select Register*/
#define AT91C_SPI1_IER  ((AT91_REG *) 	0xFFFA8014) /* (SPI1) Interrupt Enable Register*/
#define AT91C_SPI1_RDR  ((AT91_REG *) 	0xFFFA8008) /* (SPI1) Receive Data Register*/
#define AT91C_SPI1_IDR  ((AT91_REG *) 	0xFFFA8018) /* (SPI1) Interrupt Disable Register*/
#define AT91C_SPI1_MR   ((AT91_REG *) 	0xFFFA8004) /* (SPI1) Mode Register*/
#define AT91C_SPI1_CR   ((AT91_REG *) 	0xFFFA8000) /* (SPI1) Control Register*/
#define AT91C_SPI1_SR   ((AT91_REG *) 	0xFFFA8010) /* (SPI1) Status Register*/
#define AT91C_SPI1_TDR  ((AT91_REG *) 	0xFFFA800C) /* (SPI1) Transmit Data Register*/
#define AT91C_SPI1_IMR  ((AT91_REG *) 	0xFFFA801C) /* (SPI1) Interrupt Mask Register*/
/* ========== Register definition for CAN_MB0 peripheral ========== */
#define AT91C_CAN_MB0_MID ((AT91_REG *) 	0xFFFAC208) /* (CAN_MB0) MailBox ID Register*/
#define AT91C_CAN_MB0_MFID ((AT91_REG *) 	0xFFFAC20C) /* (CAN_MB0) MailBox Family ID Register*/
#define AT91C_CAN_MB0_MAM ((AT91_REG *) 	0xFFFAC204) /* (CAN_MB0) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB0_MCR ((AT91_REG *) 	0xFFFAC21C) /* (CAN_MB0) MailBox Control Register*/
#define AT91C_CAN_MB0_MMR ((AT91_REG *) 	0xFFFAC200) /* (CAN_MB0) MailBox Mode Register*/
#define AT91C_CAN_MB0_MDL ((AT91_REG *) 	0xFFFAC214) /* (CAN_MB0) MailBox Data Low Register*/
#define AT91C_CAN_MB0_MDH ((AT91_REG *) 	0xFFFAC218) /* (CAN_MB0) MailBox Data High Register*/
#define AT91C_CAN_MB0_MSR ((AT91_REG *) 	0xFFFAC210) /* (CAN_MB0) MailBox Status Register*/
/* ========== Register definition for CAN_MB1 peripheral ========== */
#define AT91C_CAN_MB1_MDL ((AT91_REG *) 	0xFFFAC234) /* (CAN_MB1) MailBox Data Low Register*/
#define AT91C_CAN_MB1_MAM ((AT91_REG *) 	0xFFFAC224) /* (CAN_MB1) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB1_MID ((AT91_REG *) 	0xFFFAC228) /* (CAN_MB1) MailBox ID Register*/
#define AT91C_CAN_MB1_MMR ((AT91_REG *) 	0xFFFAC220) /* (CAN_MB1) MailBox Mode Register*/
#define AT91C_CAN_MB1_MCR ((AT91_REG *) 	0xFFFAC23C) /* (CAN_MB1) MailBox Control Register*/
#define AT91C_CAN_MB1_MFID ((AT91_REG *) 	0xFFFAC22C) /* (CAN_MB1) MailBox Family ID Register*/
#define AT91C_CAN_MB1_MSR ((AT91_REG *) 	0xFFFAC230) /* (CAN_MB1) MailBox Status Register*/
#define AT91C_CAN_MB1_MDH ((AT91_REG *) 	0xFFFAC238) /* (CAN_MB1) MailBox Data High Register*/
/* ========== Register definition for CAN_MB2 peripheral ========== */
#define AT91C_CAN_MB2_MID ((AT91_REG *) 	0xFFFAC248) /* (CAN_MB2) MailBox ID Register*/
#define AT91C_CAN_MB2_MSR ((AT91_REG *) 	0xFFFAC250) /* (CAN_MB2) MailBox Status Register*/
#define AT91C_CAN_MB2_MDL ((AT91_REG *) 	0xFFFAC254) /* (CAN_MB2) MailBox Data Low Register*/
#define AT91C_CAN_MB2_MCR ((AT91_REG *) 	0xFFFAC25C) /* (CAN_MB2) MailBox Control Register*/
#define AT91C_CAN_MB2_MDH ((AT91_REG *) 	0xFFFAC258) /* (CAN_MB2) MailBox Data High Register*/
#define AT91C_CAN_MB2_MAM ((AT91_REG *) 	0xFFFAC244) /* (CAN_MB2) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB2_MMR ((AT91_REG *) 	0xFFFAC240) /* (CAN_MB2) MailBox Mode Register*/
#define AT91C_CAN_MB2_MFID ((AT91_REG *) 	0xFFFAC24C) /* (CAN_MB2) MailBox Family ID Register*/
/* ========== Register definition for CAN_MB3 peripheral ========== */
#define AT91C_CAN_MB3_MDL ((AT91_REG *) 	0xFFFAC274) /* (CAN_MB3) MailBox Data Low Register*/
#define AT91C_CAN_MB3_MFID ((AT91_REG *) 	0xFFFAC26C) /* (CAN_MB3) MailBox Family ID Register*/
#define AT91C_CAN_MB3_MID ((AT91_REG *) 	0xFFFAC268) /* (CAN_MB3) MailBox ID Register*/
#define AT91C_CAN_MB3_MDH ((AT91_REG *) 	0xFFFAC278) /* (CAN_MB3) MailBox Data High Register*/
#define AT91C_CAN_MB3_MAM ((AT91_REG *) 	0xFFFAC264) /* (CAN_MB3) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB3_MMR ((AT91_REG *) 	0xFFFAC260) /* (CAN_MB3) MailBox Mode Register*/
#define AT91C_CAN_MB3_MCR ((AT91_REG *) 	0xFFFAC27C) /* (CAN_MB3) MailBox Control Register*/
#define AT91C_CAN_MB3_MSR ((AT91_REG *) 	0xFFFAC270) /* (CAN_MB3) MailBox Status Register*/
/* ========== Register definition for CAN_MB4 peripheral ========== */
#define AT91C_CAN_MB4_MCR ((AT91_REG *) 	0xFFFAC29C) /* (CAN_MB4) MailBox Control Register*/
#define AT91C_CAN_MB4_MDH ((AT91_REG *) 	0xFFFAC298) /* (CAN_MB4) MailBox Data High Register*/
#define AT91C_CAN_MB4_MID ((AT91_REG *) 	0xFFFAC288) /* (CAN_MB4) MailBox ID Register*/
#define AT91C_CAN_MB4_MMR ((AT91_REG *) 	0xFFFAC280) /* (CAN_MB4) MailBox Mode Register*/
#define AT91C_CAN_MB4_MSR ((AT91_REG *) 	0xFFFAC290) /* (CAN_MB4) MailBox Status Register*/
#define AT91C_CAN_MB4_MFID ((AT91_REG *) 	0xFFFAC28C) /* (CAN_MB4) MailBox Family ID Register*/
#define AT91C_CAN_MB4_MAM ((AT91_REG *) 	0xFFFAC284) /* (CAN_MB4) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB4_MDL ((AT91_REG *) 	0xFFFAC294) /* (CAN_MB4) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB5 peripheral ========== */
#define AT91C_CAN_MB5_MDH ((AT91_REG *) 	0xFFFAC2B8) /* (CAN_MB5) MailBox Data High Register*/
#define AT91C_CAN_MB5_MID ((AT91_REG *) 	0xFFFAC2A8) /* (CAN_MB5) MailBox ID Register*/
#define AT91C_CAN_MB5_MCR ((AT91_REG *) 	0xFFFAC2BC) /* (CAN_MB5) MailBox Control Register*/
#define AT91C_CAN_MB5_MSR ((AT91_REG *) 	0xFFFAC2B0) /* (CAN_MB5) MailBox Status Register*/
#define AT91C_CAN_MB5_MDL ((AT91_REG *) 	0xFFFAC2B4) /* (CAN_MB5) MailBox Data Low Register*/
#define AT91C_CAN_MB5_MMR ((AT91_REG *) 	0xFFFAC2A0) /* (CAN_MB5) MailBox Mode Register*/
#define AT91C_CAN_MB5_MAM ((AT91_REG *) 	0xFFFAC2A4) /* (CAN_MB5) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB5_MFID ((AT91_REG *) 	0xFFFAC2AC) /* (CAN_MB5) MailBox Family ID Register*/
/* ========== Register definition for CAN_MB6 peripheral ========== */
#define AT91C_CAN_MB6_MSR ((AT91_REG *) 	0xFFFAC2D0) /* (CAN_MB6) MailBox Status Register*/
#define AT91C_CAN_MB6_MMR ((AT91_REG *) 	0xFFFAC2C0) /* (CAN_MB6) MailBox Mode Register*/
#define AT91C_CAN_MB6_MFID ((AT91_REG *) 	0xFFFAC2CC) /* (CAN_MB6) MailBox Family ID Register*/
#define AT91C_CAN_MB6_MDL ((AT91_REG *) 	0xFFFAC2D4) /* (CAN_MB6) MailBox Data Low Register*/
#define AT91C_CAN_MB6_MID ((AT91_REG *) 	0xFFFAC2C8) /* (CAN_MB6) MailBox ID Register*/
#define AT91C_CAN_MB6_MCR ((AT91_REG *) 	0xFFFAC2DC) /* (CAN_MB6) MailBox Control Register*/
#define AT91C_CAN_MB6_MAM ((AT91_REG *) 	0xFFFAC2C4) /* (CAN_MB6) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB6_MDH ((AT91_REG *) 	0xFFFAC2D8) /* (CAN_MB6) MailBox Data High Register*/
/* ========== Register definition for CAN_MB7 peripheral ========== */
#define AT91C_CAN_MB7_MAM ((AT91_REG *) 	0xFFFAC2E4) /* (CAN_MB7) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB7_MDH ((AT91_REG *) 	0xFFFAC2F8) /* (CAN_MB7) MailBox Data High Register*/
#define AT91C_CAN_MB7_MID ((AT91_REG *) 	0xFFFAC2E8) /* (CAN_MB7) MailBox ID Register*/
#define AT91C_CAN_MB7_MSR ((AT91_REG *) 	0xFFFAC2F0) /* (CAN_MB7) MailBox Status Register*/
#define AT91C_CAN_MB7_MMR ((AT91_REG *) 	0xFFFAC2E0) /* (CAN_MB7) MailBox Mode Register*/
#define AT91C_CAN_MB7_MCR ((AT91_REG *) 	0xFFFAC2FC) /* (CAN_MB7) MailBox Control Register*/
#define AT91C_CAN_MB7_MFID ((AT91_REG *) 	0xFFFAC2EC) /* (CAN_MB7) MailBox Family ID Register*/
#define AT91C_CAN_MB7_MDL ((AT91_REG *) 	0xFFFAC2F4) /* (CAN_MB7) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB8 peripheral ========== */
#define AT91C_CAN_MB8_MDH ((AT91_REG *) 	0xFFFAC318) /* (CAN_MB8) MailBox Data High Register*/
#define AT91C_CAN_MB8_MMR ((AT91_REG *) 	0xFFFAC300) /* (CAN_MB8) MailBox Mode Register*/
#define AT91C_CAN_MB8_MCR ((AT91_REG *) 	0xFFFAC31C) /* (CAN_MB8) MailBox Control Register*/
#define AT91C_CAN_MB8_MSR ((AT91_REG *) 	0xFFFAC310) /* (CAN_MB8) MailBox Status Register*/
#define AT91C_CAN_MB8_MAM ((AT91_REG *) 	0xFFFAC304) /* (CAN_MB8) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB8_MFID ((AT91_REG *) 	0xFFFAC30C) /* (CAN_MB8) MailBox Family ID Register*/
#define AT91C_CAN_MB8_MID ((AT91_REG *) 	0xFFFAC308) /* (CAN_MB8) MailBox ID Register*/
#define AT91C_CAN_MB8_MDL ((AT91_REG *) 	0xFFFAC314) /* (CAN_MB8) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB9 peripheral ========== */
#define AT91C_CAN_MB9_MID ((AT91_REG *) 	0xFFFAC328) /* (CAN_MB9) MailBox ID Register*/
#define AT91C_CAN_MB9_MMR ((AT91_REG *) 	0xFFFAC320) /* (CAN_MB9) MailBox Mode Register*/
#define AT91C_CAN_MB9_MDH ((AT91_REG *) 	0xFFFAC338) /* (CAN_MB9) MailBox Data High Register*/
#define AT91C_CAN_MB9_MSR ((AT91_REG *) 	0xFFFAC330) /* (CAN_MB9) MailBox Status Register*/
#define AT91C_CAN_MB9_MAM ((AT91_REG *) 	0xFFFAC324) /* (CAN_MB9) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB9_MDL ((AT91_REG *) 	0xFFFAC334) /* (CAN_MB9) MailBox Data Low Register*/
#define AT91C_CAN_MB9_MFID ((AT91_REG *) 	0xFFFAC32C) /* (CAN_MB9) MailBox Family ID Register*/
#define AT91C_CAN_MB9_MCR ((AT91_REG *) 	0xFFFAC33C) /* (CAN_MB9) MailBox Control Register*/
/* ========== Register definition for CAN_MB10 peripheral ========== */
#define AT91C_CAN_MB10_MCR ((AT91_REG *) 	0xFFFAC35C) /* (CAN_MB10) MailBox Control Register*/
#define AT91C_CAN_MB10_MDH ((AT91_REG *) 	0xFFFAC358) /* (CAN_MB10) MailBox Data High Register*/
#define AT91C_CAN_MB10_MAM ((AT91_REG *) 	0xFFFAC344) /* (CAN_MB10) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB10_MID ((AT91_REG *) 	0xFFFAC348) /* (CAN_MB10) MailBox ID Register*/
#define AT91C_CAN_MB10_MDL ((AT91_REG *) 	0xFFFAC354) /* (CAN_MB10) MailBox Data Low Register*/
#define AT91C_CAN_MB10_MSR ((AT91_REG *) 	0xFFFAC350) /* (CAN_MB10) MailBox Status Register*/
#define AT91C_CAN_MB10_MMR ((AT91_REG *) 	0xFFFAC340) /* (CAN_MB10) MailBox Mode Register*/
#define AT91C_CAN_MB10_MFID ((AT91_REG *) 	0xFFFAC34C) /* (CAN_MB10) MailBox Family ID Register*/
/* ========== Register definition for CAN_MB11 peripheral ========== */
#define AT91C_CAN_MB11_MSR ((AT91_REG *) 	0xFFFAC370) /* (CAN_MB11) MailBox Status Register*/
#define AT91C_CAN_MB11_MFID ((AT91_REG *) 	0xFFFAC36C) /* (CAN_MB11) MailBox Family ID Register*/
#define AT91C_CAN_MB11_MDL ((AT91_REG *) 	0xFFFAC374) /* (CAN_MB11) MailBox Data Low Register*/
#define AT91C_CAN_MB11_MDH ((AT91_REG *) 	0xFFFAC378) /* (CAN_MB11) MailBox Data High Register*/
#define AT91C_CAN_MB11_MID ((AT91_REG *) 	0xFFFAC368) /* (CAN_MB11) MailBox ID Register*/
#define AT91C_CAN_MB11_MCR ((AT91_REG *) 	0xFFFAC37C) /* (CAN_MB11) MailBox Control Register*/
#define AT91C_CAN_MB11_MMR ((AT91_REG *) 	0xFFFAC360) /* (CAN_MB11) MailBox Mode Register*/
#define AT91C_CAN_MB11_MAM ((AT91_REG *) 	0xFFFAC364) /* (CAN_MB11) MailBox Acceptance Mask Register*/
