una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* ========== Register definition for CAN_MB12 peripheral ========== */
#define AT91C_CAN_MB12_MAM ((AT91_REG *) 	0xFFFAC384) /* (CAN_MB12) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB12_MDH ((AT91_REG *) 	0xFFFAC398) /* (CAN_MB12) MailBox Data High Register*/
#define AT91C_CAN_MB12_MMR ((AT91_REG *) 	0xFFFAC380) /* (CAN_MB12) MailBox Mode Register*/
#define AT91C_CAN_MB12_MSR ((AT91_REG *) 	0xFFFAC390) /* (CAN_MB12) MailBox Status Register*/
#define AT91C_CAN_MB12_MFID ((AT91_REG *) 	0xFFFAC38C) /* (CAN_MB12) MailBox Family ID Register*/
#define AT91C_CAN_MB12_MID ((AT91_REG *) 	0xFFFAC388) /* (CAN_MB12) MailBox ID Register*/
#define AT91C_CAN_MB12_MCR ((AT91_REG *) 	0xFFFAC39C) /* (CAN_MB12) MailBox Control Register*/
#define AT91C_CAN_MB12_MDL ((AT91_REG *) 	0xFFFAC394) /* (CAN_MB12) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB13 peripheral ========== */
#define AT91C_CAN_MB13_MDH ((AT91_REG *) 	0xFFFAC3B8) /* (CAN_MB13) MailBox Data High Register*/
#define AT91C_CAN_MB13_MFID ((AT91_REG *) 	0xFFFAC3AC) /* (CAN_MB13) MailBox Family ID Register*/
#define AT91C_CAN_MB13_MSR ((AT91_REG *) 	0xFFFAC3B0) /* (CAN_MB13) MailBox Status Register*/
#define AT91C_CAN_MB13_MID ((AT91_REG *) 	0xFFFAC3A8) /* (CAN_MB13) MailBox ID Register*/
#define AT91C_CAN_MB13_MAM ((AT91_REG *) 	0xFFFAC3A4) /* (CAN_MB13) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB13_MMR ((AT91_REG *) 	0xFFFAC3A0) /* (CAN_MB13) MailBox Mode Register*/
#define AT91C_CAN_MB13_MCR ((AT91_REG *) 	0xFFFAC3BC) /* (CAN_MB13) MailBox Control Register*/
#define AT91C_CAN_MB13_MDL ((AT91_REG *) 	0xFFFAC3B4) /* (CAN_MB13) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB14 peripheral ========== */
#define AT91C_CAN_MB14_MDL ((AT91_REG *) 	0xFFFAC3D4) /* (CAN_MB14) MailBox Data Low Register*/
#define AT91C_CAN_MB14_MMR ((AT91_REG *) 	0xFFFAC3C0) /* (CAN_MB14) MailBox Mode Register*/
#define AT91C_CAN_MB14_MFID ((AT91_REG *) 	0xFFFAC3CC) /* (CAN_MB14) MailBox Family ID Register*/
#define AT91C_CAN_MB14_MCR ((AT91_REG *) 	0xFFFAC3DC) /* (CAN_MB14) MailBox Control Register*/
#define AT91C_CAN_MB14_MID ((AT91_REG *) 	0xFFFAC3C8) /* (CAN_MB14) MailBox ID Register*/
#define AT91C_CAN_MB14_MDH ((AT91_REG *) 	0xFFFAC3D8) /* (CAN_MB14) MailBox Data High Register*/
#define AT91C_CAN_MB14_MSR ((AT91_REG *) 	0xFFFAC3D0) /* (CAN_MB14) MailBox Status Register*/
#define AT91C_CAN_MB14_MAM ((AT91_REG *) 	0xFFFAC3C4) /* (CAN_MB14) MailBox Acceptance Mask Register*/
/* ========== Register definition for CAN_MB15 peripheral ========== */
#define AT91C_CAN_MB15_MDL ((AT91_REG *) 	0xFFFAC3F4) /* (CAN_MB15) MailBox Data Low Register*/
#define AT91C_CAN_MB15_MSR ((AT91_REG *) 	0xFFFAC3F0) /* (CAN_MB15) MailBox Status Register*/
#define AT91C_CAN_MB15_MID ((AT91_REG *) 	0xFFFAC3E8) /* (CAN_MB15) MailBox ID Register*/
#define AT91C_CAN_MB15_MAM ((AT91_REG *) 	0xFFFAC3E4) /* (CAN_MB15) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB15_MCR ((AT91_REG *) 	0xFFFAC3FC) /* (CAN_MB15) MailBox Control Register*/
#define AT91C_CAN_MB15_MFID ((AT91_REG *) 	0xFFFAC3EC) /* (CAN_MB15) MailBox Family ID Register*/
#define AT91C_CAN_MB15_MMR ((AT91_REG *) 	0xFFFAC3E0) /* (CAN_MB15) MailBox Mode Register*/
#define AT91C_CAN_MB15_MDH ((AT91_REG *) 	0xFFFAC3F8) /* (CAN_MB15) MailBox Data High Register*/
/* ========== Register definition for CAN peripheral ========== */
#define AT91C_CAN_ACR   ((AT91_REG *) 	0xFFFAC028) /* (CAN) Abort Command Register*/
#define AT91C_CAN_BR    ((AT91_REG *) 	0xFFFAC014) /* (CAN) Baudrate Register*/
#define AT91C_CAN_IDR   ((AT91_REG *) 	0xFFFAC008) /* (CAN) Interrupt Disable Register*/
#define AT91C_CAN_TIMESTP ((AT91_REG *) 	0xFFFAC01C) /* (CAN) Time Stamp Register*/
#define AT91C_CAN_SR    ((AT91_REG *) 	0xFFFAC010) /* (CAN) Status Register*/
#define AT91C_CAN_IMR   ((AT91_REG *) 	0xFFFAC00C) /* (CAN) Interrupt Mask Register*/
#define AT91C_CAN_TCR   ((AT91_REG *) 	0xFFFAC024) /* (CAN) Transfer Command Register*/
#define AT91C_CAN_TIM   ((AT91_REG *) 	0xFFFAC018) /* (CAN) Timer Register*/
#define AT91C_CAN_IER   ((AT91_REG *) 	0xFFFAC004) /* (CAN) Interrupt Enable Register*/
#define AT91C_CAN_ECR   ((AT91_REG *) 	0xFFFAC020) /* (CAN) Error Counter Register*/
#define AT91C_CAN_VR    ((AT91_REG *) 	0xFFFAC0FC) /* (CAN) Version Register*/
#define AT91C_CAN_MR    ((AT91_REG *) 	0xFFFAC000) /* (CAN) Mode Register*/
/* ========== Register definition for PWMC_CH0 peripheral ========== */
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0xFFFB820C) /* (PWMC_CH0) Channel Counter Register*/
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0xFFFB8208) /* (PWMC_CH0) Channel Period Register*/
#define AT91C_PWMC_CH0_CUPDR ((AT91_REG *) 	0xFFFB8210) /* (PWMC_CH0) Channel Update Register*/
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0xFFFB8204) /* (PWMC_CH0) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0xFFFB8200) /* (PWMC_CH0) Channel Mode Register*/
#define AT91C_PWMC_CH0_Reserved ((AT91_REG *) 	0xFFFB8214) /* (PWMC_CH0) Reserved*/
/* ========== Register definition for PWMC_CH1 peripheral ========== */
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0xFFFB822C) /* (PWMC_CH1) Channel Counter Register*/
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0xFFFB8224) /* (PWMC_CH1) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0xFFFB8220) /* (PWMC_CH1) Channel Mode Register*/
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0xFFFB8228) /* (PWMC_CH1) Channel Period Register*/
#define AT91C_PWMC_CH1_Reserved ((AT91_REG *) 	0xFFFB8234) /* (PWMC_CH1) Reserved*/
#define AT91C_PWMC_CH1_CUPDR ((AT91_REG *) 	0xFFFB8230) /* (PWMC_CH1) Channel Update Register*/
/* ========== Register definition for PWMC_CH2 peripheral ========== */
#define AT91C_PWMC_CH2_CUPDR ((AT91_REG *) 	0xFFFB8250) /* (PWMC_CH2) Channel Update Register*/
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0xFFFB8240) /* (PWMC_CH2) Channel Mode Register*/
#define AT91C_PWMC_CH2_Reserved ((AT91_REG *) 	0xFFFB8254) /* (PWMC_CH2) Reserved*/
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0xFFFB8248) /* (PWMC_CH2) Channel Period Register*/
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0xFFFB8244) /* (PWMC_CH2) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0xFFFB824C) /* (PWMC_CH2) Channel Counter Register*/
/* ========== Register definition for PWMC_CH3 peripheral ========== */
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0xFFFB8268) /* (PWMC_CH3) Channel Period Register*/
#define AT91C_PWMC_CH3_Reserved ((AT91_REG *) 	0xFFFB8274) /* (PWMC_CH3) Reserved*/
#define AT91C_PWMC_CH3_CUPDR ((AT91_REG *) 	0xFFFB8270) /* (PWMC_CH3) Channel Update Register*/
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0xFFFB8264) /* (PWMC_CH3) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0xFFFB826C) /* (PWMC_CH3) Channel Counter Register*/
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0xFFFB8260) /* (PWMC_CH3) Channel Mode Register*/
/* ========== Register definition for PWMC peripheral ========== */
#define AT91C_PWMC_IDR  ((AT91_REG *) 	0xFFFB8014) /* (PWMC) PWMC Interrupt Disable Register*/
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFB8000) /* (PWMC) PWMC Mode Register*/
#define AT91C_PWMC_VR   ((AT91_REG *) 	0xFFFB80FC) /* (PWMC) PWMC Version Register*/
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFB8018) /* (PWMC) PWMC Interrupt Mask Register*/
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFB800C) /* (PWMC) PWMC Status Register*/
#define AT91C_PWMC_ISR  ((AT91_REG *) 	0xFFFB801C) /* (PWMC) PWMC Interrupt Status Register*/
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFB8004) /* (PWMC) PWMC Enable Register*/
#define AT91C_PWMC_IER  ((AT91_REG *) 	0xFFFB8010) /* (PWMC) PWMC Interrupt Enable Register*/
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0xFFFB8008) /* (PWMC) PWMC Disable Register*/
/* ========== Register definition for MACB peripheral ========== */
#define AT91C_MACB_ALE  ((AT91_REG *) 	0xFFFBC054) /* (MACB) Alignment Error Register*/
#define AT91C_MACB_RRE  ((AT91_REG *) 	0xFFFBC06C) /* (MACB) Receive Ressource Error Register*/
#define AT91C_MACB_SA4H ((AT91_REG *) 	0xFFFBC0B4) /* (MACB) Specific Address 4 Top, Last 2 bytes*/
#define AT91C_MACB_TPQ  ((AT91_REG *) 	0xFFFBC0BC) /* (MACB) Transmit Pause Quantum Register*/
#define AT91C_MACB_RJA  ((AT91_REG *) 	0xFFFBC07C) /* (MACB) Receive Jabbers Register*/
#define AT91C_MACB_SA2H ((AT91_REG *) 	0xFFFBC0A4) /* (MACB) Specific Address 2 Top, Last 2 bytes*/
#define AT91C_MACB_TPF  ((AT91_REG *) 	0xFFFBC08C) /* (MACB) Transmitted Pause Frames Register*/
#define AT91C_MACB_ROV  ((AT91_REG *) 	0xFFFBC070) /* (MACB) Receive Overrun Errors Register*/
#define AT91C_MACB_SA4L ((AT91_REG *) 	0xFFFBC0B0) /* (MACB) Specific Address 4 Bottom, First 4 bytes*/
#define AT91C_MACB_MAN  ((AT91_REG *) 	0xFFFBC034) /* (MACB) PHY Maintenance Register*/
#define AT91C_MACB_TID  ((AT91_REG *) 	0xFFFBC0B8) /* (MACB) Type ID Checking Register*/
#define AT91C_MACB_TBQP ((AT91_REG *) 	0xFFFBC01C) /* (MACB) Transmit Buffer Queue Pointer*/
#define AT91C_MACB_SA3L ((AT91_REG *) 	0xFFFBC0A8) /* (MACB) Specific Address 3 Bottom, First 4 bytes*/
#define AT91C_MACB_DTF  ((AT91_REG *) 	0xFFFBC058) /* (MACB) Deferred Transmission Frame Register*/
#define AT91C_MACB_PTR  ((AT91_REG *) 	0xFFFBC038) /* (MACB) Pause Time Register*/
#define AT91C_MACB_CSE  ((AT91_REG *) 	0xFFFBC068) /* (MACB) Carrier Sense Error Register*/
#define AT91C_MACB_ECOL ((AT91_REG *) 	0xFFFBC060) /* (MACB) Excessive Collision Register*/
#define AT91C_MACB_STE  ((AT91_REG *) 	0xFFFBC084) /* (MACB) SQE Test Error Register*/
#define AT91C_MACB_MCF  ((AT91_REG *) 	0xFFFBC048) /* (MACB) Multiple Collision Frame Register*/
#define AT91C_MACB_IER  ((AT91_REG *) 	0xFFFBC028) /* (MACB) Interrupt Enable Register*/
#define AT91C_MACB_ELE  ((AT91_REG *) 	0xFFFBC078) /* (MACB) Excessive Length Errors Register*/
#define AT91C_MACB_USRIO ((AT91_REG *) 	0xFFFBC0C0) /* (MACB) USER Input/Output Register*/
#define AT91C_MACB_PFR  ((AT91_REG *) 	0xFFFBC03C) /* (MACB) Pause Frames received Register*/
#define AT91C_MACB_FCSE ((AT91_REG *) 	0xFFFBC050) /* (MACB) Frame Check Sequence Error Register*/
#define AT91C_MACB_SA1L ((AT91_REG *) 	0xFFFBC098) /* (MACB) Specific Address 1 Bottom, First 4 bytes*/
#define AT91C_MACB_NCR  ((AT91_REG *) 	0xFFFBC000) /* (MACB) Network Control Register*/
#define AT91C_MACB_HRT  ((AT91_REG *) 	0xFFFBC094) /* (MACB) Hash Address Top[63:32]*/
#define AT91C_MACB_NCFGR ((AT91_REG *) 	0xFFFBC004) /* (MACB) Network Configuration Register*/
#define AT91C_MACB_SCF  ((AT91_REG *) 	0xFFFBC044) /* (MACB) Single Collision Frame Register*/
#define AT91C_MACB_LCOL ((AT91_REG *) 	0xFFFBC05C) /* (MACB) Late Collision Register*/
#define AT91C_MACB_SA3H ((AT91_REG *) 	0xFFFBC0AC) /* (MACB) Specific Address 3 Top, Last 2 bytes*/
#define AT91C_MACB_HRB  ((AT91_REG *) 	0xFFFBC090) /* (MACB) Hash Address Bottom[31:0]*/
#define AT91C_MACB_ISR  ((AT91_REG *) 	0xFFFBC024) /* (MACB) Interrupt Status Register*/
#define AT91C_MACB_IMR  ((AT91_REG *) 	0xFFFBC030) /* (MACB) Interrupt Mask Register*/
#define AT91C_MACB_WOL  ((AT91_REG *) 	0xFFFBC0C4) /* (MACB) Wake On LAN Register*/
#define AT91C_MACB_USF  ((AT91_REG *) 	0xFFFBC080) /* (MACB) Undersize Frames Register*/
#define AT91C_MACB_TSR  ((AT91_REG *) 	0xFFFBC014) /* (MACB) Transmit Status Register*/
#define AT91C_MACB_FRO  ((AT91_REG *) 	0xFFFBC04C) /* (MACB) Frames Received OK Register*/
#define AT91C_MACB_IDR  ((AT91_REG *) 	0xFFFBC02C) /* (MACB) Interrupt Disable Register*/
#define AT91C_MACB_SA1H ((AT91_REG *) 	0xFFFBC09C) /* (MACB) Specific Address 1 Top, Last 2 bytes*/
#define AT91C_MACB_RLE  ((AT91_REG *) 	0xFFFBC088) /* (MACB) Receive Length Field Mismatch Register*/
#define AT91C_MACB_TUND ((AT91_REG *) 	0xFFFBC064) /* (MACB) Transmit Underrun Error Register*/
#define AT91C_MACB_RSR  ((AT91_REG *) 	0xFFFBC020) /* (MACB) Receive Status Register*/
#define AT91C_MACB_SA2L ((AT91_REG *) 	0xFFFBC0A0) /* (MACB) Specific Address 2 Bottom, First 4 bytes*/
#define AT91C_MACB_FTO  ((AT91_REG *) 	0xFFFBC040) /* (MACB) Frames Transmitted OK Register*/
#define AT91C_MACB_RSE  ((AT91_REG *) 	0xFFFBC074) /* (MACB) Receive Symbol Errors Register*/
#define AT91C_MACB_NSR  ((AT91_REG *) 	0xFFFBC008) /* (MACB) Network Status Register*/
#define AT91C_MACB_RBQP ((AT91_REG *) 	0xFFFBC018) /* (MACB) Receive Buffer Queue Pointer*/
#define AT91C_MACB_REV  ((AT91_REG *) 	0xFFFBC0FC) /* (MACB) Revision Register*/
/* ========== Register definition for LCDC peripheral ========== */
#define AT91C_LCDC_BA2  ((AT91_REG *) 	0x00700004) /* (LCDC) DMA Base Address Register 2*/
#define AT91C_LCDC_DP3_4 ((AT91_REG *) 	0x00700830) /* (LCDC) Dithering Pattern DP3_4 Register*/
#define AT91C_LCDC_FRMA2 ((AT91_REG *) 	0x00700014) /* (LCDC) DMA Frame Address Register 2*/
#define AT91C_LCDC_TIM1 ((AT91_REG *) 	0x00700808) /* (LCDC) LCD Timing Config 1 Register*/
#define AT91C_LCDC_FIFO ((AT91_REG *) 	0x00700814) /* (LCDC) LCD FIFO Register*/
#define AT91C_LCDC_TIM2 ((AT91_REG *) 	0x0070080C) /* (LCDC) LCD Timing Config 2 Register*/
#define AT91C_LCDC_DP5_7 ((AT91_REG *) 	0x0070082C) /* (LCDC) Dithering Pattern DP5_7 Register*/
#define AT91C_LCDC_IER  ((AT91_REG *) 	0x00700848) /* (LCDC) Interrupt Enable Register*/
#define AT91C_LCDC_FRMCFG ((AT91_REG *) 	0x00700018) /* (LCDC) DMA Frame Configuration Register*/
#define AT91C_LCDC_FRMA1 ((AT91_REG *) 	0x00700010) /* (LCDC) DMA Frame Address Register 1*/
#define AT91C_LCDC_DP3_5 ((AT91_REG *) 	0x00700824) /* (LCDC) Dithering Pattern DP3_5 Register*/
#define AT91C_LCDC_PWRCON ((AT91_REG *) 	0x0070083C) /* (LCDC) Power Control Register*/
#define AT91C_LCDC_IMR  ((AT91_REG *) 	0x00700850) /* (LCDC) Interrupt Mask Register*/
#define AT91C_LCDC_LUT_ENTRY ((AT91_REG *) 	0x00700C00) /* (LCDC) LUT Entries Register*/
#define AT91C_LCDC_IRR  ((AT91_REG *) 	0x00700864) /* (LCDC) Interrupts Raw Status Register*/
#define AT91C_LCDC_FRMP2 ((AT91_REG *) 	0x0070000C) /* (LCDC) DMA Frame Pointer Register 2*/
#define AT91C_LCDC_ICR  ((AT91_REG *) 	0x00700858) /* (LCDC) Interrupt Clear Register*/
#define AT91C_LCDC_DP1_2 ((AT91_REG *) 	0x0070081C) /* (LCDC) Dithering Pattern DP1_2 Register*/
#define AT91C_LCDC_DMACON ((AT91_REG *) 	0x0070001C) /* (LCDC) DMA Control Register*/
#define AT91C_LCDC_LCDFRCFG ((AT91_REG *) 	0x00700810) /* (LCDC) LCD Frame Config Register*/
#define AT91C_LCDC_DP2_3 ((AT91_REG *) 	0x00700828) /* (LCDC) Dithering Pattern DP2_3 Register*/
#define AT91C_LCDC_DP6_7 ((AT91_REG *) 	0x00700838) /* (LCDC) Dithering Pattern DP6_7 Register*/
#define AT91C_LCDC_LCDCON1 ((AT91_REG *) 	0x00700800) /* (LCDC) LCD Control 1 Register*/
#define AT91C_LCDC_DMA2DCFG ((AT91_REG *) 	0x00700020) /* (LCDC) DMA 2D addressing configuration*/
#define AT91C_LCDC_GPR  ((AT91_REG *) 	0x0070085C) /* (LCDC) General Purpose Register*/
#define AT91C_LCDC_BA1  ((AT91_REG *) 	0x00700000) /* (LCDC) DMA Base Address Register 1*/
#define AT91C_LCDC_CTRSTCON ((AT91_REG *) 	0x00700840) /* (LCDC) Contrast Control Register*/
#define AT91C_LCDC_CTRSTVAL ((AT91_REG *) 	0x00700844) /* (LCDC) Contrast Value Register*/
#define AT91C_LCDC_LCDCON2 ((AT91_REG *) 	0x00700804) /* (LCDC) LCD Control 2 Register*/
#define AT91C_LCDC_IDR  ((AT91_REG *) 	0x0070084C) /* (LCDC) Interrupt Disable Register*/
#define AT91C_LCDC_ISR  ((AT91_REG *) 	0x00700854) /* (LCDC) Interrupt Enable Register*/
#define AT91C_LCDC_ITR  ((AT91_REG *) 	0x00700860) /* (LCDC) Interrupts Test Register*/
#define AT91C_LCDC_DP4_7 ((AT91_REG *) 	0x00700820) /* (LCDC) Dithering Pattern DP4_7 Register*/
#define AT91C_LCDC_MVAL ((AT91_REG *) 	0x00700818) /* (LCDC) LCD Mode Toggle Rate Value Register*/
#define AT91C_LCDC_DP4_5 ((AT91_REG *) 	0x00700834) /* (LCDC) Dithering Pattern DP4_5 Register*/
#define AT91C_LCDC_FRMP1 ((AT91_REG *) 	0x00700008) /* (LCDC) DMA Frame Pointer Register 1*/
/* ========== Register definition for DMA peripheral ========== */
#define AT91C_DMA_RAWSRCTRAN ((AT91_REG *) 	0x008002D0) /* (DMA) Raw Status for IntSrcTran Interrupt*/
#define AT91C_DMA_SGR0  ((AT91_REG *) 	0x00800048) /* (DMA) Source Gather Register for channel 0*/
#define AT91C_DMA_REQSRCREG ((AT91_REG *) 	0x00800368) /* (DMA) Source Software Transaction Request Register*/
#define AT91C_DMA_STATUSERR ((AT91_REG *) 	0x00800308) /* (DMA) Status for IntErr IInterrupt*/
#define AT91C_DMA_SAR1  ((AT91_REG *) 	0x00800058) /* (DMA) Source Address Register for channel 1*/
#define AT91C_DMA_CLEARDSTTRAN ((AT91_REG *) 	0x00800350) /* (DMA) Clear for IntDstTran IInterrupt*/
#define AT91C_DMA_STATUSSRCTRAN ((AT91_REG *) 	0x008002F8) /* (DMA) Status for IntSrcTran Interrupt*/
#define AT91C_DMA_REQDSTREG ((AT91_REG *) 	0x00800370) /* (DMA) Destination Software Transaction Request Register*/
#define AT91C_DMA_DSTATAR0 ((AT91_REG *) 	0x00800038) /* (DMA) Destination Status Adress Register for channel 0*/
#define AT91C_DMA_LSTREQDSTREG ((AT91_REG *) 	0x00800390) /* (DMA) Last Destination Software Transaction Request Register*/
#define AT91C_DMA_SGLREQDSTREG ((AT91_REG *) 	0x00800380) /* (DMA) Single Destination Software Transaction Request Register*/
#define AT91C_DMA_CTL1h ((AT91_REG *) 	0x00800074) /* (DMA) Control Register for channel 1 - high*/
#define AT91C_DMA_CLEARERR ((AT91_REG *) 	0x00800358) /* (DMA) Clear for IntErr Interrupt*/
#define AT91C_DMA_DSR0  ((AT91_REG *) 	0x00800050) /* (DMA) Destination Scatter Register for channel 0*/
#define AT91C_DMA_DMATESTREG ((AT91_REG *) 	0x008003B0) /* (DMA) DW_ahb_dmac Test Register*/
#define AT91C_DMA_DSR1  ((AT91_REG *) 	0x008000A8) /* (DMA) Destination Scatter Register for channel 1*/
#define AT91C_DMA_CTL0l ((AT91_REG *) 	0x00800018) /* (DMA) Control Register for channel 0 - low*/
#define AT91C_DMA_STATUSBLOCK ((AT91_REG *) 	0x008002F0) /* (DMA) Status for IntBlock Interrupt*/
#define AT91C_DMA_SAR0  ((AT91_REG *) 	0x00800000) /* (DMA) Source Address Register for channel 0*/
#define AT91C_DMA_LLP0  ((AT91_REG *) 	0x00800010) /* (DMA) Linked List Pointer Register for channel 0*/
#define AT91C_DMA_CTL1l ((AT91_REG *) 	0x00800070) /* (DMA) Control Register for channel 1 - low*/
#define AT91C_DMA_SGR1  ((AT91_REG *) 	0x008000A0) /* (DMA) Source Gather Register for channel 1*/
#define AT91C_DMA_CFG0l ((AT91_REG *) 	0x00800040) /* (DMA) Configuration Register for channel 0 - low*/
#define AT91C_DMA_CFG0h ((AT91_REG *) 	0x00800044) /* (DMA) Configuration Register for channel 0 - high*/
#define AT91C_DMA_STATUSTFR ((AT91_REG *) 	0x008002E8) /* (DMA) Status for IntTfr Interrupt*/
#define AT91C_DMA_MASKBLOCK ((AT91_REG *) 	0x00800318) /* (DMA) Mask for IntBlock Interrupt*/
#define AT91C_DMA_RAWBLOCK ((AT91_REG *) 	0x008002C8) /* (DMA) Raw Status for IntBlock Interrupt*/
#define AT91C_DMA_CHENREG ((AT91_REG *) 	0x008003A0) /* (DMA) DW_ahb_dmac Channel Enable Register*/
#define AT91C_DMA_DSTAT0 ((AT91_REG *) 	0x00800028) /* (DMA) Destination Status Register for channel 0*/
#define AT91C_DMA_CLEARSRCTRAN ((AT91_REG *) 	0x00800348) /* (DMA) Clear for IntSrcTran Interrupt*/
#define AT91C_DMA_DAR1  ((AT91_REG *) 	0x00800060) /* (DMA) Destination Address Register for channel 1*/
#define AT91C_DMA_CLEARBLOCK ((AT91_REG *) 	0x00800340) /* (DMA) Clear for IntBlock Interrupt*/
#define AT91C_DMA_CFG1h ((AT91_REG *) 	0x0080009C) /* (DMA) Configuration Register for channel 1 - high*/
#define AT91C_DMA_DSTATAR1 ((AT91_REG *) 	0x00800090) /* (DMA) Destination Status Adress Register for channel 1*/
#define AT91C_DMA_RAWERR ((AT91_REG *) 	0x008002E0) /* (DMA) Raw Status for IntErr Interrupt*/
#define AT91C_DMA_CTL0h ((AT91_REG *) 	0x0080001C) /* (DMA) Control Register for channel 0 - high*/
#define AT91C_DMA_SGLREQSRCREG ((AT91_REG *) 	0x00800378) /* (DMA) Single Source Software Transaction Request Register*/
#define AT91C_DMA_LLP1  ((AT91_REG *) 	0x00800068) /* (DMA) Linked List Pointer Register for channel 1*/
#define AT91C_DMA_MASKDSTTRAN ((AT91_REG *) 	0x00800328) /* (DMA) Mask for IntDstTran Interrupt*/
#define AT91C_DMA_MASKSRCTRAN ((AT91_REG *) 	0x00800320) /* (DMA) Mask for IntSrcTran Interrupt*/
#define AT91C_DMA_LSTREQSRCREG ((AT91_REG *) 	0x00800388) /* (DMA) Last Source Software Transaction Request Register*/
#define AT91C_DMA_CLEARTFR ((AT91_REG *) 	0x00800338) /* (DMA) Clear for IntTfr Interrupt*/
#define AT91C_DMA_SSTATAR1 ((AT91_REG *) 	0x00800088) /* (DMA) Source Status Adress Register for channel 1*/
#define AT91C_DMA_DAR0  ((AT91_REG *) 	0x00800008) /* (DMA) Destination Address Register for channel 0*/
#define AT91C_DMA_SSTAT0 ((AT91_REG *) 	0x00800020) /* (DMA) Source Status Register for channel 0*/
#define AT91C_DMA_DMAIDREG ((AT91_REG *) 	0x008003A8) /* (DMA) DW_ahb_dmac ID Register*/
#define AT91C_DMA_DSTAT1 ((AT91_REG *) 	0x00800080) /* (DMA) Destination Status Register for channel 1*/
#define AT91C_DMA_RAWTFR ((AT91_REG *) 	0x008002C0) /* (DMA) Raw Status for IntTfr Interrupt*/
#define AT91C_DMA_VERSIONID ((AT91_REG *) 	0x008003B8) /* (DMA) DW_ahb_dmac Version ID Register*/
#define AT91C_DMA_STATUSDSTTRAN ((AT91_REG *) 	0x00800300) /* (DMA) Status for IntDstTran IInterrupt*/
#define AT91C_DMA_MASKERR ((AT91_REG *) 	0x00800330) /* (DMA) Mask for IntErr Interrupt*/
#define AT91C_DMA_SSTATAR0 ((AT91_REG *) 	0x00800030) /* (DMA) Source Status Adress Register for channel 0*/
#define AT91C_DMA_MASKTFR ((AT91_REG *) 	0x00800310) /* (DMA) Mask for IntTfr Interrupt*/
#define AT91C_DMA_SSTAT1 ((AT91_REG *) 	0x00800078) /* (DMA) Source Status Register for channel 1*/
#define AT91C_DMA_STATUSINT ((AT91_REG *) 	0x00800360) /* (DMA) Status for each Interrupt Type*/
#define AT91C_DMA_DMACFGREG ((AT91_REG *) 	0x00800398) /* (DMA) DW_ahb_dmac Configuration Register*/
#define AT91C_DMA_RAWDSTTRAN ((AT91_REG *) 	0x008002D8) /* (DMA) Raw Status for IntDstTran Interrupt*/
#define AT91C_DMA_CFG1l ((AT91_REG *) 	0x00800098) /* (DMA) Configuration Register for channel 1 - low*/
/* ========== Register definition for UDP peripheral ========== */
#define AT91C_UDP_FDR   ((AT91_REG *) 	0xFFF78050) /* (UDP) Endpoint FIFO Data Register*/
#define AT91C_UDP_IER   ((AT91_REG *) 	0xFFF78010) /* (UDP) Interrupt Enable Register*/
#define AT91C_UDP_CSR   ((AT91_REG *) 	0xFFF78030) /* (UDP) Endpoint Control and Status Register*/
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0xFFF78028) /* (UDP) Reset Endpoint Register*/
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0xFFF78004) /* (UDP) Global State Register*/
#define AT91C_UDP_TXVC  ((AT91_REG *) 	0xFFF78074) /* (UDP) Transceiver Control Register*/
#define AT91C_UDP_IDR   ((AT91_REG *) 	0xFFF78014) /* (UDP) Interrupt Disable Register*/
#define AT91C_UDP_ISR   ((AT91_REG *) 	0xFFF7801C) /* (UDP) Interrupt Status Register*/
#define AT91C_UDP_IMR   ((AT91_REG *) 	0xFFF78018) /* (UDP) Interrupt Mask Register*/
#define AT91C_UDP_FADDR ((AT91_REG *) 	0xFFF78008) /* (UDP) Function Address Register*/
#define AT91C_UDP_NUM   ((AT91_REG *) 	0xFFF78000) /* (UDP) Frame Number Register*/
#define AT91C_UDP_ICR   ((AT91_REG *) 	0xFFF78020) /* (UDP) Interrupt Clear Register*/
/* ========== Register definition for UHP peripheral ========== */
#define AT91C_UHP_HcRhDescriptorA ((AT91_REG *) 	0x00A00048) /* (UHP) Root Hub characteristics A*/
#define AT91C_UHP_HcInterruptStatus ((AT91_REG *) 	0x00A0000C) /* (UHP) Interrupt Status Register*/
#define AT91C_UHP_HcLSThreshold ((AT91_REG *) 	0x00A00044) /* (UHP) LS Threshold*/
#define AT91C_UHP_HcBulkDoneHead ((AT91_REG *) 	0x00A00030) /* (UHP) Last completed transfer descriptor*/
#define AT91C_UHP_HcInterruptDisable ((AT91_REG *) 	0x00A00014) /* (UHP) Interrupt Disable Register*/
#define AT91C_UHP_HcRhPortStatus ((AT91_REG *) 	0x00A00054) /* (UHP) Root Hub Port Status Register*/
#define AT91C_UHP_HcControl ((AT91_REG *) 	0x00A00004) /* (UHP) Operating modes for the Host Controller*/
