una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
#define AT91C_UHP_HcPeriodCurrentED ((AT91_REG *) 	0x00A0001C) /* (UHP) Current Isochronous or Interrupt Endpoint Descriptor*/
#define AT91C_UHP_HcControlHeadED ((AT91_REG *) 	0x00A00020) /* (UHP) First Endpoint Descriptor of the Control list*/
#define AT91C_UHP_HcCommandStatus ((AT91_REG *) 	0x00A00008) /* (UHP) Command & status Register*/
#define AT91C_UHP_HcFmNumber ((AT91_REG *) 	0x00A0003C) /* (UHP) Frame number*/
#define AT91C_UHP_HcRhDescriptorB ((AT91_REG *) 	0x00A0004C) /* (UHP) Root Hub characteristics B*/
#define AT91C_UHP_HcBulkHeadED ((AT91_REG *) 	0x00A00028) /* (UHP) First endpoint register of the Bulk list*/
#define AT91C_UHP_HcFmRemaining ((AT91_REG *) 	0x00A00038) /* (UHP) Bit time remaining in the current Frame*/
#define AT91C_UHP_HcRevision ((AT91_REG *) 	0x00A00000) /* (UHP) Revision*/
#define AT91C_UHP_HcInterruptEnable ((AT91_REG *) 	0x00A00010) /* (UHP) Interrupt Enable Register*/
#define AT91C_UHP_HcControlCurrentED ((AT91_REG *) 	0x00A00024) /* (UHP) Endpoint Control and Status Register*/
#define AT91C_UHP_HcBulkCurrentED ((AT91_REG *) 	0x00A0002C) /* (UHP) Current endpoint of the Bulk list*/
#define AT91C_UHP_HcHCCA ((AT91_REG *) 	0x00A00018) /* (UHP) Pointer to the Host Controller Communication Area*/
#define AT91C_UHP_HcPeriodicStart ((AT91_REG *) 	0x00A00040) /* (UHP) Periodic Start*/
#define AT91C_UHP_HcRhStatus ((AT91_REG *) 	0x00A00050) /* (UHP) Root Hub Status register*/
#define AT91C_UHP_HcFmInterval ((AT91_REG *) 	0x00A00034) /* (UHP) Bit time between 2 consecutive SOFs*/
/* ========== Register definition for TBOX peripheral ========== */
#define AT91C_TBOX_GPSSIGFILE ((AT91_REG *) 	0x70000BA0) /* (TBOX) GPS RFIN/DRFIN driven from files/Samples_GPS.data*/
#define AT91C_TBOX_PIOA ((AT91_REG *) 	0x7000093C) /* (TBOX) Value Of PIOA*/
#define AT91C_TBOX_PWM1 ((AT91_REG *) 	0x70000A08) /* (TBOX) PWM1[4:0]=nb pulses on pb7, PWM1[9:5]=nb pulses on pc28, PWM1[20:16]=nb pulses on pb8, PWM1[25:21]=nb pulses on pc3*/
#define AT91C_TBOX_PIODENABLEFORCE ((AT91_REG *) 	0x7000092C) /* (TBOX) If each bit is 1, the corresponding bit of PIOD is controlled by TBOX_PIODFORCEVALUE*/
#define AT91C_TBOX_PIODPUN ((AT91_REG *) 	0x7000090C) /* (TBOX) Spy on PIO PUN inputs*/
#define AT91C_TBOX_PIOAENABLEFORCE ((AT91_REG *) 	0x70000914) /* (TBOX) If each bit is 1, the corresponding bit of PIOA is controlled by TBOX_PIOAFORCEVALUE*/
#define AT91C_TBOX_PIOD ((AT91_REG *) 	0x70000948) /* (TBOX) Value Of PIOD*/
#define AT91C_TBOX_STOPAPBSPY ((AT91_REG *) 	0x70000A1C) /* (TBOX) When 1, no more APB SPY messages*/
#define AT91C_TBOX_PIOEENABLEFORCE ((AT91_REG *) 	0x70000934) /* (TBOX) If each bit is 1, the corresponding bit of PIOE is controlled by TBOX_PIOEFORCEVALUE*/
#define AT91C_TBOX_PIOBPUN ((AT91_REG *) 	0x70000904) /* (TBOX) Spy on PIO PUN inputs*/
#define AT91C_TBOX_USBDEV ((AT91_REG *) 	0x70000A14) /* (TBOX) USB device testbench : bit 0 = flag0, bit 1 = flag1*/
#define AT91C_TBOX_GPSRAND ((AT91_REG *) 	0x70000B04) /* (TBOX) GPS random data for correlator (Stimulus - Internal Node)*/
#define AT91C_TBOX_KBD  ((AT91_REG *) 	0x70000A18) /* (TBOX) Keyboard testbench : bit 0 = keypressed; bits[7:6] = key column; bits[5:4] = key row;*/
#define AT91C_TBOX_PIOEFORCEVALUE ((AT91_REG *) 	0x70000938) /* (TBOX) Value to force on PIOA when bits TBOX_PIOEENABLEFORCE are 1*/
#define AT91C_TBOX_AC97START ((AT91_REG *) 	0x70000A00) /* (TBOX) Start of AC97 test: swith PIO mux to connect PIOs to audio codec model.*/
#define AT91C_TBOX_PIOAPUN ((AT91_REG *) 	0x70000900) /* (TBOX) Spy on PIO PUN inputs*/
#define AT91C_TBOX_GPSACQSTATUS ((AT91_REG *) 	0x70000B08) /* (TBOX) GPS acquisition status (Probe - Internal Node)*/
#define AT91C_TBOX_PIOEPUN ((AT91_REG *) 	0x70000910) /* (TBOX) Spy on PIO PUN inputs*/
#define AT91C_TBOX_PIOE ((AT91_REG *) 	0x7000094C) /* (TBOX) Value Of PIOE*/
#define AT91C_TBOX_PIODFORCEVALUE ((AT91_REG *) 	0x70000930) /* (TBOX) Value to force on PIOA when bits TBOX_PIODENABLEFORCE are 1*/
#define AT91C_TBOX_PWMSTART ((AT91_REG *) 	0x70000A04) /* (TBOX) Start of PWM test: Start to count edges on PWM IOs*/
#define AT91C_TBOX_GPSSIGIB ((AT91_REG *) 	0x70000BB0) /* (TBOX) GPS DRFIN[5:4] aka SIGI_B (Stimulus)*/
#define AT91C_TBOX_GPSSYNCHRO ((AT91_REG *) 	0x70000B00) /* (TBOX) GPS synchronization (Stimulus)*/
#define AT91C_TBOX_PIOAFORCEVALUE ((AT91_REG *) 	0x70000918) /* (TBOX) Value to force on PIOA when bits TBOX_PIOAENABLEFORCE are 1*/
#define AT91C_TBOX_GPSACQDATA ((AT91_REG *) 	0x70000B0C) /* (TBOX) GPS acquisition data (Probe - Internal Node)*/
#define AT91C_TBOX_SHMCTRL ((AT91_REG *) 	0x70000000) /* (TBOX) SHM Probe Control: 0-> shm probe stopped, 1: shm probe started*/
#define AT91C_TBOX_MAC  ((AT91_REG *) 	0x70000A10) /* (TBOX) MAC testbench : bit 0 = rxtrig, bit 1 = clkofftester, bit 2 = err_sig_loops*/
#define AT91C_TBOX_GPSSIGIA ((AT91_REG *) 	0x70000BA4) /* (TBOX) GPS DRFIN[1:0] aka SIGI_A (Stimulus)*/
#define AT91C_TBOX_PIOBFORCEVALUE ((AT91_REG *) 	0x70000920) /* (TBOX) Value to force on PIOA when bits TBOX_PIOBENABLEFORCE are 1*/
#define AT91C_TBOX_PIOCPUN ((AT91_REG *) 	0x70000908) /* (TBOX) Spy on PIO PUN inputs*/
#define AT91C_TBOX_PIOCFORCEVALUE ((AT91_REG *) 	0x70000928) /* (TBOX) Value to force on PIOA when bits TBOX_PIOCENABLEFORCE are 1*/
#define AT91C_TBOX_PIOC ((AT91_REG *) 	0x70000944) /* (TBOX) Value Of PIOC*/
#define AT91C_TBOX_DMAEXTREQ ((AT91_REG *) 	0x70000810) /* (TBOX) DMA External request lines 3 to 0*/
#define AT91C_TBOX_GPSDUMPRES ((AT91_REG *) 	0x70000BC0) /* (TBOX) GPS Dump results and errors*/
#define AT91C_TBOX_PIOCENABLEFORCE ((AT91_REG *) 	0x70000924) /* (TBOX) If each bit is 1, the corresponding bit of PIOC is controlled by TBOX_PIOCFORCEVALUE*/
#define AT91C_TBOX_PWM2 ((AT91_REG *) 	0x70000A0C) /* (TBOX) PWM2[3:0]=nb pulses on pb27, PWM2[7:4]=nb pulses on pc29, PWM2[19:16]=nb pulses on pb29, PWM2[23:20]=nb pulses on pe10*/
#define AT91C_TBOX_GPSSIGQA ((AT91_REG *) 	0x70000BA8) /* (TBOX) GPS DRFIN[3:2] aka SIGQ_A (Stimulus)*/
#define AT91C_TBOX_PIOB ((AT91_REG *) 	0x70000940) /* (TBOX) Value Of PIOB*/
#define AT91C_TBOX_PIOBENABLEFORCE ((AT91_REG *) 	0x7000091C) /* (TBOX) If each bit is 1, the corresponding bit of PIOB is controlled by TBOX_PIOBFORCEVALUE*/
#define AT91C_TBOX_GPSSIGQB ((AT91_REG *) 	0x70000BB4) /* (TBOX) GPS DRFIN[7:6] aka SIGQ_B (Stimulus)*/
/* ========== Register definition for HECC0 peripheral ========== */
#define AT91C_HECC0_SR  ((AT91_REG *) 	0xFFFFE008) /* (HECC0)  ECC Status register*/
#define AT91C_HECC0_VR  ((AT91_REG *) 	0xFFFFE0FC) /* (HECC0)  ECC Version register*/
#define AT91C_HECC0_CR  ((AT91_REG *) 	0xFFFFE000) /* (HECC0)  ECC reset register*/
#define AT91C_HECC0_PR  ((AT91_REG *) 	0xFFFFE00C) /* (HECC0)  ECC Parity register*/
#define AT91C_HECC0_MR  ((AT91_REG *) 	0xFFFFE004) /* (HECC0)  ECC Page size register*/
#define AT91C_HECC0_NPR ((AT91_REG *) 	0xFFFFE010) /* (HECC0)  ECC Parity N register*/
/* ========== Register definition for HECC1 peripheral ========== */
#define AT91C_HECC1_MR  ((AT91_REG *) 	0xFFFFE604) /* (HECC1)  ECC Page size register*/
#define AT91C_HECC1_VR  ((AT91_REG *) 	0xFFFFE6FC) /* (HECC1)  ECC Version register*/
#define AT91C_HECC1_PR  ((AT91_REG *) 	0xFFFFE60C) /* (HECC1)  ECC Parity register*/
#define AT91C_HECC1_CR  ((AT91_REG *) 	0xFFFFE600) /* (HECC1)  ECC reset register*/
#define AT91C_HECC1_NPR ((AT91_REG *) 	0xFFFFE610) /* (HECC1)  ECC Parity N register*/
#define AT91C_HECC1_SR  ((AT91_REG *) 	0xFFFFE608) /* (HECC1)  ECC Status register*/
/* ========== Register definition for HISI peripheral ========== */
#define AT91C_HISI_CDBA ((AT91_REG *) 	0xFFFC402C) /* (HISI) Codec Dma Address Register*/
#define AT91C_HISI_PDECF ((AT91_REG *) 	0xFFFC4024) /* (HISI) Preview Decimation Factor Register*/
#define AT91C_HISI_IMR  ((AT91_REG *) 	0xFFFC4014) /* (HISI) Interrupt Mask Register*/
#define AT91C_HISI_IER  ((AT91_REG *) 	0xFFFC400C) /* (HISI) Interrupt Enable Register*/
#define AT91C_HISI_SR   ((AT91_REG *) 	0xFFFC4008) /* (HISI) Status Register*/
#define AT91C_HISI_Y2RSET0 ((AT91_REG *) 	0xFFFC4030) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_PFBD ((AT91_REG *) 	0xFFFC4028) /* (HISI) Preview Frame Buffer Address Register*/
#define AT91C_HISI_PSIZE ((AT91_REG *) 	0xFFFC4020) /* (HISI) Preview Size Register*/
#define AT91C_HISI_IDR  ((AT91_REG *) 	0xFFFC4010) /* (HISI) Interrupt Disable Register*/
#define AT91C_HISI_R2YSET2 ((AT91_REG *) 	0xFFFC4040) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_R2YSET0 ((AT91_REG *) 	0xFFFC4038) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_CR1  ((AT91_REG *) 	0xFFFC4000) /* (HISI) Control Register 1*/
#define AT91C_HISI_CR2  ((AT91_REG *) 	0xFFFC4004) /* (HISI) Control Register 2*/
#define AT91C_HISI_Y2RSET1 ((AT91_REG *) 	0xFFFC4034) /* (HISI) Color Space Conversion Register*/
#define AT91C_HISI_R2YSET1 ((AT91_REG *) 	0xFFFC403C) /* (HISI) Color Space Conversion Register*/

