una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91SAM9263*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PA0_MCI0_DA0 ((unsigned int) AT91C_PIO_PA0) /*  */
#define AT91C_PA0_SPI0_MISO ((unsigned int) AT91C_PIO_PA0) /*  */
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PA1_MCI0_CDA ((unsigned int) AT91C_PIO_PA1) /*  */
#define AT91C_PA1_SPI0_MOSI ((unsigned int) AT91C_PIO_PA1) /*  */
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PA10_MCI1_DA2 ((unsigned int) AT91C_PIO_PA10) /*  */
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PA11_MCI1_DA3 ((unsigned int) AT91C_PIO_PA11) /*  */
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PA12_MCI0_CK  ((unsigned int) AT91C_PIO_PA12) /*  */
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PA13_CANTX    ((unsigned int) AT91C_PIO_PA13) /*  */
#define AT91C_PA13_PCK0     ((unsigned int) AT91C_PIO_PA13) /*  */
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PA14_CANRX    ((unsigned int) AT91C_PIO_PA14) /*  */
#define AT91C_PA14_IRQ0     ((unsigned int) AT91C_PIO_PA14) /*  */
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PA15_TCLK2    ((unsigned int) AT91C_PIO_PA15) /*  */
#define AT91C_PA15_IRQ1     ((unsigned int) AT91C_PIO_PA15) /*  */
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PA16_MCI0_CDB ((unsigned int) AT91C_PIO_PA16) /*  */
#define AT91C_PA16_EBI1_D16 ((unsigned int) AT91C_PIO_PA16) /*  */
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PA17_MCI0_DB0 ((unsigned int) AT91C_PIO_PA17) /*  */
#define AT91C_PA17_EBI1_D17 ((unsigned int) AT91C_PIO_PA17) /*  */
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PA18_MCI0_DB1 ((unsigned int) AT91C_PIO_PA18) /*  */
#define AT91C_PA18_EBI1_D18 ((unsigned int) AT91C_PIO_PA18) /*  */
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PA19_MCI0_DB2 ((unsigned int) AT91C_PIO_PA19) /*  */
#define AT91C_PA19_EBI1_D19 ((unsigned int) AT91C_PIO_PA19) /*  */
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PA2_UNCONNECTED_PA2_A ((unsigned int) AT91C_PIO_PA2) /*  */
#define AT91C_PA2_SPI0_SPCK ((unsigned int) AT91C_PIO_PA2) /*  */
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PA20_MCI0_DB3 ((unsigned int) AT91C_PIO_PA20) /*  */
#define AT91C_PA20_EBI1_D20 ((unsigned int) AT91C_PIO_PA20) /*  */
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PA21_MCI1_CDB ((unsigned int) AT91C_PIO_PA21) /*  */
#define AT91C_PA21_EBI1_D21 ((unsigned int) AT91C_PIO_PA21) /*  */
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PA22_MCI1_DB0 ((unsigned int) AT91C_PIO_PA22) /*  */
#define AT91C_PA22_EBI1_D22 ((unsigned int) AT91C_PIO_PA22) /*  */
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PA23_MCI1_DB1 ((unsigned int) AT91C_PIO_PA23) /*  */
#define AT91C_PA23_EBI1_D23 ((unsigned int) AT91C_PIO_PA23) /*  */
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PA24_MCI1_DB2 ((unsigned int) AT91C_PIO_PA24) /*  */
#define AT91C_PA24_EBI1_D24 ((unsigned int) AT91C_PIO_PA24) /*  */
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PA25_MCI1_DB3 ((unsigned int) AT91C_PIO_PA25) /*  */
#define AT91C_PA25_EBI1_D25 ((unsigned int) AT91C_PIO_PA25) /*  */
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) /* Pin Controlled by PA26*/
#define AT91C_PA26_TXD0     ((unsigned int) AT91C_PIO_PA26) /*  */
#define AT91C_PA26_EBI1_D26 ((unsigned int) AT91C_PIO_PA26) /*  */
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) /* Pin Controlled by PA27*/
#define AT91C_PA27_RXD0     ((unsigned int) AT91C_PIO_PA27) /*  */
#define AT91C_PA27_EBI1_D27 ((unsigned int) AT91C_PIO_PA27) /*  */
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) /* Pin Controlled by PA28*/
#define AT91C_PA28_RTS0     ((unsigned int) AT91C_PIO_PA28) /*  */
#define AT91C_PA28_EBI1_D28 ((unsigned int) AT91C_PIO_PA28) /*  */
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) /* Pin Controlled by PA29*/
#define AT91C_PA29_CTS0     ((unsigned int) AT91C_PIO_PA29) /*  */
#define AT91C_PA29_EBI1_D29 ((unsigned int) AT91C_PIO_PA29) /*  */
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PA3_MCI0_DA1 ((unsigned int) AT91C_PIO_PA3) /*  */
#define AT91C_PA3_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA3) /*  */
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) /* Pin Controlled by PA30*/
#define AT91C_PA30_SCK0     ((unsigned int) AT91C_PIO_PA30) /*  */
#define AT91C_PA30_EBI1_D30 ((unsigned int) AT91C_PIO_PA30) /*  */
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) /* Pin Controlled by PA31*/
#define AT91C_PA31_DMARQ0   ((unsigned int) AT91C_PIO_PA31) /*  */
#define AT91C_PA31_EBI1_D31 ((unsigned int) AT91C_PIO_PA31) /*  */
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PA4_MCI0_DA2 ((unsigned int) AT91C_PIO_PA4) /*  */
#define AT91C_PA4_SPI0_NPCS2A ((unsigned int) AT91C_PIO_PA4) /*  */
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PA5_MCI0_DA3 ((unsigned int) AT91C_PIO_PA5) /*  */
#define AT91C_PA5_SPI0_NPCS0 ((unsigned int) AT91C_PIO_PA5) /*  */
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PA6_MCI1_CK  ((unsigned int) AT91C_PIO_PA6) /*  */
#define AT91C_PA6_PCK2     ((unsigned int) AT91C_PIO_PA6) /*  */
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PA7_MCI1_CDA ((unsigned int) AT91C_PIO_PA7) /*  */
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PA8_MCI1_DA0 ((unsigned int) AT91C_PIO_PA8) /*  */
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PA9_MCI1_DA1 ((unsigned int) AT91C_PIO_PA9) /*  */
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) /* Pin Controlled by PB0*/
#define AT91C_PB0_AC97FS   ((unsigned int) AT91C_PIO_PB0) /*  */
#define AT91C_PB0_TF0      ((unsigned int) AT91C_PIO_PB0) /*  */
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) /* Pin Controlled by PB1*/
#define AT91C_PB1_AC97CK   ((unsigned int) AT91C_PIO_PB1) /*  */
#define AT91C_PB1_TK0      ((unsigned int) AT91C_PIO_PB1) /*  */
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) /* Pin Controlled by PB10*/
#define AT91C_PB10_RK1      ((unsigned int) AT91C_PIO_PB10) /*  */
#define AT91C_PB10_PCK1     ((unsigned int) AT91C_PIO_PB10) /*  */
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) /* Pin Controlled by PB11*/
#define AT91C_PB11_RF1      ((unsigned int) AT91C_PIO_PB11) /*  */
#define AT91C_PB11_SPI0_NPCS3B ((unsigned int) AT91C_PIO_PB11) /*  */
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) /* Pin Controlled by PB12*/
#define AT91C_PB12_SPI1_MISO ((unsigned int) AT91C_PIO_PB12) /*  */
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) /* Pin Controlled by PB13*/
#define AT91C_PB13_SPI1_MOSI ((unsigned int) AT91C_PIO_PB13) /*  */
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) /* Pin Controlled by PB14*/
#define AT91C_PB14_SPI1_SPCK ((unsigned int) AT91C_PIO_PB14) /*  */
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) /* Pin Controlled by PB15*/
#define AT91C_PB15_SPI1_NPCS0 ((unsigned int) AT91C_PIO_PB15) /*  */
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) /* Pin Controlled by PB16*/
#define AT91C_PB16_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PB16) /*  */
#define AT91C_PB16_PCK1     ((unsigned int) AT91C_PIO_PB16) /*  */
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) /* Pin Controlled by PB17*/
#define AT91C_PB17_SPI1_NPCS2B ((unsigned int) AT91C_PIO_PB17) /*  */
#define AT91C_PB17_TIOA2    ((unsigned int) AT91C_PIO_PB17) /*  */
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) /* Pin Controlled by PB18*/
#define AT91C_PB18_SPI1_NPCS3B ((unsigned int) AT91C_PIO_PB18) /*  */
#define AT91C_PB18_TIOB2    ((unsigned int) AT91C_PIO_PB18) /*  */
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) /* Pin Controlled by PB19*/
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) /* Pin Controlled by PB2*/
#define AT91C_PB2_AC97TX   ((unsigned int) AT91C_PIO_PB2) /*  */
#define AT91C_PB2_TD0      ((unsigned int) AT91C_PIO_PB2) /*  */
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) /* Pin Controlled by PB20*/
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) /* Pin Controlled by PB21*/
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) /* Pin Controlled by PB22*/
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) /* Pin Controlled by PB23*/
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) /* Pin Controlled by PB24*/
#define AT91C_PB24_UNCONNECTED_PB24_A ((unsigned int) AT91C_PIO_PB24) /*  */
#define AT91C_PB24_DMARQ3   ((unsigned int) AT91C_PIO_PB24) /*  */
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) /* Pin Controlled by PB25*/
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) /* Pin Controlled by PB26*/
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) /* Pin Controlled by PB27*/
#define AT91C_PB27_UNCONNECTED_PB27_A ((unsigned int) AT91C_PIO_PB27) /*  */
#define AT91C_PB27_PWM2     ((unsigned int) AT91C_PIO_PB27) /*  */
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) /* Pin Controlled by PB28*/
#define AT91C_PB28_UNCONNECTED_PB28_A ((unsigned int) AT91C_PIO_PB28) /*  */
#define AT91C_PB28_TCLK0    ((unsigned int) AT91C_PIO_PB28) /*  */
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) /* Pin Controlled by PB29*/
#define AT91C_PB29_UNCONNECTED_PB29_A ((unsigned int) AT91C_PIO_PB29) /*  */
#define AT91C_PB29_PWM3     ((unsigned int) AT91C_PIO_PB29) /*  */
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) /* Pin Controlled by PB3*/
#define AT91C_PB3_AC97RX   ((unsigned int) AT91C_PIO_PB3) /*  */
#define AT91C_PB3_RD0      ((unsigned int) AT91C_PIO_PB3) /*  */
#define AT91C_PIO_PB30       ((unsigned int) 1 << 30) /* Pin Controlled by PB30*/
#define AT91C_PIO_PB31       ((unsigned int) 1 << 31) /* Pin Controlled by PB31*/
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) /* Pin Controlled by PB4*/
#define AT91C_PB4_TWD      ((unsigned int) AT91C_PIO_PB4) /*  */
#define AT91C_PB4_RK0      ((unsigned int) AT91C_PIO_PB4) /*  */
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) /* Pin Controlled by PB5*/
#define AT91C_PB5_TWCK     ((unsigned int) AT91C_PIO_PB5) /*  */
#define AT91C_PB5_RF0      ((unsigned int) AT91C_PIO_PB5) /*  */
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) /* Pin Controlled by PB6*/
#define AT91C_PB6_TF1      ((unsigned int) AT91C_PIO_PB6) /*  */
#define AT91C_PB6_DMARQ1   ((unsigned int) AT91C_PIO_PB6) /*  */
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) /* Pin Controlled by PB7*/
#define AT91C_PB7_TK1      ((unsigned int) AT91C_PIO_PB7) /*  */
#define AT91C_PB7_PWM0     ((unsigned int) AT91C_PIO_PB7) /*  */
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) /* Pin Controlled by PB8*/
#define AT91C_PB8_TD1      ((unsigned int) AT91C_PIO_PB8) /*  */
#define AT91C_PB8_PWM1     ((unsigned int) AT91C_PIO_PB8) /*  */
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) /* Pin Controlled by PB9*/
#define AT91C_PB9_RD1      ((unsigned int) AT91C_PIO_PB9) /*  */
#define AT91C_PB9_LCDCC    ((unsigned int) AT91C_PIO_PB9) /*  */
#define AT91C_PIO_PC0        ((unsigned int) 1 <<  0) /* Pin Controlled by PC0*/
#define AT91C_PC0_LCDVSYNC ((unsigned int) AT91C_PIO_PC0) /*  */
#define AT91C_PIO_PC1        ((unsigned int) 1 <<  1) /* Pin Controlled by PC1*/
#define AT91C_PC1_LCDHSYNC ((unsigned int) AT91C_PIO_PC1) /*  */
#define AT91C_PIO_PC10       ((unsigned int) 1 << 10) /* Pin Controlled by PC10*/
#define AT91C_PC10_LCDD6    ((unsigned int) AT91C_PIO_PC10) /*  */
#define AT91C_PC10_LCDD11B  ((unsigned int) AT91C_PIO_PC10) /*  */
#define AT91C_PIO_PC11       ((unsigned int) 1 << 11) /* Pin Controlled by PC11*/
#define AT91C_PC11_LCDD7    ((unsigned int) AT91C_PIO_PC11) /*  */
#define AT91C_PC11_LCDD12B  ((unsigned int) AT91C_PIO_PC11) /*  */
#define AT91C_PIO_PC12       ((unsigned int) 1 << 12) /* Pin Controlled by PC12*/
#define AT91C_PC12_LCDD8    ((unsigned int) AT91C_PIO_PC12) /*  */
#define AT91C_PC12_LCDD13B  ((unsigned int) AT91C_PIO_PC12) /*  */
#define AT91C_PIO_PC13       ((unsigned int) 1 << 13) /* Pin Controlled by PC13*/
#define AT91C_PC13_LCDD9    ((unsigned int) AT91C_PIO_PC13) /*  */
#define AT91C_PC13_LCDD14B  ((unsigned int) AT91C_PIO_PC13) /*  */
#define AT91C_PIO_PC14       ((unsigned int) 1 << 14) /* Pin Controlled by PC14*/
#define AT91C_PC14_LCDD10   ((unsigned int) AT91C_PIO_PC14) /*  */
#define AT91C_PC14_LCDD15B  ((unsigned int) AT91C_PIO_PC14) /*  */
#define AT91C_PIO_PC15       ((unsigned int) 1 << 15) /* Pin Controlled by PC15*/
#define AT91C_PC15_LCDD11   ((unsigned int) AT91C_PIO_PC15) /*  */
#define AT91C_PC15_LCDD19B  ((unsigned int) AT91C_PIO_PC15) /*  */
#define AT91C_PIO_PC16       ((unsigned int) 1 << 16) /* Pin Controlled by PC16*/
#define AT91C_PC16_LCDD12   ((unsigned int) AT91C_PIO_PC16) /*  */
#define AT91C_PC16_LCDD20B  ((unsigned int) AT91C_PIO_PC16) /*  */
#define AT91C_PIO_PC17       ((unsigned int) 1 << 17) /* Pin Controlled by PC17*/
#define AT91C_PC17_LCDD13   ((unsigned int) AT91C_PIO_PC17) /*  */
#define AT91C_PC17_LCDD21B  ((unsigned int) AT91C_PIO_PC17) /*  */
#define AT91C_PIO_PC18       ((unsigned int) 1 << 18) /* Pin Controlled by PC18*/
#define AT91C_PC18_LCDD14   ((unsigned int) AT91C_PIO_PC18) /*  */
#define AT91C_PC18_LCDD22B  ((unsigned int) AT91C_PIO_PC18) /*  */
#define AT91C_PIO_PC19       ((unsigned int) 1 << 19) /* Pin Controlled by PC19*/
#define AT91C_PC19_LCDD15   ((unsigned int) AT91C_PIO_PC19) /*  */
#define AT91C_PC19_LCDD23B  ((unsigned int) AT91C_PIO_PC19) /*  */
#define AT91C_PIO_PC2        ((unsigned int) 1 <<  2) /* Pin Controlled by PC2*/
#define AT91C_PC2_LCDDOTCK ((unsigned int) AT91C_PIO_PC2) /*  */
#define AT91C_PIO_PC20       ((unsigned int) 1 << 20) /* Pin Controlled by PC20*/
#define AT91C_PC20_LCDD16   ((unsigned int) AT91C_PIO_PC20) /*  */
#define AT91C_PC20_ETX2     ((unsigned int) AT91C_PIO_PC20) /*  */
#define AT91C_PIO_PC21       ((unsigned int) 1 << 21) /* Pin Controlled by PC21*/
#define AT91C_PC21_LCDD17   ((unsigned int) AT91C_PIO_PC21) /*  */
#define AT91C_PC21_ETX3     ((unsigned int) AT91C_PIO_PC21) /*  */
#define AT91C_PIO_PC22       ((unsigned int) 1 << 22) /* Pin Controlled by PC22*/
#define AT91C_PC22_LCDD18   ((unsigned int) AT91C_PIO_PC22) /*  */
#define AT91C_PC22_ERX2     ((unsigned int) AT91C_PIO_PC22) /*  */
#define AT91C_PIO_PC23       ((unsigned int) 1 << 23) /* Pin Controlled by PC23*/
#define AT91C_PC23_LCDD19   ((unsigned int) AT91C_PIO_PC23) /*  */
#define AT91C_PC23_ERX3     ((unsigned int) AT91C_PIO_PC23) /*  */
#define AT91C_PIO_PC24       ((unsigned int) 1 << 24) /* Pin Controlled by PC24*/
#define AT91C_PC24_LCDD20   ((unsigned int) AT91C_PIO_PC24) /*  */
#define AT91C_PC24_ETXER    ((unsigned int) AT91C_PIO_PC24) /*  */
#define AT91C_PIO_PC25       ((unsigned int) 1 << 25) /* Pin Controlled by PC25*/
#define AT91C_PC25_LCDD21   ((unsigned int) AT91C_PIO_PC25) /*  */
#define AT91C_PC25_ERXDV    ((unsigned int) AT91C_PIO_PC25) /*  */
#define AT91C_PIO_PC26       ((unsigned int) 1 << 26) /* Pin Controlled by PC26*/
#define AT91C_PC26_LCDD22   ((unsigned int) AT91C_PIO_PC26) /*  */
#define AT91C_PC26_ECOL     ((unsigned int) AT91C_PIO_PC26) /*  */
#define AT91C_PIO_PC27       ((unsigned int) 1 << 27) /* Pin Controlled by PC27*/
#define AT91C_PC27_LCDD23   ((unsigned int) AT91C_PIO_PC27) /*  */
#define AT91C_PC27_ERXCK    ((unsigned int) AT91C_PIO_PC27) /*  */
#define AT91C_PIO_PC28       ((unsigned int) 1 << 28) /* Pin Controlled by PC28*/
#define AT91C_PC28_PWM0     ((unsigned int) AT91C_PIO_PC28) /*  */
#define AT91C_PC28_TCLK1    ((unsigned int) AT91C_PIO_PC28) /*  */
#define AT91C_PIO_PC29       ((unsigned int) 1 << 29) /* Pin Controlled by PC29*/
#define AT91C_PC29_PCK0     ((unsigned int) AT91C_PIO_PC29) /*  */
#define AT91C_PC29_PWM2     ((unsigned int) AT91C_PIO_PC29) /*  */
#define AT91C_PIO_PC3        ((unsigned int) 1 <<  3) /* Pin Controlled by PC3*/
#define AT91C_PC3_LCDEN    ((unsigned int) AT91C_PIO_PC3) /*  */
#define AT91C_PC3_PWM1     ((unsigned int) AT91C_PIO_PC3) /*  */
#define AT91C_PIO_PC30       ((unsigned int) 1 << 30) /* Pin Controlled by PC30*/
#define AT91C_PC30_DRXD     ((unsigned int) AT91C_PIO_PC30) /*  */
#define AT91C_PIO_PC31       ((unsigned int) 1 << 31) /* Pin Controlled by PC31*/
#define AT91C_PC31_DTXD     ((unsigned int) AT91C_PIO_PC31) /*  */
#define AT91C_PIO_PC4        ((unsigned int) 1 <<  4) /* Pin Controlled by PC4*/
#define AT91C_PC4_LCDD0    ((unsigned int) AT91C_PIO_PC4) /*  */
#define AT91C_PC4_LCDD3B   ((unsigned int) AT91C_PIO_PC4) /*  */
#define AT91C_PIO_PC5        ((unsigned int) 1 <<  5) /* Pin Controlled by PC5*/
#define AT91C_PC5_LCDD1    ((unsigned int) AT91C_PIO_PC5) /*  */
#define AT91C_PC5_LCDD4B   ((unsigned int) AT91C_PIO_PC5) /*  */
#define AT91C_PIO_PC6        ((unsigned int) 1 <<  6) /* Pin Controlled by PC6*/
#define AT91C_PC6_LCDD2    ((unsigned int) AT91C_PIO_PC6) /*  */
#define AT91C_PC6_LCDD5B   ((unsigned int) AT91C_PIO_PC6) /*  */
#define AT91C_PIO_PC7        ((unsigned int) 1 <<  7) /* Pin Controlled by PC7*/
#define AT91C_PC7_LCDD3    ((unsigned int) AT91C_PIO_PC7) /*  */
#define AT91C_PC7_LCDD6B   ((unsigned int) AT91C_PIO_PC7) /*  */
#define AT91C_PIO_PC8        ((unsigned int) 1 <<  8) /* Pin Controlled by PC8*/
#define AT91C_PC8_LCDD4    ((unsigned int) AT91C_PIO_PC8) /*  */
#define AT91C_PC8_LCDD7B   ((unsigned int) AT91C_PIO_PC8) /*  */
#define AT91C_PIO_PC9        ((unsigned int) 1 <<  9) /* Pin Controlled by PC9*/
#define AT91C_PC9_LCDD5    ((unsigned int) AT91C_PIO_PC9) /*  */
#define AT91C_PC9_LCDD10B  ((unsigned int) AT91C_PIO_PC9) /*  */
#define AT91C_PIO_PD0        ((unsigned int) 1 <<  0) /* Pin Controlled by PD0*/
#define AT91C_PD0_TXD1     ((unsigned int) AT91C_PIO_PD0) /*  */
#define AT91C_PD0_SPI0_NPCS2D ((unsigned int) AT91C_PIO_PD0) /*  */
#define AT91C_PIO_PD1        ((unsigned int) 1 <<  1) /* Pin Controlled by PD1*/
#define AT91C_PD1_RXD1     ((unsigned int) AT91C_PIO_PD1) /*  */
#define AT91C_PD1_SPI0_NPCS3D ((unsigned int) AT91C_PIO_PD1) /*  */
#define AT91C_PIO_PD10       ((unsigned int) 1 << 10) /* Pin Controlled by PD10*/
#define AT91C_PD10_UNCONNECTED_PD10_A ((unsigned int) AT91C_PIO_PD10) /*  */
#define AT91C_PD10_SCK1     ((unsigned int) AT91C_PIO_PD10) /*  */
#define AT91C_PIO_PD11       ((unsigned int) 1 << 11) /* Pin Controlled by PD11*/
#define AT91C_PD11_EBI0_NCS2 ((unsigned int) AT91C_PIO_PD11) /*  */
#define AT91C_PD11_TSYNC    ((unsigned int) AT91C_PIO_PD11) /*  */
#define AT91C_PIO_PD12       ((unsigned int) 1 << 12) /* Pin Controlled by PD12*/
#define AT91C_PD12_EBI0_A23 ((unsigned int) AT91C_PIO_PD12) /*  */
#define AT91C_PD12_TCLK     ((unsigned int) AT91C_PIO_PD12) /*  */
#define AT91C_PIO_PD13       ((unsigned int) 1 << 13) /* Pin Controlled by PD13*/
#define AT91C_PD13_EBI0_A24 ((unsigned int) AT91C_PIO_PD13) /*  */
#define AT91C_PD13_TPS0     ((unsigned int) AT91C_PIO_PD13) /*  */
#define AT91C_PIO_PD14       ((unsigned int) 1 << 14) /* Pin Controlled by PD14*/
#define AT91C_PD14_EBI0_A25_CFNRW ((unsigned int) AT91C_PIO_PD14) /*  */
#define AT91C_PD14_TPS1     ((unsigned int) AT91C_PIO_PD14) /*  */
#define AT91C_PIO_PD15       ((unsigned int) 1 << 15) /* Pin Controlled by PD15*/
#define AT91C_PD15_EBI0_NCS3_NANDCS ((unsigned int) AT91C_PIO_PD15) /*  */
#define AT91C_PD15_TPS2     ((unsigned int) AT91C_PIO_PD15) /*  */
#define AT91C_PIO_PD16       ((unsigned int) 1 << 16) /* Pin Controlled by PD16*/
#define AT91C_PD16_EBI0_D16 ((unsigned int) AT91C_PIO_PD16) /*  */
#define AT91C_PD16_TPK0     ((unsigned int) AT91C_PIO_PD16) /*  */
#define AT91C_PIO_PD17       ((unsigned int) 1 << 17) /* Pin Controlled by PD17*/
#define AT91C_PD17_EBI0_D17 ((unsigned int) AT91C_PIO_PD17) /*  */
#define AT91C_PD17_TPK1     ((unsigned int) AT91C_PIO_PD17) /*  */
#define AT91C_PIO_PD18       ((unsigned int) 1 << 18) /* Pin Controlled by PD18*/
#define AT91C_PD18_EBI0_D18 ((unsigned int) AT91C_PIO_PD18) /*  */
#define AT91C_PD18_TPK2     ((unsigned int) AT91C_PIO_PD18) /*  */
#define AT91C_PIO_PD19       ((unsigned int) 1 << 19) /* Pin Controlled by PD19*/
#define AT91C_PD19_EBI0_D19 ((unsigned int) AT91C_PIO_PD19) /*  */
#define AT91C_PD19_TPK3     ((unsigned int) AT91C_PIO_PD19) /*  */
#define AT91C_PIO_PD2        ((unsigned int) 1 <<  2) /* Pin Controlled by PD2*/
#define AT91C_PD2_TXD2     ((unsigned int) AT91C_PIO_PD2) /*  */
#define AT91C_PD2_SPI1_NPCS2D ((unsigned int) AT91C_PIO_PD2) /*  */
#define AT91C_PIO_PD20       ((unsigned int) 1 << 20) /* Pin Controlled by PD20*/
#define AT91C_PD20_EBI0_D20 ((unsigned int) AT91C_PIO_PD20) /*  */
#define AT91C_PD20_TPK4     ((unsigned int) AT91C_PIO_PD20) /*  */
#define AT91C_PIO_PD21       ((unsigned int) 1 << 21) /* Pin Controlled by PD21*/
#define AT91C_PD21_EBI0_D21 ((unsigned int) AT91C_PIO_PD21) /*  */
#define AT91C_PD21_TPK5     ((unsigned int) AT91C_PIO_PD21) /*  */
#define AT91C_PIO_PD22       ((unsigned int) 1 << 22) /* Pin Controlled by PD22*/
#define AT91C_PD22_EBI0_D22 ((unsigned int) AT91C_PIO_PD22) /*  */
#define AT91C_PD22_TPK6     ((unsigned int) AT91C_PIO_PD22) /*  */
#define AT91C_PIO_PD23       ((unsigned int) 1 << 23) /* Pin Controlled by PD23*/
#define AT91C_PD23_EBI0_D23 ((unsigned int) AT91C_PIO_PD23) /*  */
#define AT91C_PD23_TPK7     ((unsigned int) AT91C_PIO_PD23) /*  */
#define AT91C_PIO_PD24       ((unsigned int) 1 << 24) /* Pin Controlled by PD24*/
#define AT91C_PD24_EBI0_D24 ((unsigned int) AT91C_PIO_PD24) /*  */
#define AT91C_PD24_TPK8     ((unsigned int) AT91C_PIO_PD24) /*  */
#define AT91C_PIO_PD25       ((unsigned int) 1 << 25) /* Pin Controlled by PD25*/
#define AT91C_PD25_EBI0_D25 ((unsigned int) AT91C_PIO_PD25) /*  */
#define AT91C_PD25_TPK9     ((unsigned int) AT91C_PIO_PD25) /*  */
#define AT91C_PIO_PD26       ((unsigned int) 1 << 26) /* Pin Controlled by PD26*/
#define AT91C_PD26_EBI0_D26 ((unsigned int) AT91C_PIO_PD26) /*  */
#define AT91C_PD26_TPK10    ((unsigned int) AT91C_PIO_PD26) /*  */
#define AT91C_PIO_PD27       ((unsigned int) 1 << 27) /* Pin Controlled by PD27*/
#define AT91C_PD27_EBI0_D27 ((unsigned int) AT91C_PIO_PD27) /*  */
#define AT91C_PD27_TPK11    ((unsigned int) AT91C_PIO_PD27) /*  */
#define AT91C_PIO_PD28       ((unsigned int) 1 << 28) /* Pin Controlled by PD28*/
#define AT91C_PD28_EBI0_D28 ((unsigned int) AT91C_PIO_PD28) /*  */
#define AT91C_PD28_TPK12    ((unsigned int) AT91C_PIO_PD28) /*  */
#define AT91C_PIO_PD29       ((unsigned int) 1 << 29) /* Pin Controlled by PD29*/
#define AT91C_PD29_EBI0_D29 ((unsigned int) AT91C_PIO_PD29) /*  */
#define AT91C_PD29_TPK13    ((unsigned int) AT91C_PIO_PD29) /*  */
