una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
#define AT91C_PIO_PD3        ((unsigned int) 1 <<  3) /* Pin Controlled by PD3*/
#define AT91C_PD3_RXD2     ((unsigned int) AT91C_PIO_PD3) /*  */
#define AT91C_PD3_SPI1_NPCS3D ((unsigned int) AT91C_PIO_PD3) /*  */
#define AT91C_PIO_PD30       ((unsigned int) 1 << 30) /* Pin Controlled by PD30*/
#define AT91C_PD30_EBI0_D30 ((unsigned int) AT91C_PIO_PD30) /*  */
#define AT91C_PD30_TPK14    ((unsigned int) AT91C_PIO_PD30) /*  */
#define AT91C_PIO_PD31       ((unsigned int) 1 << 31) /* Pin Controlled by PD31*/
#define AT91C_PD31_EBI0_D31 ((unsigned int) AT91C_PIO_PD31) /*  */
#define AT91C_PD31_TPK15    ((unsigned int) AT91C_PIO_PD31) /*  */
#define AT91C_PIO_PD4        ((unsigned int) 1 <<  4) /* Pin Controlled by PD4*/
#define AT91C_PD4_FIQ      ((unsigned int) AT91C_PIO_PD4) /*  */
#define AT91C_PD4_DMARQ2   ((unsigned int) AT91C_PIO_PD4) /*  */
#define AT91C_PIO_PD5        ((unsigned int) 1 <<  5) /* Pin Controlled by PD5*/
#define AT91C_PD5_EBI0_NWAIT ((unsigned int) AT91C_PIO_PD5) /*  */
#define AT91C_PD5_RTS2     ((unsigned int) AT91C_PIO_PD5) /*  */
#define AT91C_PIO_PD6        ((unsigned int) 1 <<  6) /* Pin Controlled by PD6*/
#define AT91C_PD6_EBI0_NCS4_CFCS0 ((unsigned int) AT91C_PIO_PD6) /*  */
#define AT91C_PD6_CTS2     ((unsigned int) AT91C_PIO_PD6) /*  */
#define AT91C_PIO_PD7        ((unsigned int) 1 <<  7) /* Pin Controlled by PD7*/
#define AT91C_PD7_EBI0_NCS5_CFCS1 ((unsigned int) AT91C_PIO_PD7) /*  */
#define AT91C_PD7_RTS1     ((unsigned int) AT91C_PIO_PD7) /*  */
#define AT91C_PIO_PD8        ((unsigned int) 1 <<  8) /* Pin Controlled by PD8*/
#define AT91C_PD8_EBI0_CFCE1 ((unsigned int) AT91C_PIO_PD8) /*  */
#define AT91C_PD8_CTS1     ((unsigned int) AT91C_PIO_PD8) /*  */
#define AT91C_PIO_PD9        ((unsigned int) 1 <<  9) /* Pin Controlled by PD9*/
#define AT91C_PD9_EBI0_CFCE2 ((unsigned int) AT91C_PIO_PD9) /*  */
#define AT91C_PD9_SCK2     ((unsigned int) AT91C_PIO_PD9) /*  */
#define AT91C_PIO_PE0        ((unsigned int) 1 <<  0) /* Pin Controlled by PE0*/
#define AT91C_PE0_ISI_D0   ((unsigned int) AT91C_PIO_PE0) /*  */
#define AT91C_PIO_PE1        ((unsigned int) 1 <<  1) /* Pin Controlled by PE1*/
#define AT91C_PE1_ISI_D1   ((unsigned int) AT91C_PIO_PE1) /*  */
#define AT91C_PIO_PE10       ((unsigned int) 1 << 10) /* Pin Controlled by PE10*/
#define AT91C_PE10_ISI_VSYNC ((unsigned int) AT91C_PIO_PE10) /*  */
#define AT91C_PE10_PWM3     ((unsigned int) AT91C_PIO_PE10) /*  */
#define AT91C_PIO_PE11       ((unsigned int) 1 << 11) /* Pin Controlled by PE11*/
#define AT91C_PE11_ISI_MCK  ((unsigned int) AT91C_PIO_PE11) /*  */
#define AT91C_PE11_PCK3     ((unsigned int) AT91C_PIO_PE11) /*  */
#define AT91C_PIO_PE12       ((unsigned int) 1 << 12) /* Pin Controlled by PE12*/
#define AT91C_PE12_KBDR0    ((unsigned int) AT91C_PIO_PE12) /*  */
#define AT91C_PE12_ISI_D8   ((unsigned int) AT91C_PIO_PE12) /*  */
#define AT91C_PIO_PE13       ((unsigned int) 1 << 13) /* Pin Controlled by PE13*/
#define AT91C_PE13_KBDR1    ((unsigned int) AT91C_PIO_PE13) /*  */
#define AT91C_PE13_ISI_D9   ((unsigned int) AT91C_PIO_PE13) /*  */
#define AT91C_PIO_PE14       ((unsigned int) 1 << 14) /* Pin Controlled by PE14*/
#define AT91C_PE14_KBDR2    ((unsigned int) AT91C_PIO_PE14) /*  */
#define AT91C_PE14_ISI_D10  ((unsigned int) AT91C_PIO_PE14) /*  */
#define AT91C_PIO_PE15       ((unsigned int) 1 << 15) /* Pin Controlled by PE15*/
#define AT91C_PE15_KBDR3    ((unsigned int) AT91C_PIO_PE15) /*  */
#define AT91C_PE15_ISI_D11  ((unsigned int) AT91C_PIO_PE15) /*  */
#define AT91C_PIO_PE16       ((unsigned int) 1 << 16) /* Pin Controlled by PE16*/
#define AT91C_PE16_KBDR4    ((unsigned int) AT91C_PIO_PE16) /*  */
#define AT91C_PIO_PE17       ((unsigned int) 1 << 17) /* Pin Controlled by PE17*/
#define AT91C_PE17_KBDC0    ((unsigned int) AT91C_PIO_PE17) /*  */
#define AT91C_PIO_PE18       ((unsigned int) 1 << 18) /* Pin Controlled by PE18*/
#define AT91C_PE18_KBDC1    ((unsigned int) AT91C_PIO_PE18) /*  */
#define AT91C_PE18_TIOA0    ((unsigned int) AT91C_PIO_PE18) /*  */
#define AT91C_PIO_PE19       ((unsigned int) 1 << 19) /* Pin Controlled by PE19*/
#define AT91C_PE19_KBDC2    ((unsigned int) AT91C_PIO_PE19) /*  */
#define AT91C_PE19_TIOB0    ((unsigned int) AT91C_PIO_PE19) /*  */
#define AT91C_PIO_PE2        ((unsigned int) 1 <<  2) /* Pin Controlled by PE2*/
#define AT91C_PE2_ISI_D2   ((unsigned int) AT91C_PIO_PE2) /*  */
#define AT91C_PIO_PE20       ((unsigned int) 1 << 20) /* Pin Controlled by PE20*/
#define AT91C_PE20_KBDC3    ((unsigned int) AT91C_PIO_PE20) /*  */
#define AT91C_PE20_EBI1_NWAIT ((unsigned int) AT91C_PIO_PE20) /*  */
#define AT91C_PIO_PE21       ((unsigned int) 1 << 21) /* Pin Controlled by PE21*/
#define AT91C_PE21_ETXCK    ((unsigned int) AT91C_PIO_PE21) /*  */
#define AT91C_PE21_EBI1_NANDWE ((unsigned int) AT91C_PIO_PE21) /*  */
#define AT91C_PIO_PE22       ((unsigned int) 1 << 22) /* Pin Controlled by PE22*/
#define AT91C_PE22_ECRS     ((unsigned int) AT91C_PIO_PE22) /*  */
#define AT91C_PE22_EBI1_NCS2_NANDCS ((unsigned int) AT91C_PIO_PE22) /*  */
#define AT91C_PIO_PE23       ((unsigned int) 1 << 23) /* Pin Controlled by PE23*/
#define AT91C_PE23_ETX0     ((unsigned int) AT91C_PIO_PE23) /*  */
#define AT91C_PE23_EBI1_NANDOE ((unsigned int) AT91C_PIO_PE23) /*  */
#define AT91C_PIO_PE24       ((unsigned int) 1 << 24) /* Pin Controlled by PE24*/
#define AT91C_PE24_ETX1     ((unsigned int) AT91C_PIO_PE24) /*  */
#define AT91C_PE24_EBI1_NWR3_NBS3 ((unsigned int) AT91C_PIO_PE24) /*  */
#define AT91C_PIO_PE25       ((unsigned int) 1 << 25) /* Pin Controlled by PE25*/
#define AT91C_PE25_ERX0     ((unsigned int) AT91C_PIO_PE25) /*  */
#define AT91C_PE25_EBI1_NCS1_SDCS ((unsigned int) AT91C_PIO_PE25) /*  */
#define AT91C_PIO_PE26       ((unsigned int) 1 << 26) /* Pin Controlled by PE26*/
#define AT91C_PE26_ERX1     ((unsigned int) AT91C_PIO_PE26) /*  */
#define AT91C_PIO_PE27       ((unsigned int) 1 << 27) /* Pin Controlled by PE27*/
#define AT91C_PE27_ERXER    ((unsigned int) AT91C_PIO_PE27) /*  */
#define AT91C_PE27_EBI1_SDCKE ((unsigned int) AT91C_PIO_PE27) /*  */
#define AT91C_PIO_PE28       ((unsigned int) 1 << 28) /* Pin Controlled by PE28*/
#define AT91C_PE28_ETXEN    ((unsigned int) AT91C_PIO_PE28) /*  */
#define AT91C_PE28_EBI1_RAS ((unsigned int) AT91C_PIO_PE28) /*  */
#define AT91C_PIO_PE29       ((unsigned int) 1 << 29) /* Pin Controlled by PE29*/
#define AT91C_PE29_EMDC     ((unsigned int) AT91C_PIO_PE29) /*  */
#define AT91C_PE29_EBI1_CAS ((unsigned int) AT91C_PIO_PE29) /*  */
#define AT91C_PIO_PE3        ((unsigned int) 1 <<  3) /* Pin Controlled by PE3*/
#define AT91C_PE3_ISI_D3   ((unsigned int) AT91C_PIO_PE3) /*  */
#define AT91C_PIO_PE30       ((unsigned int) 1 << 30) /* Pin Controlled by PE30*/
#define AT91C_PE30_EMDIO    ((unsigned int) AT91C_PIO_PE30) /*  */
#define AT91C_PE30_EBI1_SDWE ((unsigned int) AT91C_PIO_PE30) /*  */
#define AT91C_PIO_PE31       ((unsigned int) 1 << 31) /* Pin Controlled by PE31*/
#define AT91C_PE31_EF100    ((unsigned int) AT91C_PIO_PE31) /*  */
#define AT91C_PE31_EBI1_SDA10 ((unsigned int) AT91C_PIO_PE31) /*  */
#define AT91C_PIO_PE4        ((unsigned int) 1 <<  4) /* Pin Controlled by PE4*/
#define AT91C_PE4_ISI_D4   ((unsigned int) AT91C_PIO_PE4) /*  */
#define AT91C_PIO_PE5        ((unsigned int) 1 <<  5) /* Pin Controlled by PE5*/
#define AT91C_PE5_ISI_D5   ((unsigned int) AT91C_PIO_PE5) /*  */
#define AT91C_PIO_PE6        ((unsigned int) 1 <<  6) /* Pin Controlled by PE6*/
#define AT91C_PE6_ISI_D6   ((unsigned int) AT91C_PIO_PE6) /*  */
#define AT91C_PIO_PE7        ((unsigned int) 1 <<  7) /* Pin Controlled by PE7*/
#define AT91C_PE7_ISI_D7   ((unsigned int) AT91C_PIO_PE7) /*  */
#define AT91C_PIO_PE8        ((unsigned int) 1 <<  8) /* Pin Controlled by PE8*/
#define AT91C_PE8_ISI_PCK  ((unsigned int) AT91C_PIO_PE8) /*  */
#define AT91C_PE8_TIOA1    ((unsigned int) AT91C_PIO_PE8) /*  */
#define AT91C_PIO_PE9        ((unsigned int) 1 <<  9) /* Pin Controlled by PE9*/
#define AT91C_PE9_ISI_HSYNC ((unsigned int) AT91C_PIO_PE9) /*  */
#define AT91C_PE9_TIOB1    ((unsigned int) AT91C_PIO_PE9) /*  */

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM9263*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Controller*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A*/
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_PIOCDE ((unsigned int)  4) /* Parallel IO Controller C, Parallel IO Controller D, Parallel IO Controller E*/
#define AT91C_ID_US0    ((unsigned int)  7) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  8) /* USART 1*/
#define AT91C_ID_US2    ((unsigned int)  9) /* USART 2*/
#define AT91C_ID_MCI0   ((unsigned int) 10) /* Multimedia Card Interface 0*/
#define AT91C_ID_MCI1   ((unsigned int) 11) /* Multimedia Card Interface 1*/
#define AT91C_ID_CAN    ((unsigned int) 12) /* CAN Controller*/
#define AT91C_ID_TWI    ((unsigned int) 13) /* Two-Wire Interface*/
#define AT91C_ID_SPI0   ((unsigned int) 14) /* Serial Peripheral Interface 0*/
#define AT91C_ID_SPI1   ((unsigned int) 15) /* Serial Peripheral Interface 1*/
#define AT91C_ID_SSC0   ((unsigned int) 16) /* Serial Synchronous Controller 0*/
#define AT91C_ID_SSC1   ((unsigned int) 17) /* Serial Synchronous Controller 1*/
#define AT91C_ID_AC97C  ((unsigned int) 18) /* AC97 Controller*/
#define AT91C_ID_TC012  ((unsigned int) 19) /* Timer Counter 0, Timer Counter 1, Timer Counter 2*/
#define AT91C_ID_PWMC   ((unsigned int) 20) /* PWM Controller*/
#define AT91C_ID_EMAC   ((unsigned int) 21) /* Ethernet Mac*/
#define AT91C_ID_UDP    ((unsigned int) 24) /* USB Device Port*/
#define AT91C_ID_HISI   ((unsigned int) 25) /* Image Sensor Interface*/
#define AT91C_ID_LCDC   ((unsigned int) 26) /* LCD Controller*/
#define AT91C_ID_DMA    ((unsigned int) 27) /* DMA Controller*/
#define AT91C_ID_UHP    ((unsigned int) 29) /* USB Host Port*/
#define AT91C_ID_IRQ0   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ALL_INT   ((unsigned int) 0xEF3FFF9F) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91SAM9263*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFE000) /* (SYS) Base Address*/
#define AT91C_BASE_EBI0      ((AT91PS_EBI0) 	0xFFFFE200) /* (EBI0) Base Address*/
#define AT91C_BASE_SDRAMC0   ((AT91PS_SDRAMC) 	0xFFFFE200) /* (SDRAMC0) Base Address*/
#define AT91C_BASE_SMC0      ((AT91PS_SMC) 	0xFFFFE400) /* (SMC0) Base Address*/
#define AT91C_BASE_EBI1      ((AT91PS_EBI1) 	0xFFFFE800) /* (EBI1) Base Address*/
#define AT91C_BASE_SDRAMC1   ((AT91PS_SDRAMC) 	0xFFFFE800) /* (SDRAMC1) Base Address*/
#define AT91C_BASE_SMC1      ((AT91PS_SMC) 	0xFFFFEA00) /* (SMC1) Base Address*/
#define AT91C_BASE_MATRIX    ((AT91PS_MATRIX) 	0xFFFFEC00) /* (MATRIX) Base Address*/
#define AT91C_BASE_CCFG      ((AT91PS_CCFG) 	0xFFFFED10) /* (CCFG) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFEF00) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFEE00) /* (DBGU) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF200) /* (PIOA) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOB) Base Address*/
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOC) Base Address*/
#define AT91C_BASE_PIOD      ((AT91PS_PIO) 	0xFFFFF800) /* (PIOD) Base Address*/
#define AT91C_BASE_PIOE      ((AT91PS_PIO) 	0xFFFFFA00) /* (PIOE) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) /* (CKGR) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_SHDWC     ((AT91PS_SHDWC) 	0xFFFFFD10) /* (SHDWC) Base Address*/
#define AT91C_BASE_RTTC0     ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC0) Base Address*/
#define AT91C_BASE_RTTC1     ((AT91PS_RTTC) 	0xFFFFFD50) /* (RTTC1) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFF7C000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFF7C040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFF7C080) /* (TC2) Base Address*/
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0xFFF7C000) /* (TCB0) Base Address*/
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0xFFF7C040) /* (TCB1) Base Address*/
#define AT91C_BASE_TCB2      ((AT91PS_TCB) 	0xFFF7C080) /* (TCB2) Base Address*/
#define AT91C_BASE_PDC_MCI0  ((AT91PS_PDC) 	0xFFF80100) /* (PDC_MCI0) Base Address*/
#define AT91C_BASE_MCI0      ((AT91PS_MCI) 	0xFFF80000) /* (MCI0) Base Address*/
#define AT91C_BASE_PDC_MCI1  ((AT91PS_PDC) 	0xFFF84100) /* (PDC_MCI1) Base Address*/
#define AT91C_BASE_MCI1      ((AT91PS_MCI) 	0xFFF84000) /* (MCI1) Base Address*/
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFF88000) /* (TWI) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFF8C100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFF8C000) /* (US0) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFF90100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFF90000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0xFFF94100) /* (PDC_US2) Base Address*/
#define AT91C_BASE_US2       ((AT91PS_USART) 	0xFFF94000) /* (US2) Base Address*/
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0xFFF98100) /* (PDC_SSC0) Base Address*/
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0xFFF98000) /* (SSC0) Base Address*/
#define AT91C_BASE_PDC_SSC1  ((AT91PS_PDC) 	0xFFF9C100) /* (PDC_SSC1) Base Address*/
#define AT91C_BASE_SSC1      ((AT91PS_SSC) 	0xFFF9C000) /* (SSC1) Base Address*/
#define AT91C_BASE_PDC_AC97C ((AT91PS_PDC) 	0xFFFA0100) /* (PDC_AC97C) Base Address*/
#define AT91C_BASE_AC97C     ((AT91PS_AC97C) 	0xFFFA0000) /* (AC97C) Base Address*/
#define AT91C_BASE_PDC_SPI0  ((AT91PS_PDC) 	0xFFFA4100) /* (PDC_SPI0) Base Address*/
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0xFFFA4000) /* (SPI0) Base Address*/
#define AT91C_BASE_PDC_SPI1  ((AT91PS_PDC) 	0xFFFA8100) /* (PDC_SPI1) Base Address*/
#define AT91C_BASE_SPI1      ((AT91PS_SPI) 	0xFFFA8000) /* (SPI1) Base Address*/
#define AT91C_BASE_CAN_MB0   ((AT91PS_CAN_MB) 	0xFFFAC200) /* (CAN_MB0) Base Address*/
#define AT91C_BASE_CAN_MB1   ((AT91PS_CAN_MB) 	0xFFFAC220) /* (CAN_MB1) Base Address*/
#define AT91C_BASE_CAN_MB2   ((AT91PS_CAN_MB) 	0xFFFAC240) /* (CAN_MB2) Base Address*/
#define AT91C_BASE_CAN_MB3   ((AT91PS_CAN_MB) 	0xFFFAC260) /* (CAN_MB3) Base Address*/
#define AT91C_BASE_CAN_MB4   ((AT91PS_CAN_MB) 	0xFFFAC280) /* (CAN_MB4) Base Address*/
#define AT91C_BASE_CAN_MB5   ((AT91PS_CAN_MB) 	0xFFFAC2A0) /* (CAN_MB5) Base Address*/
#define AT91C_BASE_CAN_MB6   ((AT91PS_CAN_MB) 	0xFFFAC2C0) /* (CAN_MB6) Base Address*/
#define AT91C_BASE_CAN_MB7   ((AT91PS_CAN_MB) 	0xFFFAC2E0) /* (CAN_MB7) Base Address*/
#define AT91C_BASE_CAN_MB8   ((AT91PS_CAN_MB) 	0xFFFAC300) /* (CAN_MB8) Base Address*/
#define AT91C_BASE_CAN_MB9   ((AT91PS_CAN_MB) 	0xFFFAC320) /* (CAN_MB9) Base Address*/
#define AT91C_BASE_CAN_MB10  ((AT91PS_CAN_MB) 	0xFFFAC340) /* (CAN_MB10) Base Address*/
#define AT91C_BASE_CAN_MB11  ((AT91PS_CAN_MB) 	0xFFFAC360) /* (CAN_MB11) Base Address*/
#define AT91C_BASE_CAN_MB12  ((AT91PS_CAN_MB) 	0xFFFAC380) /* (CAN_MB12) Base Address*/
#define AT91C_BASE_CAN_MB13  ((AT91PS_CAN_MB) 	0xFFFAC3A0) /* (CAN_MB13) Base Address*/
#define AT91C_BASE_CAN_MB14  ((AT91PS_CAN_MB) 	0xFFFAC3C0) /* (CAN_MB14) Base Address*/
#define AT91C_BASE_CAN_MB15  ((AT91PS_CAN_MB) 	0xFFFAC3E0) /* (CAN_MB15) Base Address*/
#define AT91C_BASE_CAN       ((AT91PS_CAN) 	0xFFFAC000) /* (CAN) Base Address*/
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFB8200) /* (PWMC_CH0) Base Address*/
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFB8220) /* (PWMC_CH1) Base Address*/
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFB8240) /* (PWMC_CH2) Base Address*/
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFB8260) /* (PWMC_CH3) Base Address*/
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFB8000) /* (PWMC) Base Address*/
#define AT91C_BASE_MACB      ((AT91PS_EMAC) 	0xFFFBC000) /* (MACB) Base Address*/
#define AT91C_BASE_LCDC      ((AT91PS_LCDC) 	0x00700000) /* (LCDC) Base Address*/
#define AT91C_BASE_DMA       ((AT91PS_DMA) 	0x00800000) /* (DMA) Base Address*/
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFF78000) /* (UDP) Base Address*/
#define AT91C_BASE_UHP       ((AT91PS_UHP) 	0x00A00000) /* (UHP) Base Address*/
#define AT91C_BASE_TBOX      ((AT91PS_TBOX) 	0x70000000) /* (TBOX) Base Address*/
#define AT91C_BASE_HECC0     ((AT91PS_ECC) 	0xFFFFE000) /* (HECC0) Base Address*/
#define AT91C_BASE_HECC1     ((AT91PS_ECC) 	0xFFFFE600) /* (HECC1) Base Address*/
#define AT91C_BASE_HISI      ((AT91PS_ISI) 	0xFFFC4000) /* (HISI) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91SAM9263*/
/* ******************************************************************************/
/* ITCM*/
#define AT91C_ITCM 	 ((char *) 	0x00100000) /* Maximum ITCM Area base address*/
#define AT91C_ITCM_SIZE	 ((unsigned int) 0x00010000) /* Maximum ITCM Area size in byte (64 Kbytes)*/
/* DTCM*/
#define AT91C_DTCM 	 ((char *) 	0x00200000) /* Maximum DTCM Area base address*/
#define AT91C_DTCM_SIZE	 ((unsigned int) 0x00010000) /* Maximum DTCM Area size in byte (64 Kbytes)*/
/* IRAM*/
#define AT91C_IRAM 	 ((char *) 	0x00300000) /* Maximum Internal SRAM base address*/
#define AT91C_IRAM_SIZE	 ((unsigned int) 0x00014000) /* Maximum Internal SRAM size in byte (80 Kbytes)*/
/* IRAM_MIN*/
#define AT91C_IRAM_MIN	 ((char *) 	0x00300000) /* Minimum Internal RAM base address*/
#define AT91C_IRAM_MIN_SIZE	 ((unsigned int) 0x00004000) /* Minimum Internal RAM size in byte (16 Kbytes)*/
/* IROM*/
#define AT91C_IROM 	 ((char *) 	0x00400000) /* Internal ROM base address*/
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00020000) /* Internal ROM size in byte (128 Kbytes)*/
/* IRAM2*/
#define AT91C_IRAM2	 ((char *) 	0x00500000) /* IRAM2 base address*/
#define AT91C_IRAM2_SIZE	 ((unsigned int) 0x00004000) /* IRAM2 size in byte (16 Kbytes)*/
/* EBI0_CS0*/
#define AT91C_EBI0_CS0	 ((char *) 	0x10000000) /* EBI0 Chip Select 0 base address*/
#define AT91C_EBI0_CS0_SIZE	 ((unsigned int) 0x10000000) /* EBI0 Chip Select 0 size in byte (262144 Kbytes)*/
/* EBI0_CS1*/
#define AT91C_EBI0_CS1	 ((char *) 	0x20000000) /* EBI0 Chip Select 1 base address*/
#define AT91C_EBI0_CS1_SIZE	 ((unsigned int) 0x10000000) /* EBI0 Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI0_SDRAM*/
#define AT91C_EBI0_SDRAM	 ((char *) 	0x20000000) /* SDRAM on EBI0 Chip Select 1 base address*/
#define AT91C_EBI0_SDRAM_SIZE	 ((unsigned int) 0x10000000) /* SDRAM on EBI0 Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI0_SDRAM_16BIT*/
#define AT91C_EBI0_SDRAM_16BIT	 ((char *) 	0x20000000) /* SDRAM on EBI0 Chip Select 1 base address*/
#define AT91C_EBI0_SDRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) /* SDRAM on EBI0 Chip Select 1 size in byte (32768 Kbytes)*/
/* EBI0_SDRAM_32BIT*/
#define AT91C_EBI0_SDRAM_32BIT	 ((char *) 	0x20000000) /* SDRAM on EBI0 Chip Select 1 base address*/
#define AT91C_EBI0_SDRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) /* SDRAM on EBI0 Chip Select 1 size in byte (65536 Kbytes)*/
/* EBI0_CS2*/
#define AT91C_EBI0_CS2	 ((char *) 	0x30000000) /* EBI0 Chip Select 2 base address*/
#define AT91C_EBI0_CS2_SIZE	 ((unsigned int) 0x10000000) /* EBI0 Chip Select 2 size in byte (262144 Kbytes)*/
/* EBI0_CS3*/
#define AT91C_EBI0_CS3	 ((char *) 	0x40000000) /* EBI0 Chip Select 3 base address*/
#define AT91C_EBI0_CS3_SIZE	 ((unsigned int) 0x10000000) /* EBI0 Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI0_SM*/
#define AT91C_EBI0_SM	 ((char *) 	0x40000000) /* SmartMedia on EBI0 Chip Select 3 base address*/
#define AT91C_EBI0_SM_SIZE	 ((unsigned int) 0x10000000) /* SmartMedia on EBI0 Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI0_CS4*/
#define AT91C_EBI0_CS4	 ((char *) 	0x50000000) /* EBI0 Chip Select 4 base address*/
#define AT91C_EBI0_CS4_SIZE	 ((unsigned int) 0x10000000) /* EBI0 Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI0_CF0*/
#define AT91C_EBI0_CF0	 ((char *) 	0x50000000) /* CompactFlash 0 on EBI0 Chip Select 4 base address*/
#define AT91C_EBI0_CF0_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 0 on EBI0 Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI0_CS5*/
#define AT91C_EBI0_CS5	 ((char *) 	0x60000000) /* EBI0 Chip Select 5 base address*/
#define AT91C_EBI0_CS5_SIZE	 ((unsigned int) 0x10000000) /* EBI0 Chip Select 5 size in byte (262144 Kbytes)*/
/* EBI0_CF1*/
#define AT91C_EBI0_CF1	 ((char *) 	0x60000000) /* CompactFlash 1 on EBI0Chip Select 5 base address*/
#define AT91C_EBI0_CF1_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 1 on EBI0Chip Select 5 size in byte (262144 Kbytes)*/
/* EBI1_CS0*/
#define AT91C_EBI1_CS0	 ((char *) 	0x70000000) /* EBI1 Chip Select 0 base address*/
#define AT91C_EBI1_CS0_SIZE	 ((unsigned int) 0x10000000) /* EBI1 Chip Select 0 size in byte (262144 Kbytes)*/
/* EBI1_CS1*/
#define AT91C_EBI1_CS1	 ((char *) 	0x80000000) /* EBI1 Chip Select 1 base address*/
#define AT91C_EBI1_CS1_SIZE	 ((unsigned int) 0x10000000) /* EBI1 Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI1_SDRAM_16BIT*/
#define AT91C_EBI1_SDRAM_16BIT	 ((char *) 	0x80000000) /* SDRAM on EBI1 Chip Select 1 base address*/
#define AT91C_EBI1_SDRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) /* SDRAM on EBI1 Chip Select 1 size in byte (32768 Kbytes)*/
/* EBI1_SDRAM_32BIT*/
#define AT91C_EBI1_SDRAM_32BIT	 ((char *) 	0x80000000) /* SDRAM on EBI1 Chip Select 1 base address*/
#define AT91C_EBI1_SDRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) /* SDRAM on EBI1 Chip Select 1 size in byte (65536 Kbytes)*/
/* EBI1_CS2*/
#define AT91C_EBI1_CS2	 ((char *) 	0x90000000) /* EBI1 Chip Select 2 base address*/
#define AT91C_EBI1_CS2_SIZE	 ((unsigned int) 0x10000000) /* EBI1 Chip Select 2 size in byte (262144 Kbytes)*/
/* EBI1_SM*/
#define AT91C_EBI1_SM	 ((char *) 	0x90000000) /* SmartMedia on EBI1 Chip Select 2 base address*/
#define AT91C_EBI1_SM_SIZE	 ((unsigned int) 0x10000000) /* SmartMedia on EBI1 Chip Select 2 size in byte (262144 Kbytes)*/
#endif /* __IAR_SYSTEMS_ICC__ */

