una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR DMA controller from Synopsys*/
/* - ******************************************************************************/
/* - -------- DMA_SAR : (DMA Offset: 0x0)  -------- */
AT91C_DMA_SADD            EQU (0x0 <<  0) ;- (DMA) Source Address of DMA Transfer
/* - -------- DMA_DAR : (DMA Offset: 0x8)  -------- */
AT91C_DMA_DADD            EQU (0x0 <<  0) ;- (DMA) Destination Address of DMA Transfer
/* - -------- DMA_LLP : (DMA Offset: 0x10)  -------- */
AT91C_DMA_LOC             EQU (0x0 <<  0) ;- (DMA) Address of the Next LLI
/* - -------- DMA_CTLl : (DMA Offset: 0x18)  -------- */
AT91C_DMA_INT_EN          EQU (0x1 <<  0) ;- (DMA) Interrupt Enable Bit
AT91C_DMA_DST_TR_WIDTH    EQU (0x7 <<  1) ;- (DMA) Destination Transfer Width
AT91C_DMA_SRC_TR_WIDTH    EQU (0x7 <<  4) ;- (DMA) Source Transfer Width
AT91C_DMA_DINC            EQU (0x3 <<  7) ;- (DMA) Destination Address Increment
AT91C_DMA_SINC            EQU (0x3 <<  9) ;- (DMA) Source Address Increment
AT91C_DMA_DEST_MSIZE      EQU (0x7 << 11) ;- (DMA) Destination Burst Transaction Length
AT91C_DMA_SRC_MSIZE       EQU (0x7 << 14) ;- (DMA) Source Burst Transaction Length
AT91C_DMA_S_GATH_EN       EQU (0x1 << 17) ;- (DMA) Source Gather Enable Bit
AT91C_DMA_D_SCAT_EN       EQU (0x1 << 18) ;- (DMA) Destination Scatter Enable Bit
AT91C_DMA_TT_FC           EQU (0x7 << 20) ;- (DMA) Transfer Type and Flow Control
AT91C_DMA_DMS             EQU (0x3 << 23) ;- (DMA) Destination Master Select
AT91C_DMA_SMS             EQU (0x3 << 25) ;- (DMA) Source Master Select
AT91C_DMA_LLP_D_EN        EQU (0x1 << 27) ;- (DMA) Destination Block Chaining Enable
AT91C_DMA_LLP_S_EN        EQU (0x1 << 28) ;- (DMA) Source Block Chaining Enable
/* - -------- DMA_CTLh : (DMA Offset: 0x1c)  -------- */
AT91C_DMA_BLOCK_TS        EQU (0xFFF <<  0) ;- (DMA) Block Transfer Size
AT91C_DMA_DONE            EQU (0x1 << 12) ;- (DMA) Done bit
/* - -------- DMA_CFGl : (DMA Offset: 0x40)  -------- */
AT91C_DMA_CH_PRIOR        EQU (0x7 <<  5) ;- (DMA) Channel Priority
AT91C_DMA_CH_SUSP         EQU (0x1 <<  8) ;- (DMA) Channel Suspend
AT91C_DMA_FIFO_EMPT       EQU (0x1 <<  9) ;- (DMA) Fifo Empty
AT91C_DMA_HS_SEL_DS       EQU (0x1 << 10) ;- (DMA) Destination Software or Hardware Handshaking Select
AT91C_DMA_HS_SEL_SR       EQU (0x1 << 11) ;- (DMA) Source Software or Hardware Handshaking Select
AT91C_DMA_LOCK_CH_L       EQU (0x3 << 12) ;- (DMA) Channel Lock Level
AT91C_DMA_LOCK_B_L        EQU (0x3 << 14) ;- (DMA) Bus Lock Level
AT91C_DMA_LOCK_CH         EQU (0x1 << 16) ;- (DMA) Channel Lock Bit
AT91C_DMA_LOCK_B          EQU (0x1 << 17) ;- (DMA) Bus Lock Bit
AT91C_DMA_DS_HS_POL       EQU (0x1 << 18) ;- (DMA) Destination Handshaking Interface Polarity
AT91C_DMA_SR_HS_POL       EQU (0x1 << 19) ;- (DMA) Source Handshaking Interface Polarity
AT91C_DMA_MAX_ABRST       EQU (0x3FF << 20) ;- (DMA) Maximum AMBA Burst Length
AT91C_DMA_RELOAD_SR       EQU (0x1 << 30) ;- (DMA) Automatic Source Reload
AT91C_DMA_RELOAD_DS       EQU (0x1 << 31) ;- (DMA) Automatic Destination Reload
/* - -------- DMA_CFGh : (DMA Offset: 0x44)  -------- */
AT91C_DMA_FCMODE          EQU (0x1 <<  0) ;- (DMA) Flow Control Mode
AT91C_DMA_FIFO_MODE       EQU (0x1 <<  1) ;- (DMA) Fifo Mode Select
AT91C_DMA_PROTCTL         EQU (0x7 <<  2) ;- (DMA) Protection Control
AT91C_DMA_DS_UPD_EN       EQU (0x1 <<  5) ;- (DMA) Destination Status Update Enable
AT91C_DMA_SS_UPD_EN       EQU (0x1 <<  6) ;- (DMA) Source Status Update Enable
AT91C_DMA_SRC_PER         EQU (0xF <<  7) ;- (DMA) Source Hardware Handshaking Interface
AT91C_DMA_DEST_PER        EQU (0xF << 11) ;- (DMA) Destination Hardware Handshaking Interface
/* - -------- DMA_SGR : (DMA Offset: 0x48)  -------- */
AT91C_DMA_SGI             EQU (0xFFFFF <<  0) ;- (DMA) Source Gather Interval
AT91C_DMA_SGC             EQU (0xFFF << 20) ;- (DMA) Source Gather Count
/* - -------- DMA_DSR : (DMA Offset: 0x50)  -------- */
AT91C_DMA_DSI             EQU (0xFFFFF <<  0) ;- (DMA) Destination Scatter Interval
AT91C_DMA_DSC             EQU (0xFFF << 20) ;- (DMA) Destination Scatter Count
/* - -------- DMA_SAR : (DMA Offset: 0x58)  -------- */
/* - -------- DMA_DAR : (DMA Offset: 0x60)  -------- */
/* - -------- DMA_LLP : (DMA Offset: 0x68)  -------- */
/* - -------- DMA_CTLl : (DMA Offset: 0x70)  -------- */
/* - -------- DMA_CTLh : (DMA Offset: 0x74)  -------- */
/* - -------- DMA_CFGl : (DMA Offset: 0x98)  -------- */
/* - -------- DMA_CFGh : (DMA Offset: 0x9c)  -------- */
/* - -------- DMA_SGR : (DMA Offset: 0xa0)  -------- */
/* - -------- DMA_DSR : (DMA Offset: 0xa8)  -------- */
/* - -------- DMA_RAWTFR : (DMA Offset: 0x2c0)  -------- */
AT91C_DMA_RAW             EQU (0x7 <<  0) ;- (DMA) Raw Interrupt for each Channel
/* - -------- DMA_RAWBLOCK : (DMA Offset: 0x2c8)  -------- */
/* - -------- DMA_RAWSRCTRAN : (DMA Offset: 0x2d0)  -------- */
/* - -------- DMA_RAWDSTTRAN : (DMA Offset: 0x2d8)  -------- */
/* - -------- DMA_RAWERR : (DMA Offset: 0x2e0)  -------- */
/* - -------- DMA_STATUSTFR : (DMA Offset: 0x2e8)  -------- */
AT91C_DMA_STATUS          EQU (0x7 <<  0) ;- (DMA) Interrupt for each Channel
/* - -------- DMA_STATUSBLOCK : (DMA Offset: 0x2f0)  -------- */
/* - -------- DMA_STATUSSRCTRAN : (DMA Offset: 0x2f8)  -------- */
/* - -------- DMA_STATUSDSTTRAN : (DMA Offset: 0x300)  -------- */
/* - -------- DMA_STATUSERR : (DMA Offset: 0x308)  -------- */
/* - -------- DMA_MASKTFR : (DMA Offset: 0x310)  -------- */
AT91C_DMA_INT_MASK        EQU (0x7 <<  0) ;- (DMA) Interrupt Mask for each Channel
AT91C_DMA_INT_M_WE        EQU (0x7 <<  8) ;- (DMA) Interrupt Mask Write Enable for each Channel
/* - -------- DMA_MASKBLOCK : (DMA Offset: 0x318)  -------- */
/* - -------- DMA_MASKSRCTRAN : (DMA Offset: 0x320)  -------- */
/* - -------- DMA_MASKDSTTRAN : (DMA Offset: 0x328)  -------- */
/* - -------- DMA_MASKERR : (DMA Offset: 0x330)  -------- */
/* - -------- DMA_CLEARTFR : (DMA Offset: 0x338)  -------- */
AT91C_DMA_CLEAR           EQU (0x7 <<  0) ;- (DMA) Interrupt Clear for each Channel
/* - -------- DMA_CLEARBLOCK : (DMA Offset: 0x340)  -------- */
/* - -------- DMA_CLEARSRCTRAN : (DMA Offset: 0x348)  -------- */
/* - -------- DMA_CLEARDSTTRAN : (DMA Offset: 0x350)  -------- */
/* - -------- DMA_CLEARERR : (DMA Offset: 0x358)  -------- */
/* - -------- DMA_STATUSINT : (DMA Offset: 0x360)  -------- */
AT91C_DMA_TFR             EQU (0x1 <<  0) ;- (DMA) OR of the content of StatusTfr Register
AT91C_DMA_BLOCK           EQU (0x1 <<  1) ;- (DMA) OR of the content of StatusBlock Register
AT91C_DMA_SRCT            EQU (0x1 <<  2) ;- (DMA) OR of the content of StatusSrcTran Register
AT91C_DMA_DSTT            EQU (0x1 <<  3) ;- (DMA) OR of the content of StatusDstTran Register
AT91C_DMA_ERR             EQU (0x1 <<  4) ;- (DMA) OR of the content of StatusErr Register
/* - -------- DMA_REQSRCREG : (DMA Offset: 0x368)  -------- */
AT91C_DMA_SRC_REQ         EQU (0x7 <<  0) ;- (DMA) Source Request
AT91C_DMA_REQ_WE          EQU (0x7 <<  8) ;- (DMA) Request Write Enable
/* - -------- DMA_REQDSTREG : (DMA Offset: 0x370)  -------- */
AT91C_DMA_DST_REQ         EQU (0x7 <<  0) ;- (DMA) Destination Request
/* - -------- DMA_SGLREQSRCREG : (DMA Offset: 0x378)  -------- */
AT91C_DMA_S_SG_REQ        EQU (0x7 <<  0) ;- (DMA) Source Single Request
/* - -------- DMA_SGLREQDSTREG : (DMA Offset: 0x380)  -------- */
AT91C_DMA_D_SG_REQ        EQU (0x7 <<  0) ;- (DMA) Destination Single Request
/* - -------- DMA_LSTREQSRCREG : (DMA Offset: 0x388)  -------- */
AT91C_DMA_LSTSRC          EQU (0x7 <<  0) ;- (DMA) Source Last Transaction Request
AT91C_DMA_LSTSR_WE        EQU (0x7 <<  8) ;- (DMA) Source Last Transaction Request Write Enable
/* - -------- DMA_LSTREQDSTREG : (DMA Offset: 0x390)  -------- */
AT91C_DMA_LSTDST          EQU (0x7 <<  0) ;- (DMA) Destination Last Transaction Request
AT91C_DMA_LSTDS_WE        EQU (0x7 <<  8) ;- (DMA) Destination Last Transaction Request Write Enable
/* - -------- DMA_DMACFGREG : (DMA Offset: 0x398)  -------- */
AT91C_DMA_DMA_EN          EQU (0x7 <<  0) ;- (DMA) Controller Enable
/* - -------- DMA_CHENREG : (DMA Offset: 0x3a0)  -------- */
AT91C_DMA_CH_EN           EQU (0x7 <<  0) ;- (DMA) Channel Enable
AT91C_DMA_CH_EN_WE        EQU (0x7 <<  8) ;- (DMA) Channel Enable Write Enable
/* - -------- DMA_DMATESTREG : (DMA Offset: 0x3b0)  -------- */
AT91C_DMA_TEST_SLV_IF     EQU (0x1 <<  0) ;- (DMA) Test Mode for Slave Interface

