una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Image Sensor Interface*/
/* - ******************************************************************************/
/* - -------- ISI_CR1 : (ISI Offset: 0x0) ISI Control Register 1 -------- */
AT91C_ISI_RST             EQU (0x1 <<  0) ;- (ISI) Image sensor interface reset
AT91C_ISI_DISABLE         EQU (0x1 <<  1) ;- (ISI) image sensor disable.
AT91C_ISI_HSYNC_POL       EQU (0x1 <<  2) ;- (ISI) Horizontal synchronisation polarity
AT91C_ISI_PIXCLK_POL      EQU (0x1 <<  4) ;- (ISI) Pixel Clock Polarity
AT91C_ISI_EMB_SYNC        EQU (0x1 <<  6) ;- (ISI) Embedded synchronisation
AT91C_ISI_CRC_SYNC        EQU (0x1 <<  7) ;- (ISI) CRC correction
AT91C_ISI_FULL            EQU (0x1 << 12) ;- (ISI) Full mode is allowed
AT91C_ISI_THMASK          EQU (0x3 << 13) ;- (ISI) DMA Burst Mask
AT91C_ISI_THMASK_4_8_16_BURST EQU (0x0 << 13) ;- (ISI) 4,8 and 16 AHB burst are allowed
AT91C_ISI_THMASK_8_16_BURST EQU (0x1 << 13) ;- (ISI) 8 and 16 AHB burst are allowed
AT91C_ISI_THMASK_16_BURST EQU (0x2 << 13) ;- (ISI) Only 16 AHB burst are allowed
AT91C_ISI_CODEC_ON        EQU (0x1 << 15) ;- (ISI) Enable the codec path
AT91C_ISI_SLD             EQU (0xFF << 16) ;- (ISI) Start of Line Delay
AT91C_ISI_SFD             EQU (0xFF << 24) ;- (ISI) Start of frame Delay
/* - -------- ISI_CR2 : (ISI Offset: 0x4) ISI Control Register 2 -------- */
AT91C_ISI_IM_VSIZE        EQU (0x7FF <<  0) ;- (ISI) Vertical size of the Image sensor [0..2047]
AT91C_ISI_GS_MODE         EQU (0x1 << 11) ;- (ISI) Grayscale Memory Mode
AT91C_ISI_RGB_MODE        EQU (0x3 << 12) ;- (ISI) RGB mode
AT91C_ISI_RGB_MODE_RGB_888 EQU (0x0 << 12) ;- (ISI) RGB 8:8:8 24 bits
AT91C_ISI_RGB_MODE_RGB_565 EQU (0x1 << 12) ;- (ISI) RGB 5:6:5 16 bits
AT91C_ISI_RGB_MODE_RGB_555 EQU (0x2 << 12) ;- (ISI) RGB 5:5:5 16 bits
AT91C_ISI_GRAYSCALE       EQU (0x1 << 13) ;- (ISI) Grayscale Mode
AT91C_ISI_RGB_SWAP        EQU (0x1 << 14) ;- (ISI) RGB Swap
AT91C_ISI_COL_SPACE       EQU (0x1 << 15) ;- (ISI) Color space for the image data
AT91C_ISI_IM_HSIZE        EQU (0x7FF << 16) ;- (ISI) Horizontal size of the Image sensor [0..2047]
AT91C_ISI_RGB_MODE_YCC_DEF EQU (0x0 << 28) ;- (ISI) Cb(i) Y(i) Cr(i) Y(i+1)
AT91C_ISI_RGB_MODE_YCC_MOD1 EQU (0x1 << 28) ;- (ISI) Cr(i) Y(i) Cb(i) Y(i+1)
AT91C_ISI_RGB_MODE_YCC_MOD2 EQU (0x2 << 28) ;- (ISI) Y(i) Cb(i) Y(i+1) Cr(i)
AT91C_ISI_RGB_MODE_YCC_MOD3 EQU (0x3 << 28) ;- (ISI) Y(i) Cr(i) Y(i+1) Cb(i)
AT91C_ISI_RGB_CFG         EQU (0x3 << 30) ;- (ISI) RGB configuration
AT91C_ISI_RGB_CFG_RGB_DEF EQU (0x0 << 30) ;- (ISI) R/G(MSB)  G(LSB)/B  R/G(MSB)  G(LSB)/B
AT91C_ISI_RGB_CFG_RGB_MOD1 EQU (0x1 << 30) ;- (ISI) B/G(MSB)  G(LSB)/R  B/G(MSB)  G(LSB)/R
AT91C_ISI_RGB_CFG_RGB_MOD2 EQU (0x2 << 30) ;- (ISI) G(LSB)/R  B/G(MSB)  G(LSB)/R  B/G(MSB)
AT91C_ISI_RGB_CFG_RGB_MOD3 EQU (0x3 << 30) ;- (ISI) G(LSB)/B  R/G(MSB)  G(LSB)/B  R/G(MSB)
/* - -------- ISI_SR : (ISI Offset: 0x8) ISI Status Register -------- */
AT91C_ISI_SOF             EQU (0x1 <<  0) ;- (ISI) Start of Frame
AT91C_ISI_DIS             EQU (0x1 <<  1) ;- (ISI) Image Sensor Interface disable
AT91C_ISI_SOFTRST         EQU (0x1 <<  2) ;- (ISI) Software Reset
AT91C_ISI_CRC_ERR         EQU (0x1 <<  4) ;- (ISI) CRC synchronisation error
AT91C_ISI_FO_C_OVF        EQU (0x1 <<  5) ;- (ISI) Fifo Codec Overflow 
AT91C_ISI_FO_P_OVF        EQU (0x1 <<  6) ;- (ISI) Fifo Preview Overflow 
AT91C_ISI_FO_P_EMP        EQU (0x1 <<  7) ;- (ISI) Fifo Preview Empty
AT91C_ISI_FO_C_EMP        EQU (0x1 <<  8) ;- (ISI) Fifo Codec Empty
AT91C_ISI_FR_OVR          EQU (0x1 <<  9) ;- (ISI) Frame rate overun
/* - -------- ISI_IER : (ISI Offset: 0xc) ISI Interrupt Enable Register -------- */
/* - -------- ISI_IDR : (ISI Offset: 0x10) ISI Interrupt Disable Register -------- */
/* - -------- ISI_IMR : (ISI Offset: 0x14) ISI Interrupt Mask Register -------- */
/* - -------- ISI_PSIZE : (ISI Offset: 0x20) ISI Preview Register -------- */
AT91C_ISI_PREV_VSIZE      EQU (0x3FF <<  0) ;- (ISI) Vertical size for the preview path
AT91C_ISI_PREV_HSIZE      EQU (0x3FF << 16) ;- (ISI) Horizontal size for the preview path
/* - -------- ISI_Y2R_SET0 : (ISI Offset: 0x30) Color Space Conversion YCrCb to RGB Register -------- */
AT91C_ISI_Y2R_C0          EQU (0xFF <<  0) ;- (ISI) Color Space Conversion Matrix Coefficient C0
AT91C_ISI_Y2R_C1          EQU (0xFF <<  8) ;- (ISI) Color Space Conversion Matrix Coefficient C1
AT91C_ISI_Y2R_C2          EQU (0xFF << 16) ;- (ISI) Color Space Conversion Matrix Coefficient C2
AT91C_ISI_Y2R_C3          EQU (0xFF << 24) ;- (ISI) Color Space Conversion Matrix Coefficient C3
/* - -------- ISI_Y2R_SET1 : (ISI Offset: 0x34) ISI Color Space Conversion YCrCb to RGB set 1 Register -------- */
AT91C_ISI_Y2R_C4          EQU (0x1FF <<  0) ;- (ISI) Color Space Conversion Matrix Coefficient C4
AT91C_ISI_Y2R_YOFF        EQU (0xFF << 12) ;- (ISI) Color Space Conversion Luninance default offset
AT91C_ISI_Y2R_CROFF       EQU (0xFF << 13) ;- (ISI) Color Space Conversion Red Chrominance default offset
AT91C_ISI_Y2R_CBFF        EQU (0xFF << 14) ;- (ISI) Color Space Conversion Luninance default offset
/* - -------- ISI_R2Y_SET0 : (ISI Offset: 0x38) Color Space Conversion RGB to YCrCb set 0 register -------- */
AT91C_ISI_R2Y_C0          EQU (0x7F <<  0) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C0
AT91C_ISI_R2Y_C1          EQU (0x7F <<  1) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C1
AT91C_ISI_R2Y_C2          EQU (0x7F <<  3) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C2
AT91C_ISI_R2Y_ROFF        EQU (0x1 <<  4) ;- (ISI) Color Space Conversion Red component offset
/* - -------- ISI_R2Y_SET1 : (ISI Offset: 0x3c) Color Space Conversion RGB to YCrCb set 1 register -------- */
AT91C_ISI_R2Y_C3          EQU (0x7F <<  0) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C3
AT91C_ISI_R2Y_C4          EQU (0x7F <<  1) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C4
AT91C_ISI_R2Y_C5          EQU (0x7F <<  3) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C5
AT91C_ISI_R2Y_GOFF        EQU (0x1 <<  4) ;- (ISI) Color Space Conversion Green component offset
/* - -------- ISI_R2Y_SET2 : (ISI Offset: 0x40) Color Space Conversion RGB to YCrCb set 2 register -------- */
AT91C_ISI_R2Y_C6          EQU (0x7F <<  0) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C6
AT91C_ISI_R2Y_C7          EQU (0x7F <<  1) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C7
AT91C_ISI_R2Y_C8          EQU (0x7F <<  3) ;- (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C8
AT91C_ISI_R2Y_BOFF        EQU (0x1 <<  4) ;- (ISI) Color Space Conversion Blue component offset

