una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* - ******************************************************************************/
/* -               REGISTER ADDRESS DEFINITION FOR AT91SAM9263*/
/* - ******************************************************************************/
/* - ========== Register definition for SYS peripheral ========== */
AT91C_SYS_ECC1            EQU (0xFFFFE600) ;- (SYS) ECC 0
AT91C_SYS_ECC0            EQU (0xFFFFE000) ;- (SYS) ECC 0
AT91C_SYS_GPBR            EQU (0xFFFFFD60) ;- (SYS) General Purpose Register
/* - ========== Register definition for EBI0 peripheral ========== */
AT91C_EBI0_DUMMY          EQU (0xFFFFE200) ;- (EBI0) Dummy register - Do not use
/* - ========== Register definition for SDRAMC0 peripheral ========== */
AT91C_SDRAMC0_MDR         EQU (0xFFFFE224) ;- (SDRAMC0) SDRAM Memory Device Register
AT91C_SDRAMC0_IDR         EQU (0xFFFFE218) ;- (SDRAMC0) SDRAM Controller Interrupt Disable Register
AT91C_SDRAMC0_IMR         EQU (0xFFFFE21C) ;- (SDRAMC0) SDRAM Controller Interrupt Mask Register
AT91C_SDRAMC0_ISR         EQU (0xFFFFE220) ;- (SDRAMC0) SDRAM Controller Interrupt Mask Register
AT91C_SDRAMC0_HSR         EQU (0xFFFFE20C) ;- (SDRAMC0) SDRAM Controller High Speed Register
AT91C_SDRAMC0_TR          EQU (0xFFFFE204) ;- (SDRAMC0) SDRAM Controller Refresh Timer Register
AT91C_SDRAMC0_CR          EQU (0xFFFFE208) ;- (SDRAMC0) SDRAM Controller Configuration Register
AT91C_SDRAMC0_MR          EQU (0xFFFFE200) ;- (SDRAMC0) SDRAM Controller Mode Register
AT91C_SDRAMC0_LPR         EQU (0xFFFFE210) ;- (SDRAMC0) SDRAM Controller Low Power Register
AT91C_SDRAMC0_IER         EQU (0xFFFFE214) ;- (SDRAMC0) SDRAM Controller Interrupt Enable Register
/* - ========== Register definition for SMC0 peripheral ========== */
AT91C_SMC0_CYCLE6         EQU (0xFFFFE468) ;- (SMC0)  Cycle Register for CS 6
AT91C_SMC0_SETUP6         EQU (0xFFFFE460) ;- (SMC0)  Setup Register for CS 6
AT91C_SMC0_PULSE3         EQU (0xFFFFE434) ;- (SMC0)  Pulse Register for CS 3
AT91C_SMC0_CYCLE1         EQU (0xFFFFE418) ;- (SMC0)  Cycle Register for CS 1
AT91C_SMC0_SETUP5         EQU (0xFFFFE450) ;- (SMC0)  Setup Register for CS 5
AT91C_SMC0_CYCLE7         EQU (0xFFFFE478) ;- (SMC0)  Cycle Register for CS 7
AT91C_SMC0_PULSE0         EQU (0xFFFFE404) ;- (SMC0)  Pulse Register for CS 0
AT91C_SMC0_CYCLE5         EQU (0xFFFFE458) ;- (SMC0)  Cycle Register for CS 5
AT91C_SMC0_CTRL0          EQU (0xFFFFE40C) ;- (SMC0)  Control Register for CS 0
AT91C_SMC0_SETUP7         EQU (0xFFFFE470) ;- (SMC0)  Setup Register for CS 7
AT91C_SMC0_CTRL4          EQU (0xFFFFE44C) ;- (SMC0)  Control Register for CS 4
AT91C_SMC0_CTRL1          EQU (0xFFFFE41C) ;- (SMC0)  Control Register for CS 1
AT91C_SMC0_CYCLE2         EQU (0xFFFFE428) ;- (SMC0)  Cycle Register for CS 2
AT91C_SMC0_PULSE7         EQU (0xFFFFE474) ;- (SMC0)  Pulse Register for CS 7
AT91C_SMC0_PULSE6         EQU (0xFFFFE464) ;- (SMC0)  Pulse Register for CS 6
AT91C_SMC0_CYCLE4         EQU (0xFFFFE448) ;- (SMC0)  Cycle Register for CS 4
AT91C_SMC0_CYCLE0         EQU (0xFFFFE408) ;- (SMC0)  Cycle Register for CS 0
AT91C_SMC0_CTRL6          EQU (0xFFFFE46C) ;- (SMC0)  Control Register for CS 6
AT91C_SMC0_CTRL5          EQU (0xFFFFE45C) ;- (SMC0)  Control Register for CS 5
AT91C_SMC0_SETUP0         EQU (0xFFFFE400) ;- (SMC0)  Setup Register for CS 0
AT91C_SMC0_SETUP4         EQU (0xFFFFE440) ;- (SMC0)  Setup Register for CS 4
AT91C_SMC0_PULSE1         EQU (0xFFFFE414) ;- (SMC0)  Pulse Register for CS 1
AT91C_SMC0_CTRL2          EQU (0xFFFFE42C) ;- (SMC0)  Control Register for CS 2
AT91C_SMC0_SETUP2         EQU (0xFFFFE420) ;- (SMC0)  Setup Register for CS 2
AT91C_SMC0_CTRL3          EQU (0xFFFFE43C) ;- (SMC0)  Control Register for CS 3
AT91C_SMC0_SETUP3         EQU (0xFFFFE430) ;- (SMC0)  Setup Register for CS 3
AT91C_SMC0_CTRL7          EQU (0xFFFFE47C) ;- (SMC0)  Control Register for CS 7
AT91C_SMC0_PULSE5         EQU (0xFFFFE454) ;- (SMC0)  Pulse Register for CS 5
AT91C_SMC0_PULSE4         EQU (0xFFFFE444) ;- (SMC0)  Pulse Register for CS 4
AT91C_SMC0_PULSE2         EQU (0xFFFFE424) ;- (SMC0)  Pulse Register for CS 2
AT91C_SMC0_CYCLE3         EQU (0xFFFFE438) ;- (SMC0)  Cycle Register for CS 3
AT91C_SMC0_SETUP1         EQU (0xFFFFE410) ;- (SMC0)  Setup Register for CS 1
/* - ========== Register definition for EBI1 peripheral ========== */
AT91C_EBI1_DUMMY          EQU (0xFFFFE800) ;- (EBI1) Dummy register - Do not use
/* - ========== Register definition for SDRAMC1 peripheral ========== */
AT91C_SDRAMC1_IMR         EQU (0xFFFFE81C) ;- (SDRAMC1) SDRAM Controller Interrupt Mask Register
AT91C_SDRAMC1_LPR         EQU (0xFFFFE810) ;- (SDRAMC1) SDRAM Controller Low Power Register
AT91C_SDRAMC1_CR          EQU (0xFFFFE808) ;- (SDRAMC1) SDRAM Controller Configuration Register
AT91C_SDRAMC1_HSR         EQU (0xFFFFE80C) ;- (SDRAMC1) SDRAM Controller High Speed Register
AT91C_SDRAMC1_MDR         EQU (0xFFFFE824) ;- (SDRAMC1) SDRAM Memory Device Register
AT91C_SDRAMC1_MR          EQU (0xFFFFE800) ;- (SDRAMC1) SDRAM Controller Mode Register
AT91C_SDRAMC1_ISR         EQU (0xFFFFE820) ;- (SDRAMC1) SDRAM Controller Interrupt Mask Register
AT91C_SDRAMC1_IDR         EQU (0xFFFFE818) ;- (SDRAMC1) SDRAM Controller Interrupt Disable Register
AT91C_SDRAMC1_IER         EQU (0xFFFFE814) ;- (SDRAMC1) SDRAM Controller Interrupt Enable Register
AT91C_SDRAMC1_TR          EQU (0xFFFFE804) ;- (SDRAMC1) SDRAM Controller Refresh Timer Register
/* - ========== Register definition for SMC1 peripheral ========== */
AT91C_SMC1_PULSE4         EQU (0xFFFFEA44) ;- (SMC1)  Pulse Register for CS 4
AT91C_SMC1_SETUP2         EQU (0xFFFFEA20) ;- (SMC1)  Setup Register for CS 2
AT91C_SMC1_CYCLE0         EQU (0xFFFFEA08) ;- (SMC1)  Cycle Register for CS 0
AT91C_SMC1_SETUP7         EQU (0xFFFFEA70) ;- (SMC1)  Setup Register for CS 7
AT91C_SMC1_PULSE7         EQU (0xFFFFEA74) ;- (SMC1)  Pulse Register for CS 7
AT91C_SMC1_CTRL0          EQU (0xFFFFEA0C) ;- (SMC1)  Control Register for CS 0
AT91C_SMC1_SETUP3         EQU (0xFFFFEA30) ;- (SMC1)  Setup Register for CS 3
AT91C_SMC1_SETUP4         EQU (0xFFFFEA40) ;- (SMC1)  Setup Register for CS 4
AT91C_SMC1_CYCLE6         EQU (0xFFFFEA68) ;- (SMC1)  Cycle Register for CS 6
AT91C_SMC1_CTRL1          EQU (0xFFFFEA1C) ;- (SMC1)  Control Register for CS 1
AT91C_SMC1_CYCLE3         EQU (0xFFFFEA38) ;- (SMC1)  Cycle Register for CS 3
AT91C_SMC1_CTRL5          EQU (0xFFFFEA5C) ;- (SMC1)  Control Register for CS 5
AT91C_SMC1_CTRL3          EQU (0xFFFFEA3C) ;- (SMC1)  Control Register for CS 3
AT91C_SMC1_CYCLE4         EQU (0xFFFFEA48) ;- (SMC1)  Cycle Register for CS 4
AT91C_SMC1_SETUP6         EQU (0xFFFFEA60) ;- (SMC1)  Setup Register for CS 6
AT91C_SMC1_PULSE3         EQU (0xFFFFEA34) ;- (SMC1)  Pulse Register for CS 3
AT91C_SMC1_CTRL7          EQU (0xFFFFEA7C) ;- (SMC1)  Control Register for CS 7
AT91C_SMC1_SETUP1         EQU (0xFFFFEA10) ;- (SMC1)  Setup Register for CS 1
AT91C_SMC1_PULSE5         EQU (0xFFFFEA54) ;- (SMC1)  Pulse Register for CS 5
AT91C_SMC1_PULSE0         EQU (0xFFFFEA04) ;- (SMC1)  Pulse Register for CS 0
AT91C_SMC1_CYCLE5         EQU (0xFFFFEA58) ;- (SMC1)  Cycle Register for CS 5
AT91C_SMC1_PULSE6         EQU (0xFFFFEA64) ;- (SMC1)  Pulse Register for CS 6
AT91C_SMC1_SETUP5         EQU (0xFFFFEA50) ;- (SMC1)  Setup Register for CS 5
AT91C_SMC1_CTRL6          EQU (0xFFFFEA6C) ;- (SMC1)  Control Register for CS 6
AT91C_SMC1_CTRL2          EQU (0xFFFFEA2C) ;- (SMC1)  Control Register for CS 2
AT91C_SMC1_SETUP0         EQU (0xFFFFEA00) ;- (SMC1)  Setup Register for CS 0
AT91C_SMC1_CYCLE7         EQU (0xFFFFEA78) ;- (SMC1)  Cycle Register for CS 7
AT91C_SMC1_CYCLE1         EQU (0xFFFFEA18) ;- (SMC1)  Cycle Register for CS 1
AT91C_SMC1_PULSE2         EQU (0xFFFFEA24) ;- (SMC1)  Pulse Register for CS 2
AT91C_SMC1_PULSE1         EQU (0xFFFFEA14) ;- (SMC1)  Pulse Register for CS 1
AT91C_SMC1_CYCLE2         EQU (0xFFFFEA28) ;- (SMC1)  Cycle Register for CS 2
AT91C_SMC1_CTRL4          EQU (0xFFFFEA4C) ;- (SMC1)  Control Register for CS 4
/* - ========== Register definition for MATRIX peripheral ========== */
AT91C_MATRIX_MCFG7        EQU (0xFFFFEC1C) ;- (MATRIX)  Master Configuration Register 7 
AT91C_MATRIX_MRCR         EQU (0xFFFFED00) ;- (MATRIX)  Master Remp Control Register 
AT91C_MATRIX_PRBS5        EQU (0xFFFFECAC) ;- (MATRIX)  PRBS5
AT91C_MATRIX_SCFG6        EQU (0xFFFFEC58) ;- (MATRIX)  Slave Configuration Register 6
AT91C_MATRIX_MCFG3        EQU (0xFFFFEC0C) ;- (MATRIX)  Master Configuration Register 3 
AT91C_MATRIX_SCFG5        EQU (0xFFFFEC54) ;- (MATRIX)  Slave Configuration Register 5
AT91C_MATRIX_MCFG1        EQU (0xFFFFEC04) ;- (MATRIX)  Master Configuration Register 1 
AT91C_MATRIX_SCFG3        EQU (0xFFFFEC4C) ;- (MATRIX)  Slave Configuration Register 3
AT91C_MATRIX_MCFG4        EQU (0xFFFFEC10) ;- (MATRIX)  Master Configuration Register 4 
AT91C_MATRIX_MCFG2        EQU (0xFFFFEC08) ;- (MATRIX)  Master Configuration Register 2 
AT91C_MATRIX_PRBS6        EQU (0xFFFFECB4) ;- (MATRIX)  PRBS6
AT91C_MATRIX_SCFG4        EQU (0xFFFFEC50) ;- (MATRIX)  Slave Configuration Register 4
AT91C_MATRIX_MCFG8        EQU (0xFFFFEC20) ;- (MATRIX)  Master Configuration Register 8 
AT91C_MATRIX_PRAS3        EQU (0xFFFFEC98) ;- (MATRIX)  PRAS3
AT91C_MATRIX_PRAS4        EQU (0xFFFFECA0) ;- (MATRIX)  PRAS4
AT91C_MATRIX_PRAS1        EQU (0xFFFFEC88) ;- (MATRIX)  PRAS1
AT91C_MATRIX_PRAS0        EQU (0xFFFFEC80) ;- (MATRIX)  PRAS0
AT91C_MATRIX_SCFG0        EQU (0xFFFFEC40) ;- (MATRIX)  Slave Configuration Register 0
AT91C_MATRIX_PRBS7        EQU (0xFFFFECBC) ;- (MATRIX)  PRBS7
AT91C_MATRIX_PRBS4        EQU (0xFFFFECA4) ;- (MATRIX)  PRBS4
AT91C_MATRIX_PRBS2        EQU (0xFFFFEC94) ;- (MATRIX)  PRBS2
AT91C_MATRIX_MCFG5        EQU (0xFFFFEC14) ;- (MATRIX)  Master Configuration Register 5 
AT91C_MATRIX_SCFG7        EQU (0xFFFFEC5C) ;- (MATRIX)  Slave Configuration Register 7
AT91C_MATRIX_PRBS1        EQU (0xFFFFEC8C) ;- (MATRIX)  PRBS1
AT91C_MATRIX_MCFG6        EQU (0xFFFFEC18) ;- (MATRIX)  Master Configuration Register 6 
AT91C_MATRIX_PRBS0        EQU (0xFFFFEC84) ;- (MATRIX)  PRBS0
AT91C_MATRIX_MCFG0        EQU (0xFFFFEC00) ;- (MATRIX)  Master Configuration Register 0 
AT91C_MATRIX_PRAS5        EQU (0xFFFFECA8) ;- (MATRIX)  PRAS5
AT91C_MATRIX_SCFG1        EQU (0xFFFFEC44) ;- (MATRIX)  Slave Configuration Register 1
AT91C_MATRIX_PRAS7        EQU (0xFFFFECB8) ;- (MATRIX)  PRAS7
AT91C_MATRIX_PRAS2        EQU (0xFFFFEC90) ;- (MATRIX)  PRAS2
AT91C_MATRIX_PRAS6        EQU (0xFFFFECB0) ;- (MATRIX)  PRAS6
AT91C_MATRIX_SCFG2        EQU (0xFFFFEC48) ;- (MATRIX)  Slave Configuration Register 2
AT91C_MATRIX_PRBS3        EQU (0xFFFFEC9C) ;- (MATRIX)  PRBS3
/* - ========== Register definition for CCFG peripheral ========== */
AT91C_CCFG_MATRIXVERSION  EQU (0xFFFFEDFC) ;- (CCFG)  Version Register
AT91C_CCFG_TCMR           EQU (0xFFFFED14) ;- (CCFG)  TCM configuration
AT91C_CCFG_EBI0CSA        EQU (0xFFFFED20) ;- (CCFG)  EBI0 Chip Select Assignement Register
AT91C_CCFG_EBI1CSA        EQU (0xFFFFED24) ;- (CCFG)  EBI1 Chip Select Assignement Register
/* - ========== Register definition for PDC_DBGU peripheral ========== */
AT91C_DBGU_PTCR           EQU (0xFFFFEF20) ;- (PDC_DBGU) PDC Transfer Control Register
AT91C_DBGU_RCR            EQU (0xFFFFEF04) ;- (PDC_DBGU) Receive Counter Register
AT91C_DBGU_TCR            EQU (0xFFFFEF0C) ;- (PDC_DBGU) Transmit Counter Register
AT91C_DBGU_RNCR           EQU (0xFFFFEF14) ;- (PDC_DBGU) Receive Next Counter Register
AT91C_DBGU_TNPR           EQU (0xFFFFEF18) ;- (PDC_DBGU) Transmit Next Pointer Register
AT91C_DBGU_RNPR           EQU (0xFFFFEF10) ;- (PDC_DBGU) Receive Next Pointer Register
AT91C_DBGU_PTSR           EQU (0xFFFFEF24) ;- (PDC_DBGU) PDC Transfer Status Register
AT91C_DBGU_RPR            EQU (0xFFFFEF00) ;- (PDC_DBGU) Receive Pointer Register
AT91C_DBGU_TPR            EQU (0xFFFFEF08) ;- (PDC_DBGU) Transmit Pointer Register
AT91C_DBGU_TNCR           EQU (0xFFFFEF1C) ;- (PDC_DBGU) Transmit Next Counter Register
/* - ========== Register definition for DBGU peripheral ========== */
AT91C_DBGU_BRGR           EQU (0xFFFFEE20) ;- (DBGU) Baud Rate Generator Register
AT91C_DBGU_CR             EQU (0xFFFFEE00) ;- (DBGU) Control Register
AT91C_DBGU_THR            EQU (0xFFFFEE1C) ;- (DBGU) Transmitter Holding Register
AT91C_DBGU_IDR            EQU (0xFFFFEE0C) ;- (DBGU) Interrupt Disable Register
AT91C_DBGU_EXID           EQU (0xFFFFEE44) ;- (DBGU) Chip ID Extension Register
AT91C_DBGU_IMR            EQU (0xFFFFEE10) ;- (DBGU) Interrupt Mask Register
AT91C_DBGU_FNTR           EQU (0xFFFFEE48) ;- (DBGU) Force NTRST Register
AT91C_DBGU_IER            EQU (0xFFFFEE08) ;- (DBGU) Interrupt Enable Register
AT91C_DBGU_CSR            EQU (0xFFFFEE14) ;- (DBGU) Channel Status Register
AT91C_DBGU_MR             EQU (0xFFFFEE04) ;- (DBGU) Mode Register
AT91C_DBGU_RHR            EQU (0xFFFFEE18) ;- (DBGU) Receiver Holding Register
AT91C_DBGU_CIDR           EQU (0xFFFFEE40) ;- (DBGU) Chip ID Register
/* - ========== Register definition for AIC peripheral ========== */
AT91C_AIC_IVR             EQU (0xFFFFF100) ;- (AIC) IRQ Vector Register
AT91C_AIC_SMR             EQU (0xFFFFF000) ;- (AIC) Source Mode Register
AT91C_AIC_FVR             EQU (0xFFFFF104) ;- (AIC) FIQ Vector Register
AT91C_AIC_DCR             EQU (0xFFFFF138) ;- (AIC) Debug Control Register (Protect)
AT91C_AIC_EOICR           EQU (0xFFFFF130) ;- (AIC) End of Interrupt Command Register
AT91C_AIC_SVR             EQU (0xFFFFF080) ;- (AIC) Source Vector Register
AT91C_AIC_FFSR            EQU (0xFFFFF148) ;- (AIC) Fast Forcing Status Register
AT91C_AIC_ICCR            EQU (0xFFFFF128) ;- (AIC) Interrupt Clear Command Register
AT91C_AIC_ISR             EQU (0xFFFFF108) ;- (AIC) Interrupt Status Register
AT91C_AIC_IMR             EQU (0xFFFFF110) ;- (AIC) Interrupt Mask Register
AT91C_AIC_IPR             EQU (0xFFFFF10C) ;- (AIC) Interrupt Pending Register
AT91C_AIC_FFER            EQU (0xFFFFF140) ;- (AIC) Fast Forcing Enable Register
AT91C_AIC_IECR            EQU (0xFFFFF120) ;- (AIC) Interrupt Enable Command Register
AT91C_AIC_ISCR            EQU (0xFFFFF12C) ;- (AIC) Interrupt Set Command Register
AT91C_AIC_FFDR            EQU (0xFFFFF144) ;- (AIC) Fast Forcing Disable Register
AT91C_AIC_CISR            EQU (0xFFFFF114) ;- (AIC) Core Interrupt Status Register
AT91C_AIC_IDCR            EQU (0xFFFFF124) ;- (AIC) Interrupt Disable Command Register
AT91C_AIC_SPU             EQU (0xFFFFF134) ;- (AIC) Spurious Vector Register
/* - ========== Register definition for PIOA peripheral ========== */
AT91C_PIOA_OWDR           EQU (0xFFFFF2A4) ;- (PIOA) Output Write Disable Register
AT91C_PIOA_MDDR           EQU (0xFFFFF254) ;- (PIOA) Multi-driver Disable Register
AT91C_PIOA_IFSR           EQU (0xFFFFF228) ;- (PIOA) Input Filter Status Register
AT91C_PIOA_ISR            EQU (0xFFFFF24C) ;- (PIOA) Interrupt Status Register
AT91C_PIOA_CODR           EQU (0xFFFFF234) ;- (PIOA) Clear Output Data Register
AT91C_PIOA_PDR            EQU (0xFFFFF204) ;- (PIOA) PIO Disable Register
AT91C_PIOA_OWSR           EQU (0xFFFFF2A8) ;- (PIOA) Output Write Status Register
AT91C_PIOA_ASR            EQU (0xFFFFF270) ;- (PIOA) Select A Register
AT91C_PIOA_PPUSR          EQU (0xFFFFF268) ;- (PIOA) Pull-up Status Register
AT91C_PIOA_IMR            EQU (0xFFFFF248) ;- (PIOA) Interrupt Mask Register
AT91C_PIOA_OSR            EQU (0xFFFFF218) ;- (PIOA) Output Status Register
AT91C_PIOA_ABSR           EQU (0xFFFFF278) ;- (PIOA) AB Select Status Register
AT91C_PIOA_MDER           EQU (0xFFFFF250) ;- (PIOA) Multi-driver Enable Register
AT91C_PIOA_IFDR           EQU (0xFFFFF224) ;- (PIOA) Input Filter Disable Register
AT91C_PIOA_PDSR           EQU (0xFFFFF23C) ;- (PIOA) Pin Data Status Register
AT91C_PIOA_SODR           EQU (0xFFFFF230) ;- (PIOA) Set Output Data Register
AT91C_PIOA_BSR            EQU (0xFFFFF274) ;- (PIOA) Select B Register
AT91C_PIOA_OWER           EQU (0xFFFFF2A0) ;- (PIOA) Output Write Enable Register
AT91C_PIOA_IFER           EQU (0xFFFFF220) ;- (PIOA) Input Filter Enable Register
AT91C_PIOA_IDR            EQU (0xFFFFF244) ;- (PIOA) Interrupt Disable Register
AT91C_PIOA_ODR            EQU (0xFFFFF214) ;- (PIOA) Output Disable Registerr
AT91C_PIOA_IER            EQU (0xFFFFF240) ;- (PIOA) Interrupt Enable Register
AT91C_PIOA_PPUER          EQU (0xFFFFF264) ;- (PIOA) Pull-up Enable Register
AT91C_PIOA_MDSR           EQU (0xFFFFF258) ;- (PIOA) Multi-driver Status Register
AT91C_PIOA_OER            EQU (0xFFFFF210) ;- (PIOA) Output Enable Register
AT91C_PIOA_PER            EQU (0xFFFFF200) ;- (PIOA) PIO Enable Register
AT91C_PIOA_PPUDR          EQU (0xFFFFF260) ;- (PIOA) Pull-up Disable Register
AT91C_PIOA_ODSR           EQU (0xFFFFF238) ;- (PIOA) Output Data Status Register
AT91C_PIOA_PSR            EQU (0xFFFFF208) ;- (PIOA) PIO Status Register
/* - ========== Register definition for PIOB peripheral ========== */
AT91C_PIOB_ODR            EQU (0xFFFFF414) ;- (PIOB) Output Disable Registerr
AT91C_PIOB_SODR           EQU (0xFFFFF430) ;- (PIOB) Set Output Data Register
AT91C_PIOB_ISR            EQU (0xFFFFF44C) ;- (PIOB) Interrupt Status Register
AT91C_PIOB_ABSR           EQU (0xFFFFF478) ;- (PIOB) AB Select Status Register
AT91C_PIOB_IER            EQU (0xFFFFF440) ;- (PIOB) Interrupt Enable Register
AT91C_PIOB_PPUDR          EQU (0xFFFFF460) ;- (PIOB) Pull-up Disable Register
AT91C_PIOB_IMR            EQU (0xFFFFF448) ;- (PIOB) Interrupt Mask Register
AT91C_PIOB_PER            EQU (0xFFFFF400) ;- (PIOB) PIO Enable Register
AT91C_PIOB_IFDR           EQU (0xFFFFF424) ;- (PIOB) Input Filter Disable Register
AT91C_PIOB_OWDR           EQU (0xFFFFF4A4) ;- (PIOB) Output Write Disable Register
AT91C_PIOB_MDSR           EQU (0xFFFFF458) ;- (PIOB) Multi-driver Status Register
AT91C_PIOB_IDR            EQU (0xFFFFF444) ;- (PIOB) Interrupt Disable Register
AT91C_PIOB_ODSR           EQU (0xFFFFF438) ;- (PIOB) Output Data Status Register
AT91C_PIOB_PPUSR          EQU (0xFFFFF468) ;- (PIOB) Pull-up Status Register
AT91C_PIOB_OWSR           EQU (0xFFFFF4A8) ;- (PIOB) Output Write Status Register
AT91C_PIOB_BSR            EQU (0xFFFFF474) ;- (PIOB) Select B Register
AT91C_PIOB_OWER           EQU (0xFFFFF4A0) ;- (PIOB) Output Write Enable Register
AT91C_PIOB_IFER           EQU (0xFFFFF420) ;- (PIOB) Input Filter Enable Register
AT91C_PIOB_PDSR           EQU (0xFFFFF43C) ;- (PIOB) Pin Data Status Register
AT91C_PIOB_PPUER          EQU (0xFFFFF464) ;- (PIOB) Pull-up Enable Register
AT91C_PIOB_OSR            EQU (0xFFFFF418) ;- (PIOB) Output Status Register
AT91C_PIOB_ASR            EQU (0xFFFFF470) ;- (PIOB) Select A Register
AT91C_PIOB_MDDR           EQU (0xFFFFF454) ;- (PIOB) Multi-driver Disable Register
AT91C_PIOB_CODR           EQU (0xFFFFF434) ;- (PIOB) Clear Output Data Register
AT91C_PIOB_MDER           EQU (0xFFFFF450) ;- (PIOB) Multi-driver Enable Register
AT91C_PIOB_PDR            EQU (0xFFFFF404) ;- (PIOB) PIO Disable Register
AT91C_PIOB_IFSR           EQU (0xFFFFF428) ;- (PIOB) Input Filter Status Register
AT91C_PIOB_OER            EQU (0xFFFFF410) ;- (PIOB) Output Enable Register
AT91C_PIOB_PSR            EQU (0xFFFFF408) ;- (PIOB) PIO Status Register
/* - ========== Register definition for PIOC peripheral ========== */
AT91C_PIOC_OWDR           EQU (0xFFFFF6A4) ;- (PIOC) Output Write Disable Register
AT91C_PIOC_MDER           EQU (0xFFFFF650) ;- (PIOC) Multi-driver Enable Register
AT91C_PIOC_PPUSR          EQU (0xFFFFF668) ;- (PIOC) Pull-up Status Register
AT91C_PIOC_IMR            EQU (0xFFFFF648) ;- (PIOC) Interrupt Mask Register
AT91C_PIOC_ASR            EQU (0xFFFFF670) ;- (PIOC) Select A Register
AT91C_PIOC_PPUDR          EQU (0xFFFFF660) ;- (PIOC) Pull-up Disable Register
AT91C_PIOC_PSR            EQU (0xFFFFF608) ;- (PIOC) PIO Status Register
AT91C_PIOC_IER            EQU (0xFFFFF640) ;- (PIOC) Interrupt Enable Register
AT91C_PIOC_CODR           EQU (0xFFFFF634) ;- (PIOC) Clear Output Data Register
AT91C_PIOC_OWER           EQU (0xFFFFF6A0) ;- (PIOC) Output Write Enable Register
AT91C_PIOC_ABSR           EQU (0xFFFFF678) ;- (PIOC) AB Select Status Register
AT91C_PIOC_IFDR           EQU (0xFFFFF624) ;- (PIOC) Input Filter Disable Register
AT91C_PIOC_PDSR           EQU (0xFFFFF63C) ;- (PIOC) Pin Data Status Register
AT91C_PIOC_IDR            EQU (0xFFFFF644) ;- (PIOC) Interrupt Disable Register
AT91C_PIOC_OWSR           EQU (0xFFFFF6A8) ;- (PIOC) Output Write Status Register
AT91C_PIOC_PDR            EQU (0xFFFFF604) ;- (PIOC) PIO Disable Register
AT91C_PIOC_ODR            EQU (0xFFFFF614) ;- (PIOC) Output Disable Registerr
AT91C_PIOC_IFSR           EQU (0xFFFFF628) ;- (PIOC) Input Filter Status Register
AT91C_PIOC_PPUER          EQU (0xFFFFF664) ;- (PIOC) Pull-up Enable Register
AT91C_PIOC_SODR           EQU (0xFFFFF630) ;- (PIOC) Set Output Data Register
AT91C_PIOC_ISR            EQU (0xFFFFF64C) ;- (PIOC) Interrupt Status Register
AT91C_PIOC_ODSR           EQU (0xFFFFF638) ;- (PIOC) Output Data Status Register
AT91C_PIOC_OSR            EQU (0xFFFFF618) ;- (PIOC) Output Status Register
AT91C_PIOC_MDSR           EQU (0xFFFFF658) ;- (PIOC) Multi-driver Status Register
AT91C_PIOC_IFER           EQU (0xFFFFF620) ;- (PIOC) Input Filter Enable Register
AT91C_PIOC_BSR            EQU (0xFFFFF674) ;- (PIOC) Select B Register
AT91C_PIOC_MDDR           EQU (0xFFFFF654) ;- (PIOC) Multi-driver Disable Register
AT91C_PIOC_OER            EQU (0xFFFFF610) ;- (PIOC) Output Enable Register
AT91C_PIOC_PER            EQU (0xFFFFF600) ;- (PIOC) PIO Enable Register
/* - ========== Register definition for PIOD peripheral ========== */
AT91C_PIOD_OWDR           EQU (0xFFFFF8A4) ;- (PIOD) Output Write Disable Register
AT91C_PIOD_SODR           EQU (0xFFFFF830) ;- (PIOD) Set Output Data Register
AT91C_PIOD_PPUER          EQU (0xFFFFF864) ;- (PIOD) Pull-up Enable Register
AT91C_PIOD_CODR           EQU (0xFFFFF834) ;- (PIOD) Clear Output Data Register
AT91C_PIOD_PSR            EQU (0xFFFFF808) ;- (PIOD) PIO Status Register
AT91C_PIOD_PDR            EQU (0xFFFFF804) ;- (PIOD) PIO Disable Register
AT91C_PIOD_ODR            EQU (0xFFFFF814) ;- (PIOD) Output Disable Registerr
AT91C_PIOD_PPUSR          EQU (0xFFFFF868) ;- (PIOD) Pull-up Status Register
AT91C_PIOD_ABSR           EQU (0xFFFFF878) ;- (PIOD) AB Select Status Register
AT91C_PIOD_IFSR           EQU (0xFFFFF828) ;- (PIOD) Input Filter Status Register
AT91C_PIOD_OER            EQU (0xFFFFF810) ;- (PIOD) Output Enable Register
AT91C_PIOD_IMR            EQU (0xFFFFF848) ;- (PIOD) Interrupt Mask Register
AT91C_PIOD_ASR            EQU (0xFFFFF870) ;- (PIOD) Select A Register
AT91C_PIOD_MDDR           EQU (0xFFFFF854) ;- (PIOD) Multi-driver Disable Register
AT91C_PIOD_OWSR           EQU (0xFFFFF8A8) ;- (PIOD) Output Write Status Register
AT91C_PIOD_PER            EQU (0xFFFFF800) ;- (PIOD) PIO Enable Register
AT91C_PIOD_IDR            EQU (0xFFFFF844) ;- (PIOD) Interrupt Disable Register
AT91C_PIOD_MDER           EQU (0xFFFFF850) ;- (PIOD) Multi-driver Enable Register
AT91C_PIOD_PDSR           EQU (0xFFFFF83C) ;- (PIOD) Pin Data Status Register
AT91C_PIOD_MDSR           EQU (0xFFFFF858) ;- (PIOD) Multi-driver Status Register
AT91C_PIOD_OWER           EQU (0xFFFFF8A0) ;- (PIOD) Output Write Enable Register
AT91C_PIOD_BSR            EQU (0xFFFFF874) ;- (PIOD) Select B Register
AT91C_PIOD_PPUDR          EQU (0xFFFFF860) ;- (PIOD) Pull-up Disable Register
AT91C_PIOD_IFDR           EQU (0xFFFFF824) ;- (PIOD) Input Filter Disable Register
AT91C_PIOD_IER            EQU (0xFFFFF840) ;- (PIOD) Interrupt Enable Register
AT91C_PIOD_OSR            EQU (0xFFFFF818) ;- (PIOD) Output Status Register
AT91C_PIOD_ODSR           EQU (0xFFFFF838) ;- (PIOD) Output Data Status Register
