una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
AT91C_PIOD_ISR            EQU (0xFFFFF84C) ;- (PIOD) Interrupt Status Register
AT91C_PIOD_IFER           EQU (0xFFFFF820) ;- (PIOD) Input Filter Enable Register
/* - ========== Register definition for PIOE peripheral ========== */
AT91C_PIOE_ODSR           EQU (0xFFFFFA38) ;- (PIOE) Output Data Status Register
AT91C_PIOE_ABSR           EQU (0xFFFFFA78) ;- (PIOE) AB Select Status Register
AT91C_PIOE_PSR            EQU (0xFFFFFA08) ;- (PIOE) PIO Status Register
AT91C_PIOE_PPUDR          EQU (0xFFFFFA60) ;- (PIOE) Pull-up Disable Register
AT91C_PIOE_OER            EQU (0xFFFFFA10) ;- (PIOE) Output Enable Register
AT91C_PIOE_OWDR           EQU (0xFFFFFAA4) ;- (PIOE) Output Write Disable Register
AT91C_PIOE_PER            EQU (0xFFFFFA00) ;- (PIOE) PIO Enable Register
AT91C_PIOE_IFSR           EQU (0xFFFFFA28) ;- (PIOE) Input Filter Status Register
AT91C_PIOE_IFER           EQU (0xFFFFFA20) ;- (PIOE) Input Filter Enable Register
AT91C_PIOE_ODR            EQU (0xFFFFFA14) ;- (PIOE) Output Disable Registerr
AT91C_PIOE_PPUSR          EQU (0xFFFFFA68) ;- (PIOE) Pull-up Status Register
AT91C_PIOE_IFDR           EQU (0xFFFFFA24) ;- (PIOE) Input Filter Disable Register
AT91C_PIOE_PDSR           EQU (0xFFFFFA3C) ;- (PIOE) Pin Data Status Register
AT91C_PIOE_PPUER          EQU (0xFFFFFA64) ;- (PIOE) Pull-up Enable Register
AT91C_PIOE_IDR            EQU (0xFFFFFA44) ;- (PIOE) Interrupt Disable Register
AT91C_PIOE_MDDR           EQU (0xFFFFFA54) ;- (PIOE) Multi-driver Disable Register
AT91C_PIOE_ISR            EQU (0xFFFFFA4C) ;- (PIOE) Interrupt Status Register
AT91C_PIOE_OSR            EQU (0xFFFFFA18) ;- (PIOE) Output Status Register
AT91C_PIOE_CODR           EQU (0xFFFFFA34) ;- (PIOE) Clear Output Data Register
AT91C_PIOE_MDSR           EQU (0xFFFFFA58) ;- (PIOE) Multi-driver Status Register
AT91C_PIOE_PDR            EQU (0xFFFFFA04) ;- (PIOE) PIO Disable Register
AT91C_PIOE_IER            EQU (0xFFFFFA40) ;- (PIOE) Interrupt Enable Register
AT91C_PIOE_OWSR           EQU (0xFFFFFAA8) ;- (PIOE) Output Write Status Register
AT91C_PIOE_BSR            EQU (0xFFFFFA74) ;- (PIOE) Select B Register
AT91C_PIOE_ASR            EQU (0xFFFFFA70) ;- (PIOE) Select A Register
AT91C_PIOE_SODR           EQU (0xFFFFFA30) ;- (PIOE) Set Output Data Register
AT91C_PIOE_IMR            EQU (0xFFFFFA48) ;- (PIOE) Interrupt Mask Register
AT91C_PIOE_OWER           EQU (0xFFFFFAA0) ;- (PIOE) Output Write Enable Register
AT91C_PIOE_MDER           EQU (0xFFFFFA50) ;- (PIOE) Multi-driver Enable Register
/* - ========== Register definition for CKGR peripheral ========== */
AT91C_CKGR_MOR            EQU (0xFFFFFC20) ;- (CKGR) Main Oscillator Register
AT91C_CKGR_PLLBR          EQU (0xFFFFFC2C) ;- (CKGR) PLL B Register
AT91C_CKGR_MCFR           EQU (0xFFFFFC24) ;- (CKGR) Main Clock  Frequency Register
AT91C_CKGR_PLLAR          EQU (0xFFFFFC28) ;- (CKGR) PLL A Register
/* - ========== Register definition for PMC peripheral ========== */
AT91C_PMC_PCER            EQU (0xFFFFFC10) ;- (PMC) Peripheral Clock Enable Register
AT91C_PMC_PCKR            EQU (0xFFFFFC40) ;- (PMC) Programmable Clock Register
AT91C_PMC_MCKR            EQU (0xFFFFFC30) ;- (PMC) Master Clock Register
AT91C_PMC_PLLAR           EQU (0xFFFFFC28) ;- (PMC) PLL A Register
AT91C_PMC_PCDR            EQU (0xFFFFFC14) ;- (PMC) Peripheral Clock Disable Register
AT91C_PMC_SCSR            EQU (0xFFFFFC08) ;- (PMC) System Clock Status Register
AT91C_PMC_MCFR            EQU (0xFFFFFC24) ;- (PMC) Main Clock  Frequency Register
AT91C_PMC_IMR             EQU (0xFFFFFC6C) ;- (PMC) Interrupt Mask Register
AT91C_PMC_IER             EQU (0xFFFFFC60) ;- (PMC) Interrupt Enable Register
AT91C_PMC_MOR             EQU (0xFFFFFC20) ;- (PMC) Main Oscillator Register
AT91C_PMC_IDR             EQU (0xFFFFFC64) ;- (PMC) Interrupt Disable Register
AT91C_PMC_PLLBR           EQU (0xFFFFFC2C) ;- (PMC) PLL B Register
AT91C_PMC_SCDR            EQU (0xFFFFFC04) ;- (PMC) System Clock Disable Register
AT91C_PMC_PCSR            EQU (0xFFFFFC18) ;- (PMC) Peripheral Clock Status Register
AT91C_PMC_SCER            EQU (0xFFFFFC00) ;- (PMC) System Clock Enable Register
AT91C_PMC_SR              EQU (0xFFFFFC68) ;- (PMC) Status Register
/* - ========== Register definition for RSTC peripheral ========== */
AT91C_RSTC_RCR            EQU (0xFFFFFD00) ;- (RSTC) Reset Control Register
AT91C_RSTC_RMR            EQU (0xFFFFFD08) ;- (RSTC) Reset Mode Register
AT91C_RSTC_RSR            EQU (0xFFFFFD04) ;- (RSTC) Reset Status Register
/* - ========== Register definition for SHDWC peripheral ========== */
AT91C_SHDWC_SHSR          EQU (0xFFFFFD18) ;- (SHDWC) Shut Down Status Register
AT91C_SHDWC_SHMR          EQU (0xFFFFFD14) ;- (SHDWC) Shut Down Mode Register
AT91C_SHDWC_SHCR          EQU (0xFFFFFD10) ;- (SHDWC) Shut Down Control Register
/* - ========== Register definition for RTTC0 peripheral ========== */
AT91C_RTTC0_RTSR          EQU (0xFFFFFD2C) ;- (RTTC0) Real-time Status Register
AT91C_RTTC0_RTMR          EQU (0xFFFFFD20) ;- (RTTC0) Real-time Mode Register
AT91C_RTTC0_RTVR          EQU (0xFFFFFD28) ;- (RTTC0) Real-time Value Register
AT91C_RTTC0_RTAR          EQU (0xFFFFFD24) ;- (RTTC0) Real-time Alarm Register
/* - ========== Register definition for RTTC1 peripheral ========== */
AT91C_RTTC1_RTAR          EQU (0xFFFFFD54) ;- (RTTC1) Real-time Alarm Register
AT91C_RTTC1_RTSR          EQU (0xFFFFFD5C) ;- (RTTC1) Real-time Status Register
AT91C_RTTC1_RTVR          EQU (0xFFFFFD58) ;- (RTTC1) Real-time Value Register
AT91C_RTTC1_RTMR          EQU (0xFFFFFD50) ;- (RTTC1) Real-time Mode Register
/* - ========== Register definition for PITC peripheral ========== */
AT91C_PITC_PIVR           EQU (0xFFFFFD38) ;- (PITC) Period Interval Value Register
AT91C_PITC_PISR           EQU (0xFFFFFD34) ;- (PITC) Period Interval Status Register
AT91C_PITC_PIIR           EQU (0xFFFFFD3C) ;- (PITC) Period Interval Image Register
AT91C_PITC_PIMR           EQU (0xFFFFFD30) ;- (PITC) Period Interval Mode Register
/* - ========== Register definition for WDTC peripheral ========== */
AT91C_WDTC_WDCR           EQU (0xFFFFFD40) ;- (WDTC) Watchdog Control Register
AT91C_WDTC_WDSR           EQU (0xFFFFFD48) ;- (WDTC) Watchdog Status Register
AT91C_WDTC_WDMR           EQU (0xFFFFFD44) ;- (WDTC) Watchdog Mode Register
/* - ========== Register definition for TC0 peripheral ========== */
AT91C_TC0_IER             EQU (0xFFF7C024) ;- (TC0) Interrupt Enable Register
AT91C_TC0_IMR             EQU (0xFFF7C02C) ;- (TC0) Interrupt Mask Register
AT91C_TC0_CCR             EQU (0xFFF7C000) ;- (TC0) Channel Control Register
AT91C_TC0_RB              EQU (0xFFF7C018) ;- (TC0) Register B
AT91C_TC0_CV              EQU (0xFFF7C010) ;- (TC0) Counter Value
AT91C_TC0_SR              EQU (0xFFF7C020) ;- (TC0) Status Register
AT91C_TC0_CMR             EQU (0xFFF7C004) ;- (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC0_RA              EQU (0xFFF7C014) ;- (TC0) Register A
AT91C_TC0_RC              EQU (0xFFF7C01C) ;- (TC0) Register C
AT91C_TC0_IDR             EQU (0xFFF7C028) ;- (TC0) Interrupt Disable Register
/* - ========== Register definition for TC1 peripheral ========== */
AT91C_TC1_IER             EQU (0xFFF7C064) ;- (TC1) Interrupt Enable Register
AT91C_TC1_SR              EQU (0xFFF7C060) ;- (TC1) Status Register
AT91C_TC1_RC              EQU (0xFFF7C05C) ;- (TC1) Register C
AT91C_TC1_CV              EQU (0xFFF7C050) ;- (TC1) Counter Value
AT91C_TC1_RA              EQU (0xFFF7C054) ;- (TC1) Register A
AT91C_TC1_CMR             EQU (0xFFF7C044) ;- (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC1_IDR             EQU (0xFFF7C068) ;- (TC1) Interrupt Disable Register
AT91C_TC1_RB              EQU (0xFFF7C058) ;- (TC1) Register B
AT91C_TC1_IMR             EQU (0xFFF7C06C) ;- (TC1) Interrupt Mask Register
AT91C_TC1_CCR             EQU (0xFFF7C040) ;- (TC1) Channel Control Register
/* - ========== Register definition for TC2 peripheral ========== */
AT91C_TC2_SR              EQU (0xFFF7C0A0) ;- (TC2) Status Register
AT91C_TC2_IMR             EQU (0xFFF7C0AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_IER             EQU (0xFFF7C0A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_CV              EQU (0xFFF7C090) ;- (TC2) Counter Value
AT91C_TC2_RB              EQU (0xFFF7C098) ;- (TC2) Register B
AT91C_TC2_CCR             EQU (0xFFF7C080) ;- (TC2) Channel Control Register
AT91C_TC2_CMR             EQU (0xFFF7C084) ;- (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC2_RA              EQU (0xFFF7C094) ;- (TC2) Register A
AT91C_TC2_IDR             EQU (0xFFF7C0A8) ;- (TC2) Interrupt Disable Register
AT91C_TC2_RC              EQU (0xFFF7C09C) ;- (TC2) Register C
/* - ========== Register definition for TCB0 peripheral ========== */
AT91C_TCB0_BCR            EQU (0xFFF7C0C0) ;- (TCB0) TC Block Control Register
AT91C_TCB0_BMR            EQU (0xFFF7C0C4) ;- (TCB0) TC Block Mode Register
/* - ========== Register definition for TCB1 peripheral ========== */
AT91C_TCB1_BMR            EQU (0xFFF7C104) ;- (TCB1) TC Block Mode Register
AT91C_TCB1_BCR            EQU (0xFFF7C100) ;- (TCB1) TC Block Control Register
/* - ========== Register definition for TCB2 peripheral ========== */
AT91C_TCB2_BCR            EQU (0xFFF7C140) ;- (TCB2) TC Block Control Register
AT91C_TCB2_BMR            EQU (0xFFF7C144) ;- (TCB2) TC Block Mode Register
/* - ========== Register definition for PDC_MCI0 peripheral ========== */
AT91C_MCI0_TCR            EQU (0xFFF8010C) ;- (PDC_MCI0) Transmit Counter Register
AT91C_MCI0_TNCR           EQU (0xFFF8011C) ;- (PDC_MCI0) Transmit Next Counter Register
AT91C_MCI0_RNPR           EQU (0xFFF80110) ;- (PDC_MCI0) Receive Next Pointer Register
AT91C_MCI0_TPR            EQU (0xFFF80108) ;- (PDC_MCI0) Transmit Pointer Register
AT91C_MCI0_TNPR           EQU (0xFFF80118) ;- (PDC_MCI0) Transmit Next Pointer Register
AT91C_MCI0_PTSR           EQU (0xFFF80124) ;- (PDC_MCI0) PDC Transfer Status Register
AT91C_MCI0_RCR            EQU (0xFFF80104) ;- (PDC_MCI0) Receive Counter Register
AT91C_MCI0_PTCR           EQU (0xFFF80120) ;- (PDC_MCI0) PDC Transfer Control Register
AT91C_MCI0_RPR            EQU (0xFFF80100) ;- (PDC_MCI0) Receive Pointer Register
AT91C_MCI0_RNCR           EQU (0xFFF80114) ;- (PDC_MCI0) Receive Next Counter Register
/* - ========== Register definition for MCI0 peripheral ========== */
AT91C_MCI0_CMDR           EQU (0xFFF80014) ;- (MCI0) MCI Command Register
AT91C_MCI0_IMR            EQU (0xFFF8004C) ;- (MCI0) MCI Interrupt Mask Register
AT91C_MCI0_MR             EQU (0xFFF80004) ;- (MCI0) MCI Mode Register
AT91C_MCI0_CR             EQU (0xFFF80000) ;- (MCI0) MCI Control Register
AT91C_MCI0_IER            EQU (0xFFF80044) ;- (MCI0) MCI Interrupt Enable Register
AT91C_MCI0_RDR            EQU (0xFFF80030) ;- (MCI0) MCI Receive Data Register
AT91C_MCI0_SR             EQU (0xFFF80040) ;- (MCI0) MCI Status Register
AT91C_MCI0_DTOR           EQU (0xFFF80008) ;- (MCI0) MCI Data Timeout Register
AT91C_MCI0_SDCR           EQU (0xFFF8000C) ;- (MCI0) MCI SD Card Register
AT91C_MCI0_BLKR           EQU (0xFFF80018) ;- (MCI0) MCI Block Register
AT91C_MCI0_VR             EQU (0xFFF800FC) ;- (MCI0) MCI Version Register
AT91C_MCI0_TDR            EQU (0xFFF80034) ;- (MCI0) MCI Transmit Data Register
AT91C_MCI0_ARGR           EQU (0xFFF80010) ;- (MCI0) MCI Argument Register
AT91C_MCI0_RSPR           EQU (0xFFF80020) ;- (MCI0) MCI Response Register
AT91C_MCI0_IDR            EQU (0xFFF80048) ;- (MCI0) MCI Interrupt Disable Register
/* - ========== Register definition for PDC_MCI1 peripheral ========== */
AT91C_MCI1_PTCR           EQU (0xFFF84120) ;- (PDC_MCI1) PDC Transfer Control Register
AT91C_MCI1_PTSR           EQU (0xFFF84124) ;- (PDC_MCI1) PDC Transfer Status Register
AT91C_MCI1_TPR            EQU (0xFFF84108) ;- (PDC_MCI1) Transmit Pointer Register
AT91C_MCI1_RPR            EQU (0xFFF84100) ;- (PDC_MCI1) Receive Pointer Register
AT91C_MCI1_TNCR           EQU (0xFFF8411C) ;- (PDC_MCI1) Transmit Next Counter Register
AT91C_MCI1_RCR            EQU (0xFFF84104) ;- (PDC_MCI1) Receive Counter Register
AT91C_MCI1_TNPR           EQU (0xFFF84118) ;- (PDC_MCI1) Transmit Next Pointer Register
AT91C_MCI1_TCR            EQU (0xFFF8410C) ;- (PDC_MCI1) Transmit Counter Register
AT91C_MCI1_RNPR           EQU (0xFFF84110) ;- (PDC_MCI1) Receive Next Pointer Register
AT91C_MCI1_RNCR           EQU (0xFFF84114) ;- (PDC_MCI1) Receive Next Counter Register
/* - ========== Register definition for MCI1 peripheral ========== */
AT91C_MCI1_SR             EQU (0xFFF84040) ;- (MCI1) MCI Status Register
AT91C_MCI1_RDR            EQU (0xFFF84030) ;- (MCI1) MCI Receive Data Register
AT91C_MCI1_RSPR           EQU (0xFFF84020) ;- (MCI1) MCI Response Register
AT91C_MCI1_CMDR           EQU (0xFFF84014) ;- (MCI1) MCI Command Register
AT91C_MCI1_IMR            EQU (0xFFF8404C) ;- (MCI1) MCI Interrupt Mask Register
AT91C_MCI1_DTOR           EQU (0xFFF84008) ;- (MCI1) MCI Data Timeout Register
AT91C_MCI1_SDCR           EQU (0xFFF8400C) ;- (MCI1) MCI SD Card Register
AT91C_MCI1_IDR            EQU (0xFFF84048) ;- (MCI1) MCI Interrupt Disable Register
AT91C_MCI1_ARGR           EQU (0xFFF84010) ;- (MCI1) MCI Argument Register
AT91C_MCI1_TDR            EQU (0xFFF84034) ;- (MCI1) MCI Transmit Data Register
AT91C_MCI1_BLKR           EQU (0xFFF84018) ;- (MCI1) MCI Block Register
AT91C_MCI1_VR             EQU (0xFFF840FC) ;- (MCI1) MCI Version Register
AT91C_MCI1_CR             EQU (0xFFF84000) ;- (MCI1) MCI Control Register
AT91C_MCI1_MR             EQU (0xFFF84004) ;- (MCI1) MCI Mode Register
AT91C_MCI1_IER            EQU (0xFFF84044) ;- (MCI1) MCI Interrupt Enable Register
/* - ========== Register definition for TWI peripheral ========== */
AT91C_TWI_IDR             EQU (0xFFF88028) ;- (TWI) Interrupt Disable Register
AT91C_TWI_RHR             EQU (0xFFF88030) ;- (TWI) Receive Holding Register
AT91C_TWI_IMR             EQU (0xFFF8802C) ;- (TWI) Interrupt Mask Register
AT91C_TWI_THR             EQU (0xFFF88034) ;- (TWI) Transmit Holding Register
AT91C_TWI_IER             EQU (0xFFF88024) ;- (TWI) Interrupt Enable Register
AT91C_TWI_IADR            EQU (0xFFF8800C) ;- (TWI) Internal Address Register
AT91C_TWI_SMR             EQU (0xFFF88008) ;- (TWI) Slave Mode Register
AT91C_TWI_MMR             EQU (0xFFF88004) ;- (TWI) Master Mode Register
AT91C_TWI_CR              EQU (0xFFF88000) ;- (TWI) Control Register
AT91C_TWI_SR              EQU (0xFFF88020) ;- (TWI) Status Register
AT91C_TWI_CWGR            EQU (0xFFF88010) ;- (TWI) Clock Waveform Generator Register
/* - ========== Register definition for PDC_US0 peripheral ========== */
AT91C_US0_TNPR            EQU (0xFFF8C118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_PTSR            EQU (0xFFF8C124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_PTCR            EQU (0xFFF8C120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_RNCR            EQU (0xFFF8C114) ;- (PDC_US0) Receive Next Counter Register
AT91C_US0_RCR             EQU (0xFFF8C104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_TNCR            EQU (0xFFF8C11C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_TCR             EQU (0xFFF8C10C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_RNPR            EQU (0xFFF8C110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_RPR             EQU (0xFFF8C100) ;- (PDC_US0) Receive Pointer Register
AT91C_US0_TPR             EQU (0xFFF8C108) ;- (PDC_US0) Transmit Pointer Register
/* - ========== Register definition for US0 peripheral ========== */
AT91C_US0_RTOR            EQU (0xFFF8C024) ;- (US0) Receiver Time-out Register
AT91C_US0_NER             EQU (0xFFF8C044) ;- (US0) Nb Errors Register
AT91C_US0_THR             EQU (0xFFF8C01C) ;- (US0) Transmitter Holding Register
AT91C_US0_MR              EQU (0xFFF8C004) ;- (US0) Mode Register
AT91C_US0_RHR             EQU (0xFFF8C018) ;- (US0) Receiver Holding Register
AT91C_US0_CSR             EQU (0xFFF8C014) ;- (US0) Channel Status Register
AT91C_US0_IMR             EQU (0xFFF8C010) ;- (US0) Interrupt Mask Register
AT91C_US0_IDR             EQU (0xFFF8C00C) ;- (US0) Interrupt Disable Register
AT91C_US0_FIDI            EQU (0xFFF8C040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_CR              EQU (0xFFF8C000) ;- (US0) Control Register
AT91C_US0_IER             EQU (0xFFF8C008) ;- (US0) Interrupt Enable Register
AT91C_US0_TTGR            EQU (0xFFF8C028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_BRGR            EQU (0xFFF8C020) ;- (US0) Baud Rate Generator Register
AT91C_US0_IF              EQU (0xFFF8C04C) ;- (US0) IRDA_FILTER Register
/* - ========== Register definition for PDC_US1 peripheral ========== */
AT91C_US1_PTCR            EQU (0xFFF90120) ;- (PDC_US1) PDC Transfer Control Register
AT91C_US1_TNCR            EQU (0xFFF9011C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_RCR             EQU (0xFFF90104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_RPR             EQU (0xFFF90100) ;- (PDC_US1) Receive Pointer Register
AT91C_US1_TPR             EQU (0xFFF90108) ;- (PDC_US1) Transmit Pointer Register
AT91C_US1_TCR             EQU (0xFFF9010C) ;- (PDC_US1) Transmit Counter Register
AT91C_US1_RNPR            EQU (0xFFF90110) ;- (PDC_US1) Receive Next Pointer Register
AT91C_US1_TNPR            EQU (0xFFF90118) ;- (PDC_US1) Transmit Next Pointer Register
AT91C_US1_RNCR            EQU (0xFFF90114) ;- (PDC_US1) Receive Next Counter Register
AT91C_US1_PTSR            EQU (0xFFF90124) ;- (PDC_US1) PDC Transfer Status Register
/* - ========== Register definition for US1 peripheral ========== */
AT91C_US1_NER             EQU (0xFFF90044) ;- (US1) Nb Errors Register
AT91C_US1_RHR             EQU (0xFFF90018) ;- (US1) Receiver Holding Register
AT91C_US1_RTOR            EQU (0xFFF90024) ;- (US1) Receiver Time-out Register
AT91C_US1_IER             EQU (0xFFF90008) ;- (US1) Interrupt Enable Register
AT91C_US1_IF              EQU (0xFFF9004C) ;- (US1) IRDA_FILTER Register
AT91C_US1_CR              EQU (0xFFF90000) ;- (US1) Control Register
AT91C_US1_IMR             EQU (0xFFF90010) ;- (US1) Interrupt Mask Register
AT91C_US1_TTGR            EQU (0xFFF90028) ;- (US1) Transmitter Time-guard Register
AT91C_US1_MR              EQU (0xFFF90004) ;- (US1) Mode Register
AT91C_US1_IDR             EQU (0xFFF9000C) ;- (US1) Interrupt Disable Register
AT91C_US1_FIDI            EQU (0xFFF90040) ;- (US1) FI_DI_Ratio Register
AT91C_US1_CSR             EQU (0xFFF90014) ;- (US1) Channel Status Register
AT91C_US1_THR             EQU (0xFFF9001C) ;- (US1) Transmitter Holding Register
AT91C_US1_BRGR            EQU (0xFFF90020) ;- (US1) Baud Rate Generator Register
/* - ========== Register definition for PDC_US2 peripheral ========== */
AT91C_US2_RNCR            EQU (0xFFF94114) ;- (PDC_US2) Receive Next Counter Register
AT91C_US2_PTCR            EQU (0xFFF94120) ;- (PDC_US2) PDC Transfer Control Register
AT91C_US2_TNPR            EQU (0xFFF94118) ;- (PDC_US2) Transmit Next Pointer Register
AT91C_US2_TNCR            EQU (0xFFF9411C) ;- (PDC_US2) Transmit Next Counter Register
AT91C_US2_TPR             EQU (0xFFF94108) ;- (PDC_US2) Transmit Pointer Register
AT91C_US2_RCR             EQU (0xFFF94104) ;- (PDC_US2) Receive Counter Register
AT91C_US2_PTSR            EQU (0xFFF94124) ;- (PDC_US2) PDC Transfer Status Register
AT91C_US2_TCR             EQU (0xFFF9410C) ;- (PDC_US2) Transmit Counter Register
AT91C_US2_RPR             EQU (0xFFF94100) ;- (PDC_US2) Receive Pointer Register
AT91C_US2_RNPR            EQU (0xFFF94110) ;- (PDC_US2) Receive Next Pointer Register
/* - ========== Register definition for US2 peripheral ========== */
AT91C_US2_TTGR            EQU (0xFFF94028) ;- (US2) Transmitter Time-guard Register
AT91C_US2_RHR             EQU (0xFFF94018) ;- (US2) Receiver Holding Register
AT91C_US2_IMR             EQU (0xFFF94010) ;- (US2) Interrupt Mask Register
AT91C_US2_IER             EQU (0xFFF94008) ;- (US2) Interrupt Enable Register
AT91C_US2_NER             EQU (0xFFF94044) ;- (US2) Nb Errors Register
AT91C_US2_CR              EQU (0xFFF94000) ;- (US2) Control Register
AT91C_US2_FIDI            EQU (0xFFF94040) ;- (US2) FI_DI_Ratio Register
AT91C_US2_MR              EQU (0xFFF94004) ;- (US2) Mode Register
AT91C_US2_IDR             EQU (0xFFF9400C) ;- (US2) Interrupt Disable Register
AT91C_US2_THR             EQU (0xFFF9401C) ;- (US2) Transmitter Holding Register
AT91C_US2_IF              EQU (0xFFF9404C) ;- (US2) IRDA_FILTER Register
AT91C_US2_BRGR            EQU (0xFFF94020) ;- (US2) Baud Rate Generator Register
AT91C_US2_CSR             EQU (0xFFF94014) ;- (US2) Channel Status Register
AT91C_US2_RTOR            EQU (0xFFF94024) ;- (US2) Receiver Time-out Register
/* - ========== Register definition for PDC_SSC0 peripheral ========== */
AT91C_SSC0_PTSR           EQU (0xFFF98124) ;- (PDC_SSC0) PDC Transfer Status Register
AT91C_SSC0_TCR            EQU (0xFFF9810C) ;- (PDC_SSC0) Transmit Counter Register
AT91C_SSC0_RNPR           EQU (0xFFF98110) ;- (PDC_SSC0) Receive Next Pointer Register
AT91C_SSC0_RNCR           EQU (0xFFF98114) ;- (PDC_SSC0) Receive Next Counter Register
AT91C_SSC0_TNPR           EQU (0xFFF98118) ;- (PDC_SSC0) Transmit Next Pointer Register
AT91C_SSC0_RPR            EQU (0xFFF98100) ;- (PDC_SSC0) Receive Pointer Register
AT91C_SSC0_TPR            EQU (0xFFF98108) ;- (PDC_SSC0) Transmit Pointer Register
AT91C_SSC0_RCR            EQU (0xFFF98104) ;- (PDC_SSC0) Receive Counter Register
AT91C_SSC0_TNCR           EQU (0xFFF9811C) ;- (PDC_SSC0) Transmit Next Counter Register
AT91C_SSC0_PTCR           EQU (0xFFF98120) ;- (PDC_SSC0) PDC Transfer Control Register
/* - ========== Register definition for SSC0 peripheral ========== */
AT91C_SSC0_RFMR           EQU (0xFFF98014) ;- (SSC0) Receive Frame Mode Register
AT91C_SSC0_RHR            EQU (0xFFF98020) ;- (SSC0) Receive Holding Register
AT91C_SSC0_THR            EQU (0xFFF98024) ;- (SSC0) Transmit Holding Register
AT91C_SSC0_CMR            EQU (0xFFF98004) ;- (SSC0) Clock Mode Register
AT91C_SSC0_IMR            EQU (0xFFF9804C) ;- (SSC0) Interrupt Mask Register
AT91C_SSC0_IDR            EQU (0xFFF98048) ;- (SSC0) Interrupt Disable Register
AT91C_SSC0_IER            EQU (0xFFF98044) ;- (SSC0) Interrupt Enable Register
AT91C_SSC0_TSHR           EQU (0xFFF98034) ;- (SSC0) Transmit Sync Holding Register
AT91C_SSC0_SR             EQU (0xFFF98040) ;- (SSC0) Status Register
AT91C_SSC0_CR             EQU (0xFFF98000) ;- (SSC0) Control Register
AT91C_SSC0_RCMR           EQU (0xFFF98010) ;- (SSC0) Receive Clock ModeRegister
AT91C_SSC0_TFMR           EQU (0xFFF9801C) ;- (SSC0) Transmit Frame Mode Register
AT91C_SSC0_RSHR           EQU (0xFFF98030) ;- (SSC0) Receive Sync Holding Register
AT91C_SSC0_TCMR           EQU (0xFFF98018) ;- (SSC0) Transmit Clock Mode Register
/* - ========== Register definition for PDC_SSC1 peripheral ========== */
AT91C_SSC1_TNPR           EQU (0xFFF9C118) ;- (PDC_SSC1) Transmit Next Pointer Register
AT91C_SSC1_PTSR           EQU (0xFFF9C124) ;- (PDC_SSC1) PDC Transfer Status Register
AT91C_SSC1_TNCR           EQU (0xFFF9C11C) ;- (PDC_SSC1) Transmit Next Counter Register
AT91C_SSC1_RNCR           EQU (0xFFF9C114) ;- (PDC_SSC1) Receive Next Counter Register
AT91C_SSC1_TPR            EQU (0xFFF9C108) ;- (PDC_SSC1) Transmit Pointer Register
AT91C_SSC1_RCR            EQU (0xFFF9C104) ;- (PDC_SSC1) Receive Counter Register
AT91C_SSC1_PTCR           EQU (0xFFF9C120) ;- (PDC_SSC1) PDC Transfer Control Register
AT91C_SSC1_RNPR           EQU (0xFFF9C110) ;- (PDC_SSC1) Receive Next Pointer Register
AT91C_SSC1_TCR            EQU (0xFFF9C10C) ;- (PDC_SSC1) Transmit Counter Register
