una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
AT91C_SSC1_RPR            EQU (0xFFF9C100) ;- (PDC_SSC1) Receive Pointer Register
/* - ========== Register definition for SSC1 peripheral ========== */
AT91C_SSC1_CMR            EQU (0xFFF9C004) ;- (SSC1) Clock Mode Register
AT91C_SSC1_SR             EQU (0xFFF9C040) ;- (SSC1) Status Register
AT91C_SSC1_TSHR           EQU (0xFFF9C034) ;- (SSC1) Transmit Sync Holding Register
AT91C_SSC1_TCMR           EQU (0xFFF9C018) ;- (SSC1) Transmit Clock Mode Register
AT91C_SSC1_IMR            EQU (0xFFF9C04C) ;- (SSC1) Interrupt Mask Register
AT91C_SSC1_IDR            EQU (0xFFF9C048) ;- (SSC1) Interrupt Disable Register
AT91C_SSC1_RCMR           EQU (0xFFF9C010) ;- (SSC1) Receive Clock ModeRegister
AT91C_SSC1_IER            EQU (0xFFF9C044) ;- (SSC1) Interrupt Enable Register
AT91C_SSC1_RSHR           EQU (0xFFF9C030) ;- (SSC1) Receive Sync Holding Register
AT91C_SSC1_CR             EQU (0xFFF9C000) ;- (SSC1) Control Register
AT91C_SSC1_RHR            EQU (0xFFF9C020) ;- (SSC1) Receive Holding Register
AT91C_SSC1_THR            EQU (0xFFF9C024) ;- (SSC1) Transmit Holding Register
AT91C_SSC1_RFMR           EQU (0xFFF9C014) ;- (SSC1) Receive Frame Mode Register
AT91C_SSC1_TFMR           EQU (0xFFF9C01C) ;- (SSC1) Transmit Frame Mode Register
/* - ========== Register definition for PDC_AC97C peripheral ========== */
AT91C_AC97C_RNPR          EQU (0xFFFA0110) ;- (PDC_AC97C) Receive Next Pointer Register
AT91C_AC97C_TCR           EQU (0xFFFA010C) ;- (PDC_AC97C) Transmit Counter Register
AT91C_AC97C_TNCR          EQU (0xFFFA011C) ;- (PDC_AC97C) Transmit Next Counter Register
AT91C_AC97C_RCR           EQU (0xFFFA0104) ;- (PDC_AC97C) Receive Counter Register
AT91C_AC97C_RNCR          EQU (0xFFFA0114) ;- (PDC_AC97C) Receive Next Counter Register
AT91C_AC97C_PTCR          EQU (0xFFFA0120) ;- (PDC_AC97C) PDC Transfer Control Register
AT91C_AC97C_TPR           EQU (0xFFFA0108) ;- (PDC_AC97C) Transmit Pointer Register
AT91C_AC97C_RPR           EQU (0xFFFA0100) ;- (PDC_AC97C) Receive Pointer Register
AT91C_AC97C_PTSR          EQU (0xFFFA0124) ;- (PDC_AC97C) PDC Transfer Status Register
AT91C_AC97C_TNPR          EQU (0xFFFA0118) ;- (PDC_AC97C) Transmit Next Pointer Register
/* - ========== Register definition for AC97C peripheral ========== */
AT91C_AC97C_CORHR         EQU (0xFFFA0040) ;- (AC97C) COdec Transmit Holding Register
AT91C_AC97C_MR            EQU (0xFFFA0008) ;- (AC97C) Mode Register
AT91C_AC97C_CATHR         EQU (0xFFFA0024) ;- (AC97C) Channel A Transmit Holding Register
AT91C_AC97C_IER           EQU (0xFFFA0054) ;- (AC97C) Interrupt Enable Register
AT91C_AC97C_CASR          EQU (0xFFFA0028) ;- (AC97C) Channel A Status Register
AT91C_AC97C_CBTHR         EQU (0xFFFA0034) ;- (AC97C) Channel B Transmit Holding Register (optional)
AT91C_AC97C_ICA           EQU (0xFFFA0010) ;- (AC97C) Input Channel AssignementRegister
AT91C_AC97C_IMR           EQU (0xFFFA005C) ;- (AC97C) Interrupt Mask Register
AT91C_AC97C_IDR           EQU (0xFFFA0058) ;- (AC97C) Interrupt Disable Register
AT91C_AC97C_CARHR         EQU (0xFFFA0020) ;- (AC97C) Channel A Receive Holding Register
AT91C_AC97C_VERSION       EQU (0xFFFA00FC) ;- (AC97C) Version Register
AT91C_AC97C_CBRHR         EQU (0xFFFA0030) ;- (AC97C) Channel B Receive Holding Register (optional)
AT91C_AC97C_COTHR         EQU (0xFFFA0044) ;- (AC97C) COdec Transmit Holding Register
AT91C_AC97C_OCA           EQU (0xFFFA0014) ;- (AC97C) Output Channel Assignement Register
AT91C_AC97C_CBMR          EQU (0xFFFA003C) ;- (AC97C) Channel B Mode Register
AT91C_AC97C_COMR          EQU (0xFFFA004C) ;- (AC97C) CODEC Mask Status Register
AT91C_AC97C_CBSR          EQU (0xFFFA0038) ;- (AC97C) Channel B Status Register
AT91C_AC97C_COSR          EQU (0xFFFA0048) ;- (AC97C) CODEC Status Register
AT91C_AC97C_CAMR          EQU (0xFFFA002C) ;- (AC97C) Channel A Mode Register
AT91C_AC97C_SR            EQU (0xFFFA0050) ;- (AC97C) Status Register
/* - ========== Register definition for PDC_SPI0 peripheral ========== */
AT91C_SPI0_TPR            EQU (0xFFFA4108) ;- (PDC_SPI0) Transmit Pointer Register
AT91C_SPI0_PTCR           EQU (0xFFFA4120) ;- (PDC_SPI0) PDC Transfer Control Register
AT91C_SPI0_RNPR           EQU (0xFFFA4110) ;- (PDC_SPI0) Receive Next Pointer Register
AT91C_SPI0_TNCR           EQU (0xFFFA411C) ;- (PDC_SPI0) Transmit Next Counter Register
AT91C_SPI0_TCR            EQU (0xFFFA410C) ;- (PDC_SPI0) Transmit Counter Register
AT91C_SPI0_RCR            EQU (0xFFFA4104) ;- (PDC_SPI0) Receive Counter Register
AT91C_SPI0_RNCR           EQU (0xFFFA4114) ;- (PDC_SPI0) Receive Next Counter Register
AT91C_SPI0_TNPR           EQU (0xFFFA4118) ;- (PDC_SPI0) Transmit Next Pointer Register
AT91C_SPI0_RPR            EQU (0xFFFA4100) ;- (PDC_SPI0) Receive Pointer Register
AT91C_SPI0_PTSR           EQU (0xFFFA4124) ;- (PDC_SPI0) PDC Transfer Status Register
/* - ========== Register definition for SPI0 peripheral ========== */
AT91C_SPI0_MR             EQU (0xFFFA4004) ;- (SPI0) Mode Register
AT91C_SPI0_RDR            EQU (0xFFFA4008) ;- (SPI0) Receive Data Register
AT91C_SPI0_CR             EQU (0xFFFA4000) ;- (SPI0) Control Register
AT91C_SPI0_IER            EQU (0xFFFA4014) ;- (SPI0) Interrupt Enable Register
AT91C_SPI0_TDR            EQU (0xFFFA400C) ;- (SPI0) Transmit Data Register
AT91C_SPI0_IDR            EQU (0xFFFA4018) ;- (SPI0) Interrupt Disable Register
AT91C_SPI0_CSR            EQU (0xFFFA4030) ;- (SPI0) Chip Select Register
AT91C_SPI0_SR             EQU (0xFFFA4010) ;- (SPI0) Status Register
AT91C_SPI0_IMR            EQU (0xFFFA401C) ;- (SPI0) Interrupt Mask Register
/* - ========== Register definition for PDC_SPI1 peripheral ========== */
AT91C_SPI1_RNCR           EQU (0xFFFA8114) ;- (PDC_SPI1) Receive Next Counter Register
AT91C_SPI1_TCR            EQU (0xFFFA810C) ;- (PDC_SPI1) Transmit Counter Register
AT91C_SPI1_RCR            EQU (0xFFFA8104) ;- (PDC_SPI1) Receive Counter Register
AT91C_SPI1_TNPR           EQU (0xFFFA8118) ;- (PDC_SPI1) Transmit Next Pointer Register
AT91C_SPI1_RNPR           EQU (0xFFFA8110) ;- (PDC_SPI1) Receive Next Pointer Register
AT91C_SPI1_RPR            EQU (0xFFFA8100) ;- (PDC_SPI1) Receive Pointer Register
AT91C_SPI1_TNCR           EQU (0xFFFA811C) ;- (PDC_SPI1) Transmit Next Counter Register
AT91C_SPI1_TPR            EQU (0xFFFA8108) ;- (PDC_SPI1) Transmit Pointer Register
AT91C_SPI1_PTSR           EQU (0xFFFA8124) ;- (PDC_SPI1) PDC Transfer Status Register
AT91C_SPI1_PTCR           EQU (0xFFFA8120) ;- (PDC_SPI1) PDC Transfer Control Register
/* - ========== Register definition for SPI1 peripheral ========== */
AT91C_SPI1_CSR            EQU (0xFFFA8030) ;- (SPI1) Chip Select Register
AT91C_SPI1_IER            EQU (0xFFFA8014) ;- (SPI1) Interrupt Enable Register
AT91C_SPI1_RDR            EQU (0xFFFA8008) ;- (SPI1) Receive Data Register
AT91C_SPI1_IDR            EQU (0xFFFA8018) ;- (SPI1) Interrupt Disable Register
AT91C_SPI1_MR             EQU (0xFFFA8004) ;- (SPI1) Mode Register
AT91C_SPI1_CR             EQU (0xFFFA8000) ;- (SPI1) Control Register
AT91C_SPI1_SR             EQU (0xFFFA8010) ;- (SPI1) Status Register
AT91C_SPI1_TDR            EQU (0xFFFA800C) ;- (SPI1) Transmit Data Register
AT91C_SPI1_IMR            EQU (0xFFFA801C) ;- (SPI1) Interrupt Mask Register
/* - ========== Register definition for CAN_MB0 peripheral ========== */
AT91C_CAN_MB0_MID         EQU (0xFFFAC208) ;- (CAN_MB0) MailBox ID Register
AT91C_CAN_MB0_MFID        EQU (0xFFFAC20C) ;- (CAN_MB0) MailBox Family ID Register
AT91C_CAN_MB0_MAM         EQU (0xFFFAC204) ;- (CAN_MB0) MailBox Acceptance Mask Register
AT91C_CAN_MB0_MCR         EQU (0xFFFAC21C) ;- (CAN_MB0) MailBox Control Register
AT91C_CAN_MB0_MMR         EQU (0xFFFAC200) ;- (CAN_MB0) MailBox Mode Register
AT91C_CAN_MB0_MDL         EQU (0xFFFAC214) ;- (CAN_MB0) MailBox Data Low Register
AT91C_CAN_MB0_MDH         EQU (0xFFFAC218) ;- (CAN_MB0) MailBox Data High Register
AT91C_CAN_MB0_MSR         EQU (0xFFFAC210) ;- (CAN_MB0) MailBox Status Register
/* - ========== Register definition for CAN_MB1 peripheral ========== */
AT91C_CAN_MB1_MDL         EQU (0xFFFAC234) ;- (CAN_MB1) MailBox Data Low Register
AT91C_CAN_MB1_MAM         EQU (0xFFFAC224) ;- (CAN_MB1) MailBox Acceptance Mask Register
AT91C_CAN_MB1_MID         EQU (0xFFFAC228) ;- (CAN_MB1) MailBox ID Register
AT91C_CAN_MB1_MMR         EQU (0xFFFAC220) ;- (CAN_MB1) MailBox Mode Register
AT91C_CAN_MB1_MCR         EQU (0xFFFAC23C) ;- (CAN_MB1) MailBox Control Register
AT91C_CAN_MB1_MFID        EQU (0xFFFAC22C) ;- (CAN_MB1) MailBox Family ID Register
AT91C_CAN_MB1_MSR         EQU (0xFFFAC230) ;- (CAN_MB1) MailBox Status Register
AT91C_CAN_MB1_MDH         EQU (0xFFFAC238) ;- (CAN_MB1) MailBox Data High Register
/* - ========== Register definition for CAN_MB2 peripheral ========== */
AT91C_CAN_MB2_MID         EQU (0xFFFAC248) ;- (CAN_MB2) MailBox ID Register
AT91C_CAN_MB2_MSR         EQU (0xFFFAC250) ;- (CAN_MB2) MailBox Status Register
AT91C_CAN_MB2_MDL         EQU (0xFFFAC254) ;- (CAN_MB2) MailBox Data Low Register
AT91C_CAN_MB2_MCR         EQU (0xFFFAC25C) ;- (CAN_MB2) MailBox Control Register
AT91C_CAN_MB2_MDH         EQU (0xFFFAC258) ;- (CAN_MB2) MailBox Data High Register
AT91C_CAN_MB2_MAM         EQU (0xFFFAC244) ;- (CAN_MB2) MailBox Acceptance Mask Register
AT91C_CAN_MB2_MMR         EQU (0xFFFAC240) ;- (CAN_MB2) MailBox Mode Register
AT91C_CAN_MB2_MFID        EQU (0xFFFAC24C) ;- (CAN_MB2) MailBox Family ID Register
/* - ========== Register definition for CAN_MB3 peripheral ========== */
AT91C_CAN_MB3_MDL         EQU (0xFFFAC274) ;- (CAN_MB3) MailBox Data Low Register
AT91C_CAN_MB3_MFID        EQU (0xFFFAC26C) ;- (CAN_MB3) MailBox Family ID Register
AT91C_CAN_MB3_MID         EQU (0xFFFAC268) ;- (CAN_MB3) MailBox ID Register
AT91C_CAN_MB3_MDH         EQU (0xFFFAC278) ;- (CAN_MB3) MailBox Data High Register
AT91C_CAN_MB3_MAM         EQU (0xFFFAC264) ;- (CAN_MB3) MailBox Acceptance Mask Register
AT91C_CAN_MB3_MMR         EQU (0xFFFAC260) ;- (CAN_MB3) MailBox Mode Register
AT91C_CAN_MB3_MCR         EQU (0xFFFAC27C) ;- (CAN_MB3) MailBox Control Register
AT91C_CAN_MB3_MSR         EQU (0xFFFAC270) ;- (CAN_MB3) MailBox Status Register
/* - ========== Register definition for CAN_MB4 peripheral ========== */
AT91C_CAN_MB4_MCR         EQU (0xFFFAC29C) ;- (CAN_MB4) MailBox Control Register
AT91C_CAN_MB4_MDH         EQU (0xFFFAC298) ;- (CAN_MB4) MailBox Data High Register
AT91C_CAN_MB4_MID         EQU (0xFFFAC288) ;- (CAN_MB4) MailBox ID Register
AT91C_CAN_MB4_MMR         EQU (0xFFFAC280) ;- (CAN_MB4) MailBox Mode Register
AT91C_CAN_MB4_MSR         EQU (0xFFFAC290) ;- (CAN_MB4) MailBox Status Register
AT91C_CAN_MB4_MFID        EQU (0xFFFAC28C) ;- (CAN_MB4) MailBox Family ID Register
AT91C_CAN_MB4_MAM         EQU (0xFFFAC284) ;- (CAN_MB4) MailBox Acceptance Mask Register
AT91C_CAN_MB4_MDL         EQU (0xFFFAC294) ;- (CAN_MB4) MailBox Data Low Register
/* - ========== Register definition for CAN_MB5 peripheral ========== */
AT91C_CAN_MB5_MDH         EQU (0xFFFAC2B8) ;- (CAN_MB5) MailBox Data High Register
AT91C_CAN_MB5_MID         EQU (0xFFFAC2A8) ;- (CAN_MB5) MailBox ID Register
AT91C_CAN_MB5_MCR         EQU (0xFFFAC2BC) ;- (CAN_MB5) MailBox Control Register
AT91C_CAN_MB5_MSR         EQU (0xFFFAC2B0) ;- (CAN_MB5) MailBox Status Register
AT91C_CAN_MB5_MDL         EQU (0xFFFAC2B4) ;- (CAN_MB5) MailBox Data Low Register
AT91C_CAN_MB5_MMR         EQU (0xFFFAC2A0) ;- (CAN_MB5) MailBox Mode Register
AT91C_CAN_MB5_MAM         EQU (0xFFFAC2A4) ;- (CAN_MB5) MailBox Acceptance Mask Register
AT91C_CAN_MB5_MFID        EQU (0xFFFAC2AC) ;- (CAN_MB5) MailBox Family ID Register
/* - ========== Register definition for CAN_MB6 peripheral ========== */
AT91C_CAN_MB6_MSR         EQU (0xFFFAC2D0) ;- (CAN_MB6) MailBox Status Register
AT91C_CAN_MB6_MMR         EQU (0xFFFAC2C0) ;- (CAN_MB6) MailBox Mode Register
AT91C_CAN_MB6_MFID        EQU (0xFFFAC2CC) ;- (CAN_MB6) MailBox Family ID Register
AT91C_CAN_MB6_MDL         EQU (0xFFFAC2D4) ;- (CAN_MB6) MailBox Data Low Register
AT91C_CAN_MB6_MID         EQU (0xFFFAC2C8) ;- (CAN_MB6) MailBox ID Register
AT91C_CAN_MB6_MCR         EQU (0xFFFAC2DC) ;- (CAN_MB6) MailBox Control Register
AT91C_CAN_MB6_MAM         EQU (0xFFFAC2C4) ;- (CAN_MB6) MailBox Acceptance Mask Register
AT91C_CAN_MB6_MDH         EQU (0xFFFAC2D8) ;- (CAN_MB6) MailBox Data High Register
/* - ========== Register definition for CAN_MB7 peripheral ========== */
AT91C_CAN_MB7_MAM         EQU (0xFFFAC2E4) ;- (CAN_MB7) MailBox Acceptance Mask Register
AT91C_CAN_MB7_MDH         EQU (0xFFFAC2F8) ;- (CAN_MB7) MailBox Data High Register
AT91C_CAN_MB7_MID         EQU (0xFFFAC2E8) ;- (CAN_MB7) MailBox ID Register
AT91C_CAN_MB7_MSR         EQU (0xFFFAC2F0) ;- (CAN_MB7) MailBox Status Register
AT91C_CAN_MB7_MMR         EQU (0xFFFAC2E0) ;- (CAN_MB7) MailBox Mode Register
AT91C_CAN_MB7_MCR         EQU (0xFFFAC2FC) ;- (CAN_MB7) MailBox Control Register
AT91C_CAN_MB7_MFID        EQU (0xFFFAC2EC) ;- (CAN_MB7) MailBox Family ID Register
AT91C_CAN_MB7_MDL         EQU (0xFFFAC2F4) ;- (CAN_MB7) MailBox Data Low Register
/* - ========== Register definition for CAN_MB8 peripheral ========== */
AT91C_CAN_MB8_MDH         EQU (0xFFFAC318) ;- (CAN_MB8) MailBox Data High Register
AT91C_CAN_MB8_MMR         EQU (0xFFFAC300) ;- (CAN_MB8) MailBox Mode Register
AT91C_CAN_MB8_MCR         EQU (0xFFFAC31C) ;- (CAN_MB8) MailBox Control Register
AT91C_CAN_MB8_MSR         EQU (0xFFFAC310) ;- (CAN_MB8) MailBox Status Register
AT91C_CAN_MB8_MAM         EQU (0xFFFAC304) ;- (CAN_MB8) MailBox Acceptance Mask Register
AT91C_CAN_MB8_MFID        EQU (0xFFFAC30C) ;- (CAN_MB8) MailBox Family ID Register
AT91C_CAN_MB8_MID         EQU (0xFFFAC308) ;- (CAN_MB8) MailBox ID Register
AT91C_CAN_MB8_MDL         EQU (0xFFFAC314) ;- (CAN_MB8) MailBox Data Low Register
/* - ========== Register definition for CAN_MB9 peripheral ========== */
AT91C_CAN_MB9_MID         EQU (0xFFFAC328) ;- (CAN_MB9) MailBox ID Register
AT91C_CAN_MB9_MMR         EQU (0xFFFAC320) ;- (CAN_MB9) MailBox Mode Register
AT91C_CAN_MB9_MDH         EQU (0xFFFAC338) ;- (CAN_MB9) MailBox Data High Register
AT91C_CAN_MB9_MSR         EQU (0xFFFAC330) ;- (CAN_MB9) MailBox Status Register
AT91C_CAN_MB9_MAM         EQU (0xFFFAC324) ;- (CAN_MB9) MailBox Acceptance Mask Register
AT91C_CAN_MB9_MDL         EQU (0xFFFAC334) ;- (CAN_MB9) MailBox Data Low Register
AT91C_CAN_MB9_MFID        EQU (0xFFFAC32C) ;- (CAN_MB9) MailBox Family ID Register
AT91C_CAN_MB9_MCR         EQU (0xFFFAC33C) ;- (CAN_MB9) MailBox Control Register
/* - ========== Register definition for CAN_MB10 peripheral ========== */
AT91C_CAN_MB10_MCR        EQU (0xFFFAC35C) ;- (CAN_MB10) MailBox Control Register
AT91C_CAN_MB10_MDH        EQU (0xFFFAC358) ;- (CAN_MB10) MailBox Data High Register
AT91C_CAN_MB10_MAM        EQU (0xFFFAC344) ;- (CAN_MB10) MailBox Acceptance Mask Register
AT91C_CAN_MB10_MID        EQU (0xFFFAC348) ;- (CAN_MB10) MailBox ID Register
AT91C_CAN_MB10_MDL        EQU (0xFFFAC354) ;- (CAN_MB10) MailBox Data Low Register
AT91C_CAN_MB10_MSR        EQU (0xFFFAC350) ;- (CAN_MB10) MailBox Status Register
AT91C_CAN_MB10_MMR        EQU (0xFFFAC340) ;- (CAN_MB10) MailBox Mode Register
AT91C_CAN_MB10_MFID       EQU (0xFFFAC34C) ;- (CAN_MB10) MailBox Family ID Register
/* - ========== Register definition for CAN_MB11 peripheral ========== */
AT91C_CAN_MB11_MSR        EQU (0xFFFAC370) ;- (CAN_MB11) MailBox Status Register
AT91C_CAN_MB11_MFID       EQU (0xFFFAC36C) ;- (CAN_MB11) MailBox Family ID Register
AT91C_CAN_MB11_MDL        EQU (0xFFFAC374) ;- (CAN_MB11) MailBox Data Low Register
AT91C_CAN_MB11_MDH        EQU (0xFFFAC378) ;- (CAN_MB11) MailBox Data High Register
AT91C_CAN_MB11_MID        EQU (0xFFFAC368) ;- (CAN_MB11) MailBox ID Register
AT91C_CAN_MB11_MCR        EQU (0xFFFAC37C) ;- (CAN_MB11) MailBox Control Register
AT91C_CAN_MB11_MMR        EQU (0xFFFAC360) ;- (CAN_MB11) MailBox Mode Register
AT91C_CAN_MB11_MAM        EQU (0xFFFAC364) ;- (CAN_MB11) MailBox Acceptance Mask Register
/* - ========== Register definition for CAN_MB12 peripheral ========== */
AT91C_CAN_MB12_MAM        EQU (0xFFFAC384) ;- (CAN_MB12) MailBox Acceptance Mask Register
AT91C_CAN_MB12_MDH        EQU (0xFFFAC398) ;- (CAN_MB12) MailBox Data High Register
AT91C_CAN_MB12_MMR        EQU (0xFFFAC380) ;- (CAN_MB12) MailBox Mode Register
AT91C_CAN_MB12_MSR        EQU (0xFFFAC390) ;- (CAN_MB12) MailBox Status Register
AT91C_CAN_MB12_MFID       EQU (0xFFFAC38C) ;- (CAN_MB12) MailBox Family ID Register
AT91C_CAN_MB12_MID        EQU (0xFFFAC388) ;- (CAN_MB12) MailBox ID Register
AT91C_CAN_MB12_MCR        EQU (0xFFFAC39C) ;- (CAN_MB12) MailBox Control Register
AT91C_CAN_MB12_MDL        EQU (0xFFFAC394) ;- (CAN_MB12) MailBox Data Low Register
/* - ========== Register definition for CAN_MB13 peripheral ========== */
AT91C_CAN_MB13_MDH        EQU (0xFFFAC3B8) ;- (CAN_MB13) MailBox Data High Register
AT91C_CAN_MB13_MFID       EQU (0xFFFAC3AC) ;- (CAN_MB13) MailBox Family ID Register
AT91C_CAN_MB13_MSR        EQU (0xFFFAC3B0) ;- (CAN_MB13) MailBox Status Register
AT91C_CAN_MB13_MID        EQU (0xFFFAC3A8) ;- (CAN_MB13) MailBox ID Register
AT91C_CAN_MB13_MAM        EQU (0xFFFAC3A4) ;- (CAN_MB13) MailBox Acceptance Mask Register
AT91C_CAN_MB13_MMR        EQU (0xFFFAC3A0) ;- (CAN_MB13) MailBox Mode Register
AT91C_CAN_MB13_MCR        EQU (0xFFFAC3BC) ;- (CAN_MB13) MailBox Control Register
AT91C_CAN_MB13_MDL        EQU (0xFFFAC3B4) ;- (CAN_MB13) MailBox Data Low Register
/* - ========== Register definition for CAN_MB14 peripheral ========== */
AT91C_CAN_MB14_MDL        EQU (0xFFFAC3D4) ;- (CAN_MB14) MailBox Data Low Register
AT91C_CAN_MB14_MMR        EQU (0xFFFAC3C0) ;- (CAN_MB14) MailBox Mode Register
AT91C_CAN_MB14_MFID       EQU (0xFFFAC3CC) ;- (CAN_MB14) MailBox Family ID Register
AT91C_CAN_MB14_MCR        EQU (0xFFFAC3DC) ;- (CAN_MB14) MailBox Control Register
AT91C_CAN_MB14_MID        EQU (0xFFFAC3C8) ;- (CAN_MB14) MailBox ID Register
AT91C_CAN_MB14_MDH        EQU (0xFFFAC3D8) ;- (CAN_MB14) MailBox Data High Register
AT91C_CAN_MB14_MSR        EQU (0xFFFAC3D0) ;- (CAN_MB14) MailBox Status Register
AT91C_CAN_MB14_MAM        EQU (0xFFFAC3C4) ;- (CAN_MB14) MailBox Acceptance Mask Register
/* - ========== Register definition for CAN_MB15 peripheral ========== */
AT91C_CAN_MB15_MDL        EQU (0xFFFAC3F4) ;- (CAN_MB15) MailBox Data Low Register
AT91C_CAN_MB15_MSR        EQU (0xFFFAC3F0) ;- (CAN_MB15) MailBox Status Register
AT91C_CAN_MB15_MID        EQU (0xFFFAC3E8) ;- (CAN_MB15) MailBox ID Register
AT91C_CAN_MB15_MAM        EQU (0xFFFAC3E4) ;- (CAN_MB15) MailBox Acceptance Mask Register
AT91C_CAN_MB15_MCR        EQU (0xFFFAC3FC) ;- (CAN_MB15) MailBox Control Register
AT91C_CAN_MB15_MFID       EQU (0xFFFAC3EC) ;- (CAN_MB15) MailBox Family ID Register
AT91C_CAN_MB15_MMR        EQU (0xFFFAC3E0) ;- (CAN_MB15) MailBox Mode Register
AT91C_CAN_MB15_MDH        EQU (0xFFFAC3F8) ;- (CAN_MB15) MailBox Data High Register
/* - ========== Register definition for CAN peripheral ========== */
AT91C_CAN_ACR             EQU (0xFFFAC028) ;- (CAN) Abort Command Register
AT91C_CAN_BR              EQU (0xFFFAC014) ;- (CAN) Baudrate Register
AT91C_CAN_IDR             EQU (0xFFFAC008) ;- (CAN) Interrupt Disable Register
AT91C_CAN_TIMESTP         EQU (0xFFFAC01C) ;- (CAN) Time Stamp Register
AT91C_CAN_SR              EQU (0xFFFAC010) ;- (CAN) Status Register
AT91C_CAN_IMR             EQU (0xFFFAC00C) ;- (CAN) Interrupt Mask Register
AT91C_CAN_TCR             EQU (0xFFFAC024) ;- (CAN) Transfer Command Register
AT91C_CAN_TIM             EQU (0xFFFAC018) ;- (CAN) Timer Register
AT91C_CAN_IER             EQU (0xFFFAC004) ;- (CAN) Interrupt Enable Register
AT91C_CAN_ECR             EQU (0xFFFAC020) ;- (CAN) Error Counter Register
AT91C_CAN_VR              EQU (0xFFFAC0FC) ;- (CAN) Version Register
AT91C_CAN_MR              EQU (0xFFFAC000) ;- (CAN) Mode Register
/* - ========== Register definition for PWMC_CH0 peripheral ========== */
AT91C_PWMC_CH0_CCNTR      EQU (0xFFFB820C) ;- (PWMC_CH0) Channel Counter Register
AT91C_PWMC_CH0_CPRDR      EQU (0xFFFB8208) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_CUPDR      EQU (0xFFFB8210) ;- (PWMC_CH0) Channel Update Register
AT91C_PWMC_CH0_CDTYR      EQU (0xFFFB8204) ;- (PWMC_CH0) Channel Duty Cycle Register
AT91C_PWMC_CH0_CMR        EQU (0xFFFB8200) ;- (PWMC_CH0) Channel Mode Register
AT91C_PWMC_CH0_Reserved   EQU (0xFFFB8214) ;- (PWMC_CH0) Reserved
/* - ========== Register definition for PWMC_CH1 peripheral ========== */
AT91C_PWMC_CH1_CCNTR      EQU (0xFFFB822C) ;- (PWMC_CH1) Channel Counter Register
AT91C_PWMC_CH1_CDTYR      EQU (0xFFFB8224) ;- (PWMC_CH1) Channel Duty Cycle Register
AT91C_PWMC_CH1_CMR        EQU (0xFFFB8220) ;- (PWMC_CH1) Channel Mode Register
AT91C_PWMC_CH1_CPRDR      EQU (0xFFFB8228) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_Reserved   EQU (0xFFFB8234) ;- (PWMC_CH1) Reserved
AT91C_PWMC_CH1_CUPDR      EQU (0xFFFB8230) ;- (PWMC_CH1) Channel Update Register
/* - ========== Register definition for PWMC_CH2 peripheral ========== */
AT91C_PWMC_CH2_CUPDR      EQU (0xFFFB8250) ;- (PWMC_CH2) Channel Update Register
AT91C_PWMC_CH2_CMR        EQU (0xFFFB8240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_Reserved   EQU (0xFFFB8254) ;- (PWMC_CH2) Reserved
AT91C_PWMC_CH2_CPRDR      EQU (0xFFFB8248) ;- (PWMC_CH2) Channel Period Register
AT91C_PWMC_CH2_CDTYR      EQU (0xFFFB8244) ;- (PWMC_CH2) Channel Duty Cycle Register
AT91C_PWMC_CH2_CCNTR      EQU (0xFFFB824C) ;- (PWMC_CH2) Channel Counter Register
/* - ========== Register definition for PWMC_CH3 peripheral ========== */
AT91C_PWMC_CH3_CPRDR      EQU (0xFFFB8268) ;- (PWMC_CH3) Channel Period Register
AT91C_PWMC_CH3_Reserved   EQU (0xFFFB8274) ;- (PWMC_CH3) Reserved
AT91C_PWMC_CH3_CUPDR      EQU (0xFFFB8270) ;- (PWMC_CH3) Channel Update Register
AT91C_PWMC_CH3_CDTYR      EQU (0xFFFB8264) ;- (PWMC_CH3) Channel Duty Cycle Register
AT91C_PWMC_CH3_CCNTR      EQU (0xFFFB826C) ;- (PWMC_CH3) Channel Counter Register
AT91C_PWMC_CH3_CMR        EQU (0xFFFB8260) ;- (PWMC_CH3) Channel Mode Register
/* - ========== Register definition for PWMC peripheral ========== */
AT91C_PWMC_IDR            EQU (0xFFFB8014) ;- (PWMC) PWMC Interrupt Disable Register
AT91C_PWMC_MR             EQU (0xFFFB8000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_VR             EQU (0xFFFB80FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_IMR            EQU (0xFFFB8018) ;- (PWMC) PWMC Interrupt Mask Register
AT91C_PWMC_SR             EQU (0xFFFB800C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_ISR            EQU (0xFFFB801C) ;- (PWMC) PWMC Interrupt Status Register
AT91C_PWMC_ENA            EQU (0xFFFB8004) ;- (PWMC) PWMC Enable Register
AT91C_PWMC_IER            EQU (0xFFFB8010) ;- (PWMC) PWMC Interrupt Enable Register
AT91C_PWMC_DIS            EQU (0xFFFB8008) ;- (PWMC) PWMC Disable Register
/* - ========== Register definition for MACB peripheral ========== */
AT91C_MACB_ALE            EQU (0xFFFBC054) ;- (MACB) Alignment Error Register
AT91C_MACB_RRE            EQU (0xFFFBC06C) ;- (MACB) Receive Ressource Error Register
AT91C_MACB_SA4H           EQU (0xFFFBC0B4) ;- (MACB) Specific Address 4 Top, Last 2 bytes
AT91C_MACB_TPQ            EQU (0xFFFBC0BC) ;- (MACB) Transmit Pause Quantum Register
AT91C_MACB_RJA            EQU (0xFFFBC07C) ;- (MACB) Receive Jabbers Register
AT91C_MACB_SA2H           EQU (0xFFFBC0A4) ;- (MACB) Specific Address 2 Top, Last 2 bytes
AT91C_MACB_TPF            EQU (0xFFFBC08C) ;- (MACB) Transmitted Pause Frames Register
AT91C_MACB_ROV            EQU (0xFFFBC070) ;- (MACB) Receive Overrun Errors Register
AT91C_MACB_SA4L           EQU (0xFFFBC0B0) ;- (MACB) Specific Address 4 Bottom, First 4 bytes
