una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
AT91C_MACB_MAN            EQU (0xFFFBC034) ;- (MACB) PHY Maintenance Register
AT91C_MACB_TID            EQU (0xFFFBC0B8) ;- (MACB) Type ID Checking Register
AT91C_MACB_TBQP           EQU (0xFFFBC01C) ;- (MACB) Transmit Buffer Queue Pointer
AT91C_MACB_SA3L           EQU (0xFFFBC0A8) ;- (MACB) Specific Address 3 Bottom, First 4 bytes
AT91C_MACB_DTF            EQU (0xFFFBC058) ;- (MACB) Deferred Transmission Frame Register
AT91C_MACB_PTR            EQU (0xFFFBC038) ;- (MACB) Pause Time Register
AT91C_MACB_CSE            EQU (0xFFFBC068) ;- (MACB) Carrier Sense Error Register
AT91C_MACB_ECOL           EQU (0xFFFBC060) ;- (MACB) Excessive Collision Register
AT91C_MACB_STE            EQU (0xFFFBC084) ;- (MACB) SQE Test Error Register
AT91C_MACB_MCF            EQU (0xFFFBC048) ;- (MACB) Multiple Collision Frame Register
AT91C_MACB_IER            EQU (0xFFFBC028) ;- (MACB) Interrupt Enable Register
AT91C_MACB_ELE            EQU (0xFFFBC078) ;- (MACB) Excessive Length Errors Register
AT91C_MACB_USRIO          EQU (0xFFFBC0C0) ;- (MACB) USER Input/Output Register
AT91C_MACB_PFR            EQU (0xFFFBC03C) ;- (MACB) Pause Frames received Register
AT91C_MACB_FCSE           EQU (0xFFFBC050) ;- (MACB) Frame Check Sequence Error Register
AT91C_MACB_SA1L           EQU (0xFFFBC098) ;- (MACB) Specific Address 1 Bottom, First 4 bytes
AT91C_MACB_NCR            EQU (0xFFFBC000) ;- (MACB) Network Control Register
AT91C_MACB_HRT            EQU (0xFFFBC094) ;- (MACB) Hash Address Top[63:32]
AT91C_MACB_NCFGR          EQU (0xFFFBC004) ;- (MACB) Network Configuration Register
AT91C_MACB_SCF            EQU (0xFFFBC044) ;- (MACB) Single Collision Frame Register
AT91C_MACB_LCOL           EQU (0xFFFBC05C) ;- (MACB) Late Collision Register
AT91C_MACB_SA3H           EQU (0xFFFBC0AC) ;- (MACB) Specific Address 3 Top, Last 2 bytes
AT91C_MACB_HRB            EQU (0xFFFBC090) ;- (MACB) Hash Address Bottom[31:0]
AT91C_MACB_ISR            EQU (0xFFFBC024) ;- (MACB) Interrupt Status Register
AT91C_MACB_IMR            EQU (0xFFFBC030) ;- (MACB) Interrupt Mask Register
AT91C_MACB_WOL            EQU (0xFFFBC0C4) ;- (MACB) Wake On LAN Register
AT91C_MACB_USF            EQU (0xFFFBC080) ;- (MACB) Undersize Frames Register
AT91C_MACB_TSR            EQU (0xFFFBC014) ;- (MACB) Transmit Status Register
AT91C_MACB_FRO            EQU (0xFFFBC04C) ;- (MACB) Frames Received OK Register
AT91C_MACB_IDR            EQU (0xFFFBC02C) ;- (MACB) Interrupt Disable Register
AT91C_MACB_SA1H           EQU (0xFFFBC09C) ;- (MACB) Specific Address 1 Top, Last 2 bytes
AT91C_MACB_RLE            EQU (0xFFFBC088) ;- (MACB) Receive Length Field Mismatch Register
AT91C_MACB_TUND           EQU (0xFFFBC064) ;- (MACB) Transmit Underrun Error Register
AT91C_MACB_RSR            EQU (0xFFFBC020) ;- (MACB) Receive Status Register
AT91C_MACB_SA2L           EQU (0xFFFBC0A0) ;- (MACB) Specific Address 2 Bottom, First 4 bytes
AT91C_MACB_FTO            EQU (0xFFFBC040) ;- (MACB) Frames Transmitted OK Register
AT91C_MACB_RSE            EQU (0xFFFBC074) ;- (MACB) Receive Symbol Errors Register
AT91C_MACB_NSR            EQU (0xFFFBC008) ;- (MACB) Network Status Register
AT91C_MACB_RBQP           EQU (0xFFFBC018) ;- (MACB) Receive Buffer Queue Pointer
AT91C_MACB_REV            EQU (0xFFFBC0FC) ;- (MACB) Revision Register
/* - ========== Register definition for LCDC peripheral ========== */
AT91C_LCDC_BA2            EQU (0x00700004) ;- (LCDC) DMA Base Address Register 2
AT91C_LCDC_DP3_4          EQU (0x00700830) ;- (LCDC) Dithering Pattern DP3_4 Register
AT91C_LCDC_FRMA2          EQU (0x00700014) ;- (LCDC) DMA Frame Address Register 2
AT91C_LCDC_TIM1           EQU (0x00700808) ;- (LCDC) LCD Timing Config 1 Register
AT91C_LCDC_FIFO           EQU (0x00700814) ;- (LCDC) LCD FIFO Register
AT91C_LCDC_TIM2           EQU (0x0070080C) ;- (LCDC) LCD Timing Config 2 Register
AT91C_LCDC_DP5_7          EQU (0x0070082C) ;- (LCDC) Dithering Pattern DP5_7 Register
AT91C_LCDC_IER            EQU (0x00700848) ;- (LCDC) Interrupt Enable Register
AT91C_LCDC_FRMCFG         EQU (0x00700018) ;- (LCDC) DMA Frame Configuration Register
AT91C_LCDC_FRMA1          EQU (0x00700010) ;- (LCDC) DMA Frame Address Register 1
AT91C_LCDC_DP3_5          EQU (0x00700824) ;- (LCDC) Dithering Pattern DP3_5 Register
AT91C_LCDC_PWRCON         EQU (0x0070083C) ;- (LCDC) Power Control Register
AT91C_LCDC_IMR            EQU (0x00700850) ;- (LCDC) Interrupt Mask Register
AT91C_LCDC_LUT_ENTRY      EQU (0x00700C00) ;- (LCDC) LUT Entries Register
AT91C_LCDC_IRR            EQU (0x00700864) ;- (LCDC) Interrupts Raw Status Register
AT91C_LCDC_FRMP2          EQU (0x0070000C) ;- (LCDC) DMA Frame Pointer Register 2
AT91C_LCDC_ICR            EQU (0x00700858) ;- (LCDC) Interrupt Clear Register
AT91C_LCDC_DP1_2          EQU (0x0070081C) ;- (LCDC) Dithering Pattern DP1_2 Register
AT91C_LCDC_DMACON         EQU (0x0070001C) ;- (LCDC) DMA Control Register
AT91C_LCDC_LCDFRCFG       EQU (0x00700810) ;- (LCDC) LCD Frame Config Register
AT91C_LCDC_DP2_3          EQU (0x00700828) ;- (LCDC) Dithering Pattern DP2_3 Register
AT91C_LCDC_DP6_7          EQU (0x00700838) ;- (LCDC) Dithering Pattern DP6_7 Register
AT91C_LCDC_LCDCON1        EQU (0x00700800) ;- (LCDC) LCD Control 1 Register
AT91C_LCDC_DMA2DCFG       EQU (0x00700020) ;- (LCDC) DMA 2D addressing configuration
AT91C_LCDC_GPR            EQU (0x0070085C) ;- (LCDC) General Purpose Register
AT91C_LCDC_BA1            EQU (0x00700000) ;- (LCDC) DMA Base Address Register 1
AT91C_LCDC_CTRSTCON       EQU (0x00700840) ;- (LCDC) Contrast Control Register
AT91C_LCDC_CTRSTVAL       EQU (0x00700844) ;- (LCDC) Contrast Value Register
AT91C_LCDC_LCDCON2        EQU (0x00700804) ;- (LCDC) LCD Control 2 Register
AT91C_LCDC_IDR            EQU (0x0070084C) ;- (LCDC) Interrupt Disable Register
AT91C_LCDC_ISR            EQU (0x00700854) ;- (LCDC) Interrupt Enable Register
AT91C_LCDC_ITR            EQU (0x00700860) ;- (LCDC) Interrupts Test Register
AT91C_LCDC_DP4_7          EQU (0x00700820) ;- (LCDC) Dithering Pattern DP4_7 Register
AT91C_LCDC_MVAL           EQU (0x00700818) ;- (LCDC) LCD Mode Toggle Rate Value Register
AT91C_LCDC_DP4_5          EQU (0x00700834) ;- (LCDC) Dithering Pattern DP4_5 Register
AT91C_LCDC_FRMP1          EQU (0x00700008) ;- (LCDC) DMA Frame Pointer Register 1
/* - ========== Register definition for DMA peripheral ========== */
AT91C_DMA_RAWSRCTRAN      EQU (0x008002D0) ;- (DMA) Raw Status for IntSrcTran Interrupt
AT91C_DMA_SGR0            EQU (0x00800048) ;- (DMA) Source Gather Register for channel 0
AT91C_DMA_REQSRCREG       EQU (0x00800368) ;- (DMA) Source Software Transaction Request Register
AT91C_DMA_STATUSERR       EQU (0x00800308) ;- (DMA) Status for IntErr IInterrupt
AT91C_DMA_SAR1            EQU (0x00800058) ;- (DMA) Source Address Register for channel 1
AT91C_DMA_CLEARDSTTRAN    EQU (0x00800350) ;- (DMA) Clear for IntDstTran IInterrupt
AT91C_DMA_STATUSSRCTRAN   EQU (0x008002F8) ;- (DMA) Status for IntSrcTran Interrupt
AT91C_DMA_REQDSTREG       EQU (0x00800370) ;- (DMA) Destination Software Transaction Request Register
AT91C_DMA_DSTATAR0        EQU (0x00800038) ;- (DMA) Destination Status Adress Register for channel 0
AT91C_DMA_LSTREQDSTREG    EQU (0x00800390) ;- (DMA) Last Destination Software Transaction Request Register
AT91C_DMA_SGLREQDSTREG    EQU (0x00800380) ;- (DMA) Single Destination Software Transaction Request Register
AT91C_DMA_CTL1h           EQU (0x00800074) ;- (DMA) Control Register for channel 1 - high
AT91C_DMA_CLEARERR        EQU (0x00800358) ;- (DMA) Clear for IntErr Interrupt
AT91C_DMA_DSR0            EQU (0x00800050) ;- (DMA) Destination Scatter Register for channel 0
AT91C_DMA_DMATESTREG      EQU (0x008003B0) ;- (DMA) DW_ahb_dmac Test Register
AT91C_DMA_DSR1            EQU (0x008000A8) ;- (DMA) Destination Scatter Register for channel 1
AT91C_DMA_CTL0l           EQU (0x00800018) ;- (DMA) Control Register for channel 0 - low
AT91C_DMA_STATUSBLOCK     EQU (0x008002F0) ;- (DMA) Status for IntBlock Interrupt
AT91C_DMA_SAR0            EQU (0x00800000) ;- (DMA) Source Address Register for channel 0
AT91C_DMA_LLP0            EQU (0x00800010) ;- (DMA) Linked List Pointer Register for channel 0
AT91C_DMA_CTL1l           EQU (0x00800070) ;- (DMA) Control Register for channel 1 - low
AT91C_DMA_SGR1            EQU (0x008000A0) ;- (DMA) Source Gather Register for channel 1
AT91C_DMA_CFG0l           EQU (0x00800040) ;- (DMA) Configuration Register for channel 0 - low
AT91C_DMA_CFG0h           EQU (0x00800044) ;- (DMA) Configuration Register for channel 0 - high
AT91C_DMA_STATUSTFR       EQU (0x008002E8) ;- (DMA) Status for IntTfr Interrupt
AT91C_DMA_MASKBLOCK       EQU (0x00800318) ;- (DMA) Mask for IntBlock Interrupt
AT91C_DMA_RAWBLOCK        EQU (0x008002C8) ;- (DMA) Raw Status for IntBlock Interrupt
AT91C_DMA_CHENREG         EQU (0x008003A0) ;- (DMA) DW_ahb_dmac Channel Enable Register
AT91C_DMA_DSTAT0          EQU (0x00800028) ;- (DMA) Destination Status Register for channel 0
AT91C_DMA_CLEARSRCTRAN    EQU (0x00800348) ;- (DMA) Clear for IntSrcTran Interrupt
AT91C_DMA_DAR1            EQU (0x00800060) ;- (DMA) Destination Address Register for channel 1
AT91C_DMA_CLEARBLOCK      EQU (0x00800340) ;- (DMA) Clear for IntBlock Interrupt
AT91C_DMA_CFG1h           EQU (0x0080009C) ;- (DMA) Configuration Register for channel 1 - high
AT91C_DMA_DSTATAR1        EQU (0x00800090) ;- (DMA) Destination Status Adress Register for channel 1
AT91C_DMA_RAWERR          EQU (0x008002E0) ;- (DMA) Raw Status for IntErr Interrupt
AT91C_DMA_CTL0h           EQU (0x0080001C) ;- (DMA) Control Register for channel 0 - high
AT91C_DMA_SGLREQSRCREG    EQU (0x00800378) ;- (DMA) Single Source Software Transaction Request Register
AT91C_DMA_LLP1            EQU (0x00800068) ;- (DMA) Linked List Pointer Register for channel 1
AT91C_DMA_MASKDSTTRAN     EQU (0x00800328) ;- (DMA) Mask for IntDstTran Interrupt
AT91C_DMA_MASKSRCTRAN     EQU (0x00800320) ;- (DMA) Mask for IntSrcTran Interrupt
AT91C_DMA_LSTREQSRCREG    EQU (0x00800388) ;- (DMA) Last Source Software Transaction Request Register
AT91C_DMA_CLEARTFR        EQU (0x00800338) ;- (DMA) Clear for IntTfr Interrupt
AT91C_DMA_SSTATAR1        EQU (0x00800088) ;- (DMA) Source Status Adress Register for channel 1
AT91C_DMA_DAR0            EQU (0x00800008) ;- (DMA) Destination Address Register for channel 0
AT91C_DMA_SSTAT0          EQU (0x00800020) ;- (DMA) Source Status Register for channel 0
AT91C_DMA_DMAIDREG        EQU (0x008003A8) ;- (DMA) DW_ahb_dmac ID Register
AT91C_DMA_DSTAT1          EQU (0x00800080) ;- (DMA) Destination Status Register for channel 1
AT91C_DMA_RAWTFR          EQU (0x008002C0) ;- (DMA) Raw Status for IntTfr Interrupt
AT91C_DMA_VERSIONID       EQU (0x008003B8) ;- (DMA) DW_ahb_dmac Version ID Register
AT91C_DMA_STATUSDSTTRAN   EQU (0x00800300) ;- (DMA) Status for IntDstTran IInterrupt
AT91C_DMA_MASKERR         EQU (0x00800330) ;- (DMA) Mask for IntErr Interrupt
AT91C_DMA_SSTATAR0        EQU (0x00800030) ;- (DMA) Source Status Adress Register for channel 0
AT91C_DMA_MASKTFR         EQU (0x00800310) ;- (DMA) Mask for IntTfr Interrupt
AT91C_DMA_SSTAT1          EQU (0x00800078) ;- (DMA) Source Status Register for channel 1
AT91C_DMA_STATUSINT       EQU (0x00800360) ;- (DMA) Status for each Interrupt Type
AT91C_DMA_DMACFGREG       EQU (0x00800398) ;- (DMA) DW_ahb_dmac Configuration Register
AT91C_DMA_RAWDSTTRAN      EQU (0x008002D8) ;- (DMA) Raw Status for IntDstTran Interrupt
AT91C_DMA_CFG1l           EQU (0x00800098) ;- (DMA) Configuration Register for channel 1 - low
/* - ========== Register definition for UDP peripheral ========== */
AT91C_UDP_FDR             EQU (0xFFF78050) ;- (UDP) Endpoint FIFO Data Register
AT91C_UDP_IER             EQU (0xFFF78010) ;- (UDP) Interrupt Enable Register
AT91C_UDP_CSR             EQU (0xFFF78030) ;- (UDP) Endpoint Control and Status Register
AT91C_UDP_RSTEP           EQU (0xFFF78028) ;- (UDP) Reset Endpoint Register
AT91C_UDP_GLBSTATE        EQU (0xFFF78004) ;- (UDP) Global State Register
AT91C_UDP_TXVC            EQU (0xFFF78074) ;- (UDP) Transceiver Control Register
AT91C_UDP_IDR             EQU (0xFFF78014) ;- (UDP) Interrupt Disable Register
AT91C_UDP_ISR             EQU (0xFFF7801C) ;- (UDP) Interrupt Status Register
AT91C_UDP_IMR             EQU (0xFFF78018) ;- (UDP) Interrupt Mask Register
AT91C_UDP_FADDR           EQU (0xFFF78008) ;- (UDP) Function Address Register
AT91C_UDP_NUM             EQU (0xFFF78000) ;- (UDP) Frame Number Register
AT91C_UDP_ICR             EQU (0xFFF78020) ;- (UDP) Interrupt Clear Register
/* - ========== Register definition for UHP peripheral ========== */
AT91C_UHP_HcRhDescriptorA EQU (0x00A00048) ;- (UHP) Root Hub characteristics A
AT91C_UHP_HcInterruptStatus EQU (0x00A0000C) ;- (UHP) Interrupt Status Register
AT91C_UHP_HcLSThreshold   EQU (0x00A00044) ;- (UHP) LS Threshold
AT91C_UHP_HcBulkDoneHead  EQU (0x00A00030) ;- (UHP) Last completed transfer descriptor
AT91C_UHP_HcInterruptDisable EQU (0x00A00014) ;- (UHP) Interrupt Disable Register
AT91C_UHP_HcRhPortStatus  EQU (0x00A00054) ;- (UHP) Root Hub Port Status Register
AT91C_UHP_HcControl       EQU (0x00A00004) ;- (UHP) Operating modes for the Host Controller
AT91C_UHP_HcPeriodCurrentED EQU (0x00A0001C) ;- (UHP) Current Isochronous or Interrupt Endpoint Descriptor
AT91C_UHP_HcControlHeadED EQU (0x00A00020) ;- (UHP) First Endpoint Descriptor of the Control list
AT91C_UHP_HcCommandStatus EQU (0x00A00008) ;- (UHP) Command & status Register
AT91C_UHP_HcFmNumber      EQU (0x00A0003C) ;- (UHP) Frame number
AT91C_UHP_HcRhDescriptorB EQU (0x00A0004C) ;- (UHP) Root Hub characteristics B
AT91C_UHP_HcBulkHeadED    EQU (0x00A00028) ;- (UHP) First endpoint register of the Bulk list
AT91C_UHP_HcFmRemaining   EQU (0x00A00038) ;- (UHP) Bit time remaining in the current Frame
AT91C_UHP_HcRevision      EQU (0x00A00000) ;- (UHP) Revision
AT91C_UHP_HcInterruptEnable EQU (0x00A00010) ;- (UHP) Interrupt Enable Register
AT91C_UHP_HcControlCurrentED EQU (0x00A00024) ;- (UHP) Endpoint Control and Status Register
AT91C_UHP_HcBulkCurrentED EQU (0x00A0002C) ;- (UHP) Current endpoint of the Bulk list
AT91C_UHP_HcHCCA          EQU (0x00A00018) ;- (UHP) Pointer to the Host Controller Communication Area
AT91C_UHP_HcPeriodicStart EQU (0x00A00040) ;- (UHP) Periodic Start
AT91C_UHP_HcRhStatus      EQU (0x00A00050) ;- (UHP) Root Hub Status register
AT91C_UHP_HcFmInterval    EQU (0x00A00034) ;- (UHP) Bit time between 2 consecutive SOFs
/* - ========== Register definition for TBOX peripheral ========== */
AT91C_TBOX_GPSSIGFILE     EQU (0x70000BA0) ;- (TBOX) GPS RFIN/DRFIN driven from files/Samples_GPS.data
AT91C_TBOX_PIOA           EQU (0x7000093C) ;- (TBOX) Value Of PIOA
AT91C_TBOX_PWM1           EQU (0x70000A08) ;- (TBOX) PWM1[4:0]=nb pulses on pb7, PWM1[9:5]=nb pulses on pc28, PWM1[20:16]=nb pulses on pb8, PWM1[25:21]=nb pulses on pc3
AT91C_TBOX_PIODENABLEFORCE EQU (0x7000092C) ;- (TBOX) If each bit is 1, the corresponding bit of PIOD is controlled by TBOX_PIODFORCEVALUE
AT91C_TBOX_PIODPUN        EQU (0x7000090C) ;- (TBOX) Spy on PIO PUN inputs
AT91C_TBOX_PIOAENABLEFORCE EQU (0x70000914) ;- (TBOX) If each bit is 1, the corresponding bit of PIOA is controlled by TBOX_PIOAFORCEVALUE
AT91C_TBOX_PIOD           EQU (0x70000948) ;- (TBOX) Value Of PIOD
AT91C_TBOX_STOPAPBSPY     EQU (0x70000A1C) ;- (TBOX) When 1, no more APB SPY messages
AT91C_TBOX_PIOEENABLEFORCE EQU (0x70000934) ;- (TBOX) If each bit is 1, the corresponding bit of PIOE is controlled by TBOX_PIOEFORCEVALUE
AT91C_TBOX_PIOBPUN        EQU (0x70000904) ;- (TBOX) Spy on PIO PUN inputs
AT91C_TBOX_USBDEV         EQU (0x70000A14) ;- (TBOX) USB device testbench : bit 0 = flag0, bit 1 = flag1
AT91C_TBOX_GPSRAND        EQU (0x70000B04) ;- (TBOX) GPS random data for correlator (Stimulus - Internal Node)
AT91C_TBOX_KBD            EQU (0x70000A18) ;- (TBOX) Keyboard testbench : bit 0 = keypressed; bits[7:6] = key column; bits[5:4] = key row;
AT91C_TBOX_PIOEFORCEVALUE EQU (0x70000938) ;- (TBOX) Value to force on PIOA when bits TBOX_PIOEENABLEFORCE are 1
AT91C_TBOX_AC97START      EQU (0x70000A00) ;- (TBOX) Start of AC97 test: swith PIO mux to connect PIOs to audio codec model.
AT91C_TBOX_PIOAPUN        EQU (0x70000900) ;- (TBOX) Spy on PIO PUN inputs
AT91C_TBOX_GPSACQSTATUS   EQU (0x70000B08) ;- (TBOX) GPS acquisition status (Probe - Internal Node)
AT91C_TBOX_PIOEPUN        EQU (0x70000910) ;- (TBOX) Spy on PIO PUN inputs
AT91C_TBOX_PIOE           EQU (0x7000094C) ;- (TBOX) Value Of PIOE
AT91C_TBOX_PIODFORCEVALUE EQU (0x70000930) ;- (TBOX) Value to force on PIOA when bits TBOX_PIODENABLEFORCE are 1
AT91C_TBOX_PWMSTART       EQU (0x70000A04) ;- (TBOX) Start of PWM test: Start to count edges on PWM IOs
AT91C_TBOX_GPSSIGIB       EQU (0x70000BB0) ;- (TBOX) GPS DRFIN[5:4] aka SIGI_B (Stimulus)
AT91C_TBOX_GPSSYNCHRO     EQU (0x70000B00) ;- (TBOX) GPS synchronization (Stimulus)
AT91C_TBOX_PIOAFORCEVALUE EQU (0x70000918) ;- (TBOX) Value to force on PIOA when bits TBOX_PIOAENABLEFORCE are 1
AT91C_TBOX_GPSACQDATA     EQU (0x70000B0C) ;- (TBOX) GPS acquisition data (Probe - Internal Node)
AT91C_TBOX_SHMCTRL        EQU (0x70000000) ;- (TBOX) SHM Probe Control: 0-> shm probe stopped, 1: shm probe started
AT91C_TBOX_MAC            EQU (0x70000A10) ;- (TBOX) MAC testbench : bit 0 = rxtrig, bit 1 = clkofftester, bit 2 = err_sig_loops
AT91C_TBOX_GPSSIGIA       EQU (0x70000BA4) ;- (TBOX) GPS DRFIN[1:0] aka SIGI_A (Stimulus)
AT91C_TBOX_PIOBFORCEVALUE EQU (0x70000920) ;- (TBOX) Value to force on PIOA when bits TBOX_PIOBENABLEFORCE are 1
AT91C_TBOX_PIOCPUN        EQU (0x70000908) ;- (TBOX) Spy on PIO PUN inputs
AT91C_TBOX_PIOCFORCEVALUE EQU (0x70000928) ;- (TBOX) Value to force on PIOA when bits TBOX_PIOCENABLEFORCE are 1
AT91C_TBOX_PIOC           EQU (0x70000944) ;- (TBOX) Value Of PIOC
AT91C_TBOX_DMAEXTREQ      EQU (0x70000810) ;- (TBOX) DMA External request lines 3 to 0
AT91C_TBOX_GPSDUMPRES     EQU (0x70000BC0) ;- (TBOX) GPS Dump results and errors
AT91C_TBOX_PIOCENABLEFORCE EQU (0x70000924) ;- (TBOX) If each bit is 1, the corresponding bit of PIOC is controlled by TBOX_PIOCFORCEVALUE
AT91C_TBOX_PWM2           EQU (0x70000A0C) ;- (TBOX) PWM2[3:0]=nb pulses on pb27, PWM2[7:4]=nb pulses on pc29, PWM2[19:16]=nb pulses on pb29, PWM2[23:20]=nb pulses on pe10
AT91C_TBOX_GPSSIGQA       EQU (0x70000BA8) ;- (TBOX) GPS DRFIN[3:2] aka SIGQ_A (Stimulus)
AT91C_TBOX_PIOB           EQU (0x70000940) ;- (TBOX) Value Of PIOB
AT91C_TBOX_PIOBENABLEFORCE EQU (0x7000091C) ;- (TBOX) If each bit is 1, the corresponding bit of PIOB is controlled by TBOX_PIOBFORCEVALUE
AT91C_TBOX_GPSSIGQB       EQU (0x70000BB4) ;- (TBOX) GPS DRFIN[7:6] aka SIGQ_B (Stimulus)
/* - ========== Register definition for HECC0 peripheral ========== */
AT91C_HECC0_SR            EQU (0xFFFFE008) ;- (HECC0)  ECC Status register
AT91C_HECC0_VR            EQU (0xFFFFE0FC) ;- (HECC0)  ECC Version register
AT91C_HECC0_CR            EQU (0xFFFFE000) ;- (HECC0)  ECC reset register
AT91C_HECC0_PR            EQU (0xFFFFE00C) ;- (HECC0)  ECC Parity register
AT91C_HECC0_MR            EQU (0xFFFFE004) ;- (HECC0)  ECC Page size register
AT91C_HECC0_NPR           EQU (0xFFFFE010) ;- (HECC0)  ECC Parity N register
/* - ========== Register definition for HECC1 peripheral ========== */
AT91C_HECC1_MR            EQU (0xFFFFE604) ;- (HECC1)  ECC Page size register
AT91C_HECC1_VR            EQU (0xFFFFE6FC) ;- (HECC1)  ECC Version register
AT91C_HECC1_PR            EQU (0xFFFFE60C) ;- (HECC1)  ECC Parity register
AT91C_HECC1_CR            EQU (0xFFFFE600) ;- (HECC1)  ECC reset register
AT91C_HECC1_NPR           EQU (0xFFFFE610) ;- (HECC1)  ECC Parity N register
AT91C_HECC1_SR            EQU (0xFFFFE608) ;- (HECC1)  ECC Status register
/* - ========== Register definition for HISI peripheral ========== */
AT91C_HISI_CDBA           EQU (0xFFFC402C) ;- (HISI) Codec Dma Address Register
AT91C_HISI_PDECF          EQU (0xFFFC4024) ;- (HISI) Preview Decimation Factor Register
AT91C_HISI_IMR            EQU (0xFFFC4014) ;- (HISI) Interrupt Mask Register
AT91C_HISI_IER            EQU (0xFFFC400C) ;- (HISI) Interrupt Enable Register
AT91C_HISI_SR             EQU (0xFFFC4008) ;- (HISI) Status Register
AT91C_HISI_Y2RSET0        EQU (0xFFFC4030) ;- (HISI) Color Space Conversion Register
AT91C_HISI_PFBD           EQU (0xFFFC4028) ;- (HISI) Preview Frame Buffer Address Register
AT91C_HISI_PSIZE          EQU (0xFFFC4020) ;- (HISI) Preview Size Register
AT91C_HISI_IDR            EQU (0xFFFC4010) ;- (HISI) Interrupt Disable Register
AT91C_HISI_R2YSET2        EQU (0xFFFC4040) ;- (HISI) Color Space Conversion Register
AT91C_HISI_R2YSET0        EQU (0xFFFC4038) ;- (HISI) Color Space Conversion Register
AT91C_HISI_CR1            EQU (0xFFFC4000) ;- (HISI) Control Register 1
AT91C_HISI_CR2            EQU (0xFFFC4004) ;- (HISI) Control Register 2
AT91C_HISI_Y2RSET1        EQU (0xFFFC4034) ;- (HISI) Color Space Conversion Register
AT91C_HISI_R2YSET1        EQU (0xFFFC403C) ;- (HISI) Color Space Conversion Register

