una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* - ******************************************************************************/
/* -               PIO DEFINITIONS FOR AT91SAM9263*/
/* - ******************************************************************************/
AT91C_PIO_PA0             EQU (1 <<  0) ;- Pin Controlled by PA0
AT91C_PA0_MCI0_DA0        EQU (AT91C_PIO_PA0) ;-  
AT91C_PA0_SPI0_MISO       EQU (AT91C_PIO_PA0) ;-  
AT91C_PIO_PA1             EQU (1 <<  1) ;- Pin Controlled by PA1
AT91C_PA1_MCI0_CDA        EQU (AT91C_PIO_PA1) ;-  
AT91C_PA1_SPI0_MOSI       EQU (AT91C_PIO_PA1) ;-  
AT91C_PIO_PA10            EQU (1 << 10) ;- Pin Controlled by PA10
AT91C_PA10_MCI1_DA2       EQU (AT91C_PIO_PA10) ;-  
AT91C_PIO_PA11            EQU (1 << 11) ;- Pin Controlled by PA11
AT91C_PA11_MCI1_DA3       EQU (AT91C_PIO_PA11) ;-  
AT91C_PIO_PA12            EQU (1 << 12) ;- Pin Controlled by PA12
AT91C_PA12_MCI0_CK        EQU (AT91C_PIO_PA12) ;-  
AT91C_PIO_PA13            EQU (1 << 13) ;- Pin Controlled by PA13
AT91C_PA13_CANTX          EQU (AT91C_PIO_PA13) ;-  
AT91C_PA13_PCK0           EQU (AT91C_PIO_PA13) ;-  
AT91C_PIO_PA14            EQU (1 << 14) ;- Pin Controlled by PA14
AT91C_PA14_CANRX          EQU (AT91C_PIO_PA14) ;-  
AT91C_PA14_IRQ0           EQU (AT91C_PIO_PA14) ;-  
AT91C_PIO_PA15            EQU (1 << 15) ;- Pin Controlled by PA15
AT91C_PA15_TCLK2          EQU (AT91C_PIO_PA15) ;-  
AT91C_PA15_IRQ1           EQU (AT91C_PIO_PA15) ;-  
AT91C_PIO_PA16            EQU (1 << 16) ;- Pin Controlled by PA16
AT91C_PA16_MCI0_CDB       EQU (AT91C_PIO_PA16) ;-  
AT91C_PA16_EBI1_D16       EQU (AT91C_PIO_PA16) ;-  
AT91C_PIO_PA17            EQU (1 << 17) ;- Pin Controlled by PA17
AT91C_PA17_MCI0_DB0       EQU (AT91C_PIO_PA17) ;-  
AT91C_PA17_EBI1_D17       EQU (AT91C_PIO_PA17) ;-  
AT91C_PIO_PA18            EQU (1 << 18) ;- Pin Controlled by PA18
AT91C_PA18_MCI0_DB1       EQU (AT91C_PIO_PA18) ;-  
AT91C_PA18_EBI1_D18       EQU (AT91C_PIO_PA18) ;-  
AT91C_PIO_PA19            EQU (1 << 19) ;- Pin Controlled by PA19
AT91C_PA19_MCI0_DB2       EQU (AT91C_PIO_PA19) ;-  
AT91C_PA19_EBI1_D19       EQU (AT91C_PIO_PA19) ;-  
AT91C_PIO_PA2             EQU (1 <<  2) ;- Pin Controlled by PA2
AT91C_PA2_UNCONNECTED_PA2_A EQU (AT91C_PIO_PA2) ;-  
AT91C_PA2_SPI0_SPCK       EQU (AT91C_PIO_PA2) ;-  
AT91C_PIO_PA20            EQU (1 << 20) ;- Pin Controlled by PA20
AT91C_PA20_MCI0_DB3       EQU (AT91C_PIO_PA20) ;-  
AT91C_PA20_EBI1_D20       EQU (AT91C_PIO_PA20) ;-  
AT91C_PIO_PA21            EQU (1 << 21) ;- Pin Controlled by PA21
AT91C_PA21_MCI1_CDB       EQU (AT91C_PIO_PA21) ;-  
AT91C_PA21_EBI1_D21       EQU (AT91C_PIO_PA21) ;-  
AT91C_PIO_PA22            EQU (1 << 22) ;- Pin Controlled by PA22
AT91C_PA22_MCI1_DB0       EQU (AT91C_PIO_PA22) ;-  
AT91C_PA22_EBI1_D22       EQU (AT91C_PIO_PA22) ;-  
AT91C_PIO_PA23            EQU (1 << 23) ;- Pin Controlled by PA23
AT91C_PA23_MCI1_DB1       EQU (AT91C_PIO_PA23) ;-  
AT91C_PA23_EBI1_D23       EQU (AT91C_PIO_PA23) ;-  
AT91C_PIO_PA24            EQU (1 << 24) ;- Pin Controlled by PA24
AT91C_PA24_MCI1_DB2       EQU (AT91C_PIO_PA24) ;-  
AT91C_PA24_EBI1_D24       EQU (AT91C_PIO_PA24) ;-  
AT91C_PIO_PA25            EQU (1 << 25) ;- Pin Controlled by PA25
AT91C_PA25_MCI1_DB3       EQU (AT91C_PIO_PA25) ;-  
AT91C_PA25_EBI1_D25       EQU (AT91C_PIO_PA25) ;-  
AT91C_PIO_PA26            EQU (1 << 26) ;- Pin Controlled by PA26
AT91C_PA26_TXD0           EQU (AT91C_PIO_PA26) ;-  
AT91C_PA26_EBI1_D26       EQU (AT91C_PIO_PA26) ;-  
AT91C_PIO_PA27            EQU (1 << 27) ;- Pin Controlled by PA27
AT91C_PA27_RXD0           EQU (AT91C_PIO_PA27) ;-  
AT91C_PA27_EBI1_D27       EQU (AT91C_PIO_PA27) ;-  
AT91C_PIO_PA28            EQU (1 << 28) ;- Pin Controlled by PA28
AT91C_PA28_RTS0           EQU (AT91C_PIO_PA28) ;-  
AT91C_PA28_EBI1_D28       EQU (AT91C_PIO_PA28) ;-  
AT91C_PIO_PA29            EQU (1 << 29) ;- Pin Controlled by PA29
AT91C_PA29_CTS0           EQU (AT91C_PIO_PA29) ;-  
AT91C_PA29_EBI1_D29       EQU (AT91C_PIO_PA29) ;-  
AT91C_PIO_PA3             EQU (1 <<  3) ;- Pin Controlled by PA3
AT91C_PA3_MCI0_DA1        EQU (AT91C_PIO_PA3) ;-  
AT91C_PA3_SPI0_NPCS1      EQU (AT91C_PIO_PA3) ;-  
AT91C_PIO_PA30            EQU (1 << 30) ;- Pin Controlled by PA30
AT91C_PA30_SCK0           EQU (AT91C_PIO_PA30) ;-  
AT91C_PA30_EBI1_D30       EQU (AT91C_PIO_PA30) ;-  
AT91C_PIO_PA31            EQU (1 << 31) ;- Pin Controlled by PA31
AT91C_PA31_DMARQ0         EQU (AT91C_PIO_PA31) ;-  
AT91C_PA31_EBI1_D31       EQU (AT91C_PIO_PA31) ;-  
AT91C_PIO_PA4             EQU (1 <<  4) ;- Pin Controlled by PA4
AT91C_PA4_MCI0_DA2        EQU (AT91C_PIO_PA4) ;-  
AT91C_PA4_SPI0_NPCS2A     EQU (AT91C_PIO_PA4) ;-  
AT91C_PIO_PA5             EQU (1 <<  5) ;- Pin Controlled by PA5
AT91C_PA5_MCI0_DA3        EQU (AT91C_PIO_PA5) ;-  
AT91C_PA5_SPI0_NPCS0      EQU (AT91C_PIO_PA5) ;-  
AT91C_PIO_PA6             EQU (1 <<  6) ;- Pin Controlled by PA6
AT91C_PA6_MCI1_CK         EQU (AT91C_PIO_PA6) ;-  
AT91C_PA6_PCK2            EQU (AT91C_PIO_PA6) ;-  
AT91C_PIO_PA7             EQU (1 <<  7) ;- Pin Controlled by PA7
AT91C_PA7_MCI1_CDA        EQU (AT91C_PIO_PA7) ;-  
AT91C_PIO_PA8             EQU (1 <<  8) ;- Pin Controlled by PA8
AT91C_PA8_MCI1_DA0        EQU (AT91C_PIO_PA8) ;-  
AT91C_PIO_PA9             EQU (1 <<  9) ;- Pin Controlled by PA9
AT91C_PA9_MCI1_DA1        EQU (AT91C_PIO_PA9) ;-  
AT91C_PIO_PB0             EQU (1 <<  0) ;- Pin Controlled by PB0
AT91C_PB0_AC97FS          EQU (AT91C_PIO_PB0) ;-  
AT91C_PB0_TF0             EQU (AT91C_PIO_PB0) ;-  
AT91C_PIO_PB1             EQU (1 <<  1) ;- Pin Controlled by PB1
AT91C_PB1_AC97CK          EQU (AT91C_PIO_PB1) ;-  
AT91C_PB1_TK0             EQU (AT91C_PIO_PB1) ;-  
AT91C_PIO_PB10            EQU (1 << 10) ;- Pin Controlled by PB10
AT91C_PB10_RK1            EQU (AT91C_PIO_PB10) ;-  
AT91C_PB10_PCK1           EQU (AT91C_PIO_PB10) ;-  
AT91C_PIO_PB11            EQU (1 << 11) ;- Pin Controlled by PB11
AT91C_PB11_RF1            EQU (AT91C_PIO_PB11) ;-  
AT91C_PB11_SPI0_NPCS3B    EQU (AT91C_PIO_PB11) ;-  
AT91C_PIO_PB12            EQU (1 << 12) ;- Pin Controlled by PB12
AT91C_PB12_SPI1_MISO      EQU (AT91C_PIO_PB12) ;-  
AT91C_PIO_PB13            EQU (1 << 13) ;- Pin Controlled by PB13
AT91C_PB13_SPI1_MOSI      EQU (AT91C_PIO_PB13) ;-  
AT91C_PIO_PB14            EQU (1 << 14) ;- Pin Controlled by PB14
AT91C_PB14_SPI1_SPCK      EQU (AT91C_PIO_PB14) ;-  
AT91C_PIO_PB15            EQU (1 << 15) ;- Pin Controlled by PB15
AT91C_PB15_SPI1_NPCS0     EQU (AT91C_PIO_PB15) ;-  
AT91C_PIO_PB16            EQU (1 << 16) ;- Pin Controlled by PB16
AT91C_PB16_SPI1_NPCS1     EQU (AT91C_PIO_PB16) ;-  
AT91C_PB16_PCK1           EQU (AT91C_PIO_PB16) ;-  
AT91C_PIO_PB17            EQU (1 << 17) ;- Pin Controlled by PB17
AT91C_PB17_SPI1_NPCS2B    EQU (AT91C_PIO_PB17) ;-  
AT91C_PB17_TIOA2          EQU (AT91C_PIO_PB17) ;-  
AT91C_PIO_PB18            EQU (1 << 18) ;- Pin Controlled by PB18
AT91C_PB18_SPI1_NPCS3B    EQU (AT91C_PIO_PB18) ;-  
AT91C_PB18_TIOB2          EQU (AT91C_PIO_PB18) ;-  
AT91C_PIO_PB19            EQU (1 << 19) ;- Pin Controlled by PB19
AT91C_PIO_PB2             EQU (1 <<  2) ;- Pin Controlled by PB2
AT91C_PB2_AC97TX          EQU (AT91C_PIO_PB2) ;-  
AT91C_PB2_TD0             EQU (AT91C_PIO_PB2) ;-  
AT91C_PIO_PB20            EQU (1 << 20) ;- Pin Controlled by PB20
AT91C_PIO_PB21            EQU (1 << 21) ;- Pin Controlled by PB21
AT91C_PIO_PB22            EQU (1 << 22) ;- Pin Controlled by PB22
AT91C_PIO_PB23            EQU (1 << 23) ;- Pin Controlled by PB23
AT91C_PIO_PB24            EQU (1 << 24) ;- Pin Controlled by PB24
AT91C_PB24_UNCONNECTED_PB24_A EQU (AT91C_PIO_PB24) ;-  
AT91C_PB24_DMARQ3         EQU (AT91C_PIO_PB24) ;-  
AT91C_PIO_PB25            EQU (1 << 25) ;- Pin Controlled by PB25
AT91C_PIO_PB26            EQU (1 << 26) ;- Pin Controlled by PB26
AT91C_PIO_PB27            EQU (1 << 27) ;- Pin Controlled by PB27
AT91C_PB27_UNCONNECTED_PB27_A EQU (AT91C_PIO_PB27) ;-  
AT91C_PB27_PWM2           EQU (AT91C_PIO_PB27) ;-  
AT91C_PIO_PB28            EQU (1 << 28) ;- Pin Controlled by PB28
AT91C_PB28_UNCONNECTED_PB28_A EQU (AT91C_PIO_PB28) ;-  
AT91C_PB28_TCLK0          EQU (AT91C_PIO_PB28) ;-  
AT91C_PIO_PB29            EQU (1 << 29) ;- Pin Controlled by PB29
AT91C_PB29_UNCONNECTED_PB29_A EQU (AT91C_PIO_PB29) ;-  
AT91C_PB29_PWM3           EQU (AT91C_PIO_PB29) ;-  
AT91C_PIO_PB3             EQU (1 <<  3) ;- Pin Controlled by PB3
AT91C_PB3_AC97RX          EQU (AT91C_PIO_PB3) ;-  
AT91C_PB3_RD0             EQU (AT91C_PIO_PB3) ;-  
AT91C_PIO_PB30            EQU (1 << 30) ;- Pin Controlled by PB30
AT91C_PIO_PB31            EQU (1 << 31) ;- Pin Controlled by PB31
AT91C_PIO_PB4             EQU (1 <<  4) ;- Pin Controlled by PB4
AT91C_PB4_TWD             EQU (AT91C_PIO_PB4) ;-  
AT91C_PB4_RK0             EQU (AT91C_PIO_PB4) ;-  
AT91C_PIO_PB5             EQU (1 <<  5) ;- Pin Controlled by PB5
AT91C_PB5_TWCK            EQU (AT91C_PIO_PB5) ;-  
AT91C_PB5_RF0             EQU (AT91C_PIO_PB5) ;-  
AT91C_PIO_PB6             EQU (1 <<  6) ;- Pin Controlled by PB6
AT91C_PB6_TF1             EQU (AT91C_PIO_PB6) ;-  
AT91C_PB6_DMARQ1          EQU (AT91C_PIO_PB6) ;-  
AT91C_PIO_PB7             EQU (1 <<  7) ;- Pin Controlled by PB7
AT91C_PB7_TK1             EQU (AT91C_PIO_PB7) ;-  
AT91C_PB7_PWM0            EQU (AT91C_PIO_PB7) ;-  
AT91C_PIO_PB8             EQU (1 <<  8) ;- Pin Controlled by PB8
AT91C_PB8_TD1             EQU (AT91C_PIO_PB8) ;-  
AT91C_PB8_PWM1            EQU (AT91C_PIO_PB8) ;-  
AT91C_PIO_PB9             EQU (1 <<  9) ;- Pin Controlled by PB9
AT91C_PB9_RD1             EQU (AT91C_PIO_PB9) ;-  
AT91C_PB9_LCDCC           EQU (AT91C_PIO_PB9) ;-  
AT91C_PIO_PC0             EQU (1 <<  0) ;- Pin Controlled by PC0
AT91C_PC0_LCDVSYNC        EQU (AT91C_PIO_PC0) ;-  
AT91C_PIO_PC1             EQU (1 <<  1) ;- Pin Controlled by PC1
AT91C_PC1_LCDHSYNC        EQU (AT91C_PIO_PC1) ;-  
AT91C_PIO_PC10            EQU (1 << 10) ;- Pin Controlled by PC10
AT91C_PC10_LCDD6          EQU (AT91C_PIO_PC10) ;-  
AT91C_PC10_LCDD11B        EQU (AT91C_PIO_PC10) ;-  
AT91C_PIO_PC11            EQU (1 << 11) ;- Pin Controlled by PC11
AT91C_PC11_LCDD7          EQU (AT91C_PIO_PC11) ;-  
AT91C_PC11_LCDD12B        EQU (AT91C_PIO_PC11) ;-  
AT91C_PIO_PC12            EQU (1 << 12) ;- Pin Controlled by PC12
AT91C_PC12_LCDD8          EQU (AT91C_PIO_PC12) ;-  
AT91C_PC12_LCDD13B        EQU (AT91C_PIO_PC12) ;-  
AT91C_PIO_PC13            EQU (1 << 13) ;- Pin Controlled by PC13
AT91C_PC13_LCDD9          EQU (AT91C_PIO_PC13) ;-  
AT91C_PC13_LCDD14B        EQU (AT91C_PIO_PC13) ;-  
AT91C_PIO_PC14            EQU (1 << 14) ;- Pin Controlled by PC14
AT91C_PC14_LCDD10         EQU (AT91C_PIO_PC14) ;-  
AT91C_PC14_LCDD15B        EQU (AT91C_PIO_PC14) ;-  
AT91C_PIO_PC15            EQU (1 << 15) ;- Pin Controlled by PC15
AT91C_PC15_LCDD11         EQU (AT91C_PIO_PC15) ;-  
AT91C_PC15_LCDD19B        EQU (AT91C_PIO_PC15) ;-  
AT91C_PIO_PC16            EQU (1 << 16) ;- Pin Controlled by PC16
AT91C_PC16_LCDD12         EQU (AT91C_PIO_PC16) ;-  
AT91C_PC16_LCDD20B        EQU (AT91C_PIO_PC16) ;-  
AT91C_PIO_PC17            EQU (1 << 17) ;- Pin Controlled by PC17
AT91C_PC17_LCDD13         EQU (AT91C_PIO_PC17) ;-  
AT91C_PC17_LCDD21B        EQU (AT91C_PIO_PC17) ;-  
AT91C_PIO_PC18            EQU (1 << 18) ;- Pin Controlled by PC18
AT91C_PC18_LCDD14         EQU (AT91C_PIO_PC18) ;-  
AT91C_PC18_LCDD22B        EQU (AT91C_PIO_PC18) ;-  
AT91C_PIO_PC19            EQU (1 << 19) ;- Pin Controlled by PC19
AT91C_PC19_LCDD15         EQU (AT91C_PIO_PC19) ;-  
AT91C_PC19_LCDD23B        EQU (AT91C_PIO_PC19) ;-  
AT91C_PIO_PC2             EQU (1 <<  2) ;- Pin Controlled by PC2
AT91C_PC2_LCDDOTCK        EQU (AT91C_PIO_PC2) ;-  
AT91C_PIO_PC20            EQU (1 << 20) ;- Pin Controlled by PC20
AT91C_PC20_LCDD16         EQU (AT91C_PIO_PC20) ;-  
AT91C_PC20_ETX2           EQU (AT91C_PIO_PC20) ;-  
AT91C_PIO_PC21            EQU (1 << 21) ;- Pin Controlled by PC21
AT91C_PC21_LCDD17         EQU (AT91C_PIO_PC21) ;-  
AT91C_PC21_ETX3           EQU (AT91C_PIO_PC21) ;-  
AT91C_PIO_PC22            EQU (1 << 22) ;- Pin Controlled by PC22
AT91C_PC22_LCDD18         EQU (AT91C_PIO_PC22) ;-  
AT91C_PC22_ERX2           EQU (AT91C_PIO_PC22) ;-  
AT91C_PIO_PC23            EQU (1 << 23) ;- Pin Controlled by PC23
AT91C_PC23_LCDD19         EQU (AT91C_PIO_PC23) ;-  
AT91C_PC23_ERX3           EQU (AT91C_PIO_PC23) ;-  
AT91C_PIO_PC24            EQU (1 << 24) ;- Pin Controlled by PC24
AT91C_PC24_LCDD20         EQU (AT91C_PIO_PC24) ;-  
AT91C_PC24_ETXER          EQU (AT91C_PIO_PC24) ;-  
AT91C_PIO_PC25            EQU (1 << 25) ;- Pin Controlled by PC25
AT91C_PC25_LCDD21         EQU (AT91C_PIO_PC25) ;-  
AT91C_PC25_ERXDV          EQU (AT91C_PIO_PC25) ;-  
AT91C_PIO_PC26            EQU (1 << 26) ;- Pin Controlled by PC26
AT91C_PC26_LCDD22         EQU (AT91C_PIO_PC26) ;-  
AT91C_PC26_ECOL           EQU (AT91C_PIO_PC26) ;-  
AT91C_PIO_PC27            EQU (1 << 27) ;- Pin Controlled by PC27
AT91C_PC27_LCDD23         EQU (AT91C_PIO_PC27) ;-  
AT91C_PC27_ERXCK          EQU (AT91C_PIO_PC27) ;-  
AT91C_PIO_PC28            EQU (1 << 28) ;- Pin Controlled by PC28
AT91C_PC28_PWM0           EQU (AT91C_PIO_PC28) ;-  
AT91C_PC28_TCLK1          EQU (AT91C_PIO_PC28) ;-  
AT91C_PIO_PC29            EQU (1 << 29) ;- Pin Controlled by PC29
AT91C_PC29_PCK0           EQU (AT91C_PIO_PC29) ;-  
AT91C_PC29_PWM2           EQU (AT91C_PIO_PC29) ;-  
AT91C_PIO_PC3             EQU (1 <<  3) ;- Pin Controlled by PC3
AT91C_PC3_LCDEN           EQU (AT91C_PIO_PC3) ;-  
AT91C_PC3_PWM1            EQU (AT91C_PIO_PC3) ;-  
AT91C_PIO_PC30            EQU (1 << 30) ;- Pin Controlled by PC30
AT91C_PC30_DRXD           EQU (AT91C_PIO_PC30) ;-  
AT91C_PIO_PC31            EQU (1 << 31) ;- Pin Controlled by PC31
AT91C_PC31_DTXD           EQU (AT91C_PIO_PC31) ;-  
AT91C_PIO_PC4             EQU (1 <<  4) ;- Pin Controlled by PC4
AT91C_PC4_LCDD0           EQU (AT91C_PIO_PC4) ;-  
AT91C_PC4_LCDD3B          EQU (AT91C_PIO_PC4) ;-  
AT91C_PIO_PC5             EQU (1 <<  5) ;- Pin Controlled by PC5
AT91C_PC5_LCDD1           EQU (AT91C_PIO_PC5) ;-  
AT91C_PC5_LCDD4B          EQU (AT91C_PIO_PC5) ;-  
AT91C_PIO_PC6             EQU (1 <<  6) ;- Pin Controlled by PC6
AT91C_PC6_LCDD2           EQU (AT91C_PIO_PC6) ;-  
AT91C_PC6_LCDD5B          EQU (AT91C_PIO_PC6) ;-  
AT91C_PIO_PC7             EQU (1 <<  7) ;- Pin Controlled by PC7
AT91C_PC7_LCDD3           EQU (AT91C_PIO_PC7) ;-  
AT91C_PC7_LCDD6B          EQU (AT91C_PIO_PC7) ;-  
AT91C_PIO_PC8             EQU (1 <<  8) ;- Pin Controlled by PC8
AT91C_PC8_LCDD4           EQU (AT91C_PIO_PC8) ;-  
AT91C_PC8_LCDD7B          EQU (AT91C_PIO_PC8) ;-  
AT91C_PIO_PC9             EQU (1 <<  9) ;- Pin Controlled by PC9
AT91C_PC9_LCDD5           EQU (AT91C_PIO_PC9) ;-  
AT91C_PC9_LCDD10B         EQU (AT91C_PIO_PC9) ;-  
AT91C_PIO_PD0             EQU (1 <<  0) ;- Pin Controlled by PD0
AT91C_PD0_TXD1            EQU (AT91C_PIO_PD0) ;-  
AT91C_PD0_SPI0_NPCS2D     EQU (AT91C_PIO_PD0) ;-  
AT91C_PIO_PD1             EQU (1 <<  1) ;- Pin Controlled by PD1
AT91C_PD1_RXD1            EQU (AT91C_PIO_PD1) ;-  
AT91C_PD1_SPI0_NPCS3D     EQU (AT91C_PIO_PD1) ;-  
AT91C_PIO_PD10            EQU (1 << 10) ;- Pin Controlled by PD10
AT91C_PD10_UNCONNECTED_PD10_A EQU (AT91C_PIO_PD10) ;-  
AT91C_PD10_SCK1           EQU (AT91C_PIO_PD10) ;-  
AT91C_PIO_PD11            EQU (1 << 11) ;- Pin Controlled by PD11
AT91C_PD11_EBI0_NCS2      EQU (AT91C_PIO_PD11) ;-  
AT91C_PD11_TSYNC          EQU (AT91C_PIO_PD11) ;-  
AT91C_PIO_PD12            EQU (1 << 12) ;- Pin Controlled by PD12
AT91C_PD12_EBI0_A23       EQU (AT91C_PIO_PD12) ;-  
AT91C_PD12_TCLK           EQU (AT91C_PIO_PD12) ;-  
AT91C_PIO_PD13            EQU (1 << 13) ;- Pin Controlled by PD13
AT91C_PD13_EBI0_A24       EQU (AT91C_PIO_PD13) ;-  
AT91C_PD13_TPS0           EQU (AT91C_PIO_PD13) ;-  
AT91C_PIO_PD14            EQU (1 << 14) ;- Pin Controlled by PD14
AT91C_PD14_EBI0_A25_CFNRW EQU (AT91C_PIO_PD14) ;-  
AT91C_PD14_TPS1           EQU (AT91C_PIO_PD14) ;-  
AT91C_PIO_PD15            EQU (1 << 15) ;- Pin Controlled by PD15
AT91C_PD15_EBI0_NCS3_NANDCS EQU (AT91C_PIO_PD15) ;-  
AT91C_PD15_TPS2           EQU (AT91C_PIO_PD15) ;-  
AT91C_PIO_PD16            EQU (1 << 16) ;- Pin Controlled by PD16
AT91C_PD16_EBI0_D16       EQU (AT91C_PIO_PD16) ;-  
AT91C_PD16_TPK0           EQU (AT91C_PIO_PD16) ;-  
AT91C_PIO_PD17            EQU (1 << 17) ;- Pin Controlled by PD17
AT91C_PD17_EBI0_D17       EQU (AT91C_PIO_PD17) ;-  
AT91C_PD17_TPK1           EQU (AT91C_PIO_PD17) ;-  
AT91C_PIO_PD18            EQU (1 << 18) ;- Pin Controlled by PD18
AT91C_PD18_EBI0_D18       EQU (AT91C_PIO_PD18) ;-  
AT91C_PD18_TPK2           EQU (AT91C_PIO_PD18) ;-  
AT91C_PIO_PD19            EQU (1 << 19) ;- Pin Controlled by PD19
AT91C_PD19_EBI0_D19       EQU (AT91C_PIO_PD19) ;-  
AT91C_PD19_TPK3           EQU (AT91C_PIO_PD19) ;-  
AT91C_PIO_PD2             EQU (1 <<  2) ;- Pin Controlled by PD2
AT91C_PD2_TXD2            EQU (AT91C_PIO_PD2) ;-  
AT91C_PD2_SPI1_NPCS2D     EQU (AT91C_PIO_PD2) ;-  
AT91C_PIO_PD20            EQU (1 << 20) ;- Pin Controlled by PD20
AT91C_PD20_EBI0_D20       EQU (AT91C_PIO_PD20) ;-  
AT91C_PD20_TPK4           EQU (AT91C_PIO_PD20) ;-  
AT91C_PIO_PD21            EQU (1 << 21) ;- Pin Controlled by PD21
AT91C_PD21_EBI0_D21       EQU (AT91C_PIO_PD21) ;-  
AT91C_PD21_TPK5           EQU (AT91C_PIO_PD21) ;-  
AT91C_PIO_PD22            EQU (1 << 22) ;- Pin Controlled by PD22
AT91C_PD22_EBI0_D22       EQU (AT91C_PIO_PD22) ;-  
AT91C_PD22_TPK6           EQU (AT91C_PIO_PD22) ;-  
AT91C_PIO_PD23            EQU (1 << 23) ;- Pin Controlled by PD23
AT91C_PD23_EBI0_D23       EQU (AT91C_PIO_PD23) ;-  
AT91C_PD23_TPK7           EQU (AT91C_PIO_PD23) ;-  
AT91C_PIO_PD24            EQU (1 << 24) ;- Pin Controlled by PD24
AT91C_PD24_EBI0_D24       EQU (AT91C_PIO_PD24) ;-  
AT91C_PD24_TPK8           EQU (AT91C_PIO_PD24) ;-  
AT91C_PIO_PD25            EQU (1 << 25) ;- Pin Controlled by PD25
AT91C_PD25_EBI0_D25       EQU (AT91C_PIO_PD25) ;-  
AT91C_PD25_TPK9           EQU (AT91C_PIO_PD25) ;-  
AT91C_PIO_PD26            EQU (1 << 26) ;- Pin Controlled by PD26
AT91C_PD26_EBI0_D26       EQU (AT91C_PIO_PD26) ;-  
AT91C_PD26_TPK10          EQU (AT91C_PIO_PD26) ;-  
AT91C_PIO_PD27            EQU (1 << 27) ;- Pin Controlled by PD27
AT91C_PD27_EBI0_D27       EQU (AT91C_PIO_PD27) ;-  
AT91C_PD27_TPK11          EQU (AT91C_PIO_PD27) ;-  
AT91C_PIO_PD28            EQU (1 << 28) ;- Pin Controlled by PD28
AT91C_PD28_EBI0_D28       EQU (AT91C_PIO_PD28) ;-  
AT91C_PD28_TPK12          EQU (AT91C_PIO_PD28) ;-  
AT91C_PIO_PD29            EQU (1 << 29) ;- Pin Controlled by PD29
AT91C_PD29_EBI0_D29       EQU (AT91C_PIO_PD29) ;-  
AT91C_PD29_TPK13          EQU (AT91C_PIO_PD29) ;-  
AT91C_PIO_PD3             EQU (1 <<  3) ;- Pin Controlled by PD3
AT91C_PD3_RXD2            EQU (AT91C_PIO_PD3) ;-  
AT91C_PD3_SPI1_NPCS3D     EQU (AT91C_PIO_PD3) ;-  
AT91C_PIO_PD30            EQU (1 << 30) ;- Pin Controlled by PD30
AT91C_PD30_EBI0_D30       EQU (AT91C_PIO_PD30) ;-  
AT91C_PD30_TPK14          EQU (AT91C_PIO_PD30) ;-  
AT91C_PIO_PD31            EQU (1 << 31) ;- Pin Controlled by PD31
AT91C_PD31_EBI0_D31       EQU (AT91C_PIO_PD31) ;-  
AT91C_PD31_TPK15          EQU (AT91C_PIO_PD31) ;-  
AT91C_PIO_PD4             EQU (1 <<  4) ;- Pin Controlled by PD4
AT91C_PD4_FIQ             EQU (AT91C_PIO_PD4) ;-  
AT91C_PD4_DMARQ2          EQU (AT91C_PIO_PD4) ;-  
AT91C_PIO_PD5             EQU (1 <<  5) ;- Pin Controlled by PD5
AT91C_PD5_EBI0_NWAIT      EQU (AT91C_PIO_PD5) ;-  
AT91C_PD5_RTS2            EQU (AT91C_PIO_PD5) ;-  
AT91C_PIO_PD6             EQU (1 <<  6) ;- Pin Controlled by PD6
AT91C_PD6_EBI0_NCS4_CFCS0 EQU (AT91C_PIO_PD6) ;-  
AT91C_PD6_CTS2            EQU (AT91C_PIO_PD6) ;-  
AT91C_PIO_PD7             EQU (1 <<  7) ;- Pin Controlled by PD7
AT91C_PD7_EBI0_NCS5_CFCS1 EQU (AT91C_PIO_PD7) ;-  
AT91C_PD7_RTS1            EQU (AT91C_PIO_PD7) ;-  
AT91C_PIO_PD8             EQU (1 <<  8) ;- Pin Controlled by PD8
AT91C_PD8_EBI0_CFCE1      EQU (AT91C_PIO_PD8) ;-  
AT91C_PD8_CTS1            EQU (AT91C_PIO_PD8) ;-  
AT91C_PIO_PD9             EQU (1 <<  9) ;- Pin Controlled by PD9
AT91C_PD9_EBI0_CFCE2      EQU (AT91C_PIO_PD9) ;-  
AT91C_PD9_SCK2            EQU (AT91C_PIO_PD9) ;-  
AT91C_PIO_PE0             EQU (1 <<  0) ;- Pin Controlled by PE0
AT91C_PE0_ISI_D0          EQU (AT91C_PIO_PE0) ;-  
AT91C_PIO_PE1             EQU (1 <<  1) ;- Pin Controlled by PE1
AT91C_PE1_ISI_D1          EQU (AT91C_PIO_PE1) ;-  
AT91C_PIO_PE10            EQU (1 << 10) ;- Pin Controlled by PE10
AT91C_PE10_ISI_VSYNC      EQU (AT91C_PIO_PE10) ;-  
AT91C_PE10_PWM3           EQU (AT91C_PIO_PE10) ;-  
AT91C_PIO_PE11            EQU (1 << 11) ;- Pin Controlled by PE11
AT91C_PE11_ISI_MCK        EQU (AT91C_PIO_PE11) ;-  
AT91C_PE11_PCK3           EQU (AT91C_PIO_PE11) ;-  
AT91C_PIO_PE12            EQU (1 << 12) ;- Pin Controlled by PE12
AT91C_PE12_KBDR0          EQU (AT91C_PIO_PE12) ;-  
AT91C_PE12_ISI_D8         EQU (AT91C_PIO_PE12) ;-  
AT91C_PIO_PE13            EQU (1 << 13) ;- Pin Controlled by PE13
AT91C_PE13_KBDR1          EQU (AT91C_PIO_PE13) ;-  
AT91C_PE13_ISI_D9         EQU (AT91C_PIO_PE13) ;-  
AT91C_PIO_PE14            EQU (1 << 14) ;- Pin Controlled by PE14
AT91C_PE14_KBDR2          EQU (AT91C_PIO_PE14) ;-  
AT91C_PE14_ISI_D10        EQU (AT91C_PIO_PE14) ;-  
AT91C_PIO_PE15            EQU (1 << 15) ;- Pin Controlled by PE15
AT91C_PE15_KBDR3          EQU (AT91C_PIO_PE15) ;-  
AT91C_PE15_ISI_D11        EQU (AT91C_PIO_PE15) ;-  
AT91C_PIO_PE16            EQU (1 << 16) ;- Pin Controlled by PE16
AT91C_PE16_KBDR4          EQU (AT91C_PIO_PE16) ;-  
AT91C_PIO_PE17            EQU (1 << 17) ;- Pin Controlled by PE17
AT91C_PE17_KBDC0          EQU (AT91C_PIO_PE17) ;-  
AT91C_PIO_PE18            EQU (1 << 18) ;- Pin Controlled by PE18
AT91C_PE18_KBDC1          EQU (AT91C_PIO_PE18) ;-  
AT91C_PE18_TIOA0          EQU (AT91C_PIO_PE18) ;-  
AT91C_PIO_PE19            EQU (1 << 19) ;- Pin Controlled by PE19
AT91C_PE19_KBDC2          EQU (AT91C_PIO_PE19) ;-  
AT91C_PE19_TIOB0          EQU (AT91C_PIO_PE19) ;-  
AT91C_PIO_PE2             EQU (1 <<  2) ;- Pin Controlled by PE2
AT91C_PE2_ISI_D2          EQU (AT91C_PIO_PE2) ;-  
AT91C_PIO_PE20            EQU (1 << 20) ;- Pin Controlled by PE20
AT91C_PE20_KBDC3          EQU (AT91C_PIO_PE20) ;-  
AT91C_PE20_EBI1_NWAIT     EQU (AT91C_PIO_PE20) ;-  
AT91C_PIO_PE21            EQU (1 << 21) ;- Pin Controlled by PE21
AT91C_PE21_ETXCK          EQU (AT91C_PIO_PE21) ;-  
AT91C_PE21_EBI1_NANDWE    EQU (AT91C_PIO_PE21) ;-  
AT91C_PIO_PE22            EQU (1 << 22) ;- Pin Controlled by PE22
AT91C_PE22_ECRS           EQU (AT91C_PIO_PE22) ;-  
AT91C_PE22_EBI1_NCS2_NANDCS EQU (AT91C_PIO_PE22) ;-  
AT91C_PIO_PE23            EQU (1 << 23) ;- Pin Controlled by PE23
AT91C_PE23_ETX0           EQU (AT91C_PIO_PE23) ;-  
AT91C_PE23_EBI1_NANDOE    EQU (AT91C_PIO_PE23) ;-  
AT91C_PIO_PE24            EQU (1 << 24) ;- Pin Controlled by PE24
AT91C_PE24_ETX1           EQU (AT91C_PIO_PE24) ;-  
AT91C_PE24_EBI1_NWR3_NBS3 EQU (AT91C_PIO_PE24) ;-  
AT91C_PIO_PE25            EQU (1 << 25) ;- Pin Controlled by PE25
AT91C_PE25_ERX0           EQU (AT91C_PIO_PE25) ;-  
AT91C_PE25_EBI1_NCS1_SDCS EQU (AT91C_PIO_PE25) ;-  
AT91C_PIO_PE26            EQU (1 << 26) ;- Pin Controlled by PE26
AT91C_PE26_ERX1           EQU (AT91C_PIO_PE26) ;-  
AT91C_PIO_PE27            EQU (1 << 27) ;- Pin Controlled by PE27
AT91C_PE27_ERXER          EQU (AT91C_PIO_PE27) ;-  
AT91C_PE27_EBI1_SDCKE     EQU (AT91C_PIO_PE27) ;-  
AT91C_PIO_PE28            EQU (1 << 28) ;- Pin Controlled by PE28
AT91C_PE28_ETXEN          EQU (AT91C_PIO_PE28) ;-  
