una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
AT91C_PE28_EBI1_RAS       EQU (AT91C_PIO_PE28) ;-  
AT91C_PIO_PE29            EQU (1 << 29) ;- Pin Controlled by PE29
AT91C_PE29_EMDC           EQU (AT91C_PIO_PE29) ;-  
AT91C_PE29_EBI1_CAS       EQU (AT91C_PIO_PE29) ;-  
AT91C_PIO_PE3             EQU (1 <<  3) ;- Pin Controlled by PE3
AT91C_PE3_ISI_D3          EQU (AT91C_PIO_PE3) ;-  
AT91C_PIO_PE30            EQU (1 << 30) ;- Pin Controlled by PE30
AT91C_PE30_EMDIO          EQU (AT91C_PIO_PE30) ;-  
AT91C_PE30_EBI1_SDWE      EQU (AT91C_PIO_PE30) ;-  
AT91C_PIO_PE31            EQU (1 << 31) ;- Pin Controlled by PE31
AT91C_PE31_EF100          EQU (AT91C_PIO_PE31) ;-  
AT91C_PE31_EBI1_SDA10     EQU (AT91C_PIO_PE31) ;-  
AT91C_PIO_PE4             EQU (1 <<  4) ;- Pin Controlled by PE4
AT91C_PE4_ISI_D4          EQU (AT91C_PIO_PE4) ;-  
AT91C_PIO_PE5             EQU (1 <<  5) ;- Pin Controlled by PE5
AT91C_PE5_ISI_D5          EQU (AT91C_PIO_PE5) ;-  
AT91C_PIO_PE6             EQU (1 <<  6) ;- Pin Controlled by PE6
AT91C_PE6_ISI_D6          EQU (AT91C_PIO_PE6) ;-  
AT91C_PIO_PE7             EQU (1 <<  7) ;- Pin Controlled by PE7
AT91C_PE7_ISI_D7          EQU (AT91C_PIO_PE7) ;-  
AT91C_PIO_PE8             EQU (1 <<  8) ;- Pin Controlled by PE8
AT91C_PE8_ISI_PCK         EQU (AT91C_PIO_PE8) ;-  
AT91C_PE8_TIOA1           EQU (AT91C_PIO_PE8) ;-  
AT91C_PIO_PE9             EQU (1 <<  9) ;- Pin Controlled by PE9
AT91C_PE9_ISI_HSYNC       EQU (AT91C_PIO_PE9) ;-  
AT91C_PE9_TIOB1           EQU (AT91C_PIO_PE9) ;-  

/* - ******************************************************************************/
/* -               PERIPHERAL ID DEFINITIONS FOR AT91SAM9263*/
/* - ******************************************************************************/
AT91C_ID_FIQ              EQU ( 0) ;- Advanced Interrupt Controller (FIQ)
AT91C_ID_SYS              EQU ( 1) ;- System Controller
AT91C_ID_PIOA             EQU ( 2) ;- Parallel IO Controller A
AT91C_ID_PIOB             EQU ( 3) ;- Parallel IO Controller B
AT91C_ID_PIOCDE           EQU ( 4) ;- Parallel IO Controller C, Parallel IO Controller D, Parallel IO Controller E
AT91C_ID_US0              EQU ( 7) ;- USART 0
AT91C_ID_US1              EQU ( 8) ;- USART 1
AT91C_ID_US2              EQU ( 9) ;- USART 2
AT91C_ID_MCI0             EQU (10) ;- Multimedia Card Interface 0
AT91C_ID_MCI1             EQU (11) ;- Multimedia Card Interface 1
AT91C_ID_CAN              EQU (12) ;- CAN Controller
AT91C_ID_TWI              EQU (13) ;- Two-Wire Interface
AT91C_ID_SPI0             EQU (14) ;- Serial Peripheral Interface 0
AT91C_ID_SPI1             EQU (15) ;- Serial Peripheral Interface 1
AT91C_ID_SSC0             EQU (16) ;- Serial Synchronous Controller 0
AT91C_ID_SSC1             EQU (17) ;- Serial Synchronous Controller 1
AT91C_ID_AC97C            EQU (18) ;- AC97 Controller
AT91C_ID_TC012            EQU (19) ;- Timer Counter 0, Timer Counter 1, Timer Counter 2
AT91C_ID_PWMC             EQU (20) ;- PWM Controller
AT91C_ID_EMAC             EQU (21) ;- Ethernet Mac
AT91C_ID_UDP              EQU (24) ;- USB Device Port
AT91C_ID_HISI             EQU (25) ;- Image Sensor Interface
AT91C_ID_LCDC             EQU (26) ;- LCD Controller
AT91C_ID_DMA              EQU (27) ;- DMA Controller
AT91C_ID_UHP              EQU (29) ;- USB Host Port
AT91C_ID_IRQ0             EQU (30) ;- Advanced Interrupt Controller (IRQ0)
AT91C_ID_IRQ1             EQU (31) ;- Advanced Interrupt Controller (IRQ1)
AT91C_ALL_INT             EQU (0xEF3FFF9F) ;- ALL VALID INTERRUPTS

/* - ******************************************************************************/
/* -               BASE ADDRESS DEFINITIONS FOR AT91SAM9263*/
/* - ******************************************************************************/
AT91C_BASE_SYS            EQU (0xFFFFE000) ;- (SYS) Base Address
AT91C_BASE_EBI0           EQU (0xFFFFE200) ;- (EBI0) Base Address
AT91C_BASE_SDRAMC0        EQU (0xFFFFE200) ;- (SDRAMC0) Base Address
AT91C_BASE_SMC0           EQU (0xFFFFE400) ;- (SMC0) Base Address
AT91C_BASE_EBI1           EQU (0xFFFFE800) ;- (EBI1) Base Address
AT91C_BASE_SDRAMC1        EQU (0xFFFFE800) ;- (SDRAMC1) Base Address
AT91C_BASE_SMC1           EQU (0xFFFFEA00) ;- (SMC1) Base Address
AT91C_BASE_MATRIX         EQU (0xFFFFEC00) ;- (MATRIX) Base Address
AT91C_BASE_CCFG           EQU (0xFFFFED10) ;- (CCFG) Base Address
AT91C_BASE_PDC_DBGU       EQU (0xFFFFEF00) ;- (PDC_DBGU) Base Address
AT91C_BASE_DBGU           EQU (0xFFFFEE00) ;- (DBGU) Base Address
AT91C_BASE_AIC            EQU (0xFFFFF000) ;- (AIC) Base Address
AT91C_BASE_PIOA           EQU (0xFFFFF200) ;- (PIOA) Base Address
AT91C_BASE_PIOB           EQU (0xFFFFF400) ;- (PIOB) Base Address
AT91C_BASE_PIOC           EQU (0xFFFFF600) ;- (PIOC) Base Address
AT91C_BASE_PIOD           EQU (0xFFFFF800) ;- (PIOD) Base Address
AT91C_BASE_PIOE           EQU (0xFFFFFA00) ;- (PIOE) Base Address
AT91C_BASE_CKGR           EQU (0xFFFFFC20) ;- (CKGR) Base Address
AT91C_BASE_PMC            EQU (0xFFFFFC00) ;- (PMC) Base Address
AT91C_BASE_RSTC           EQU (0xFFFFFD00) ;- (RSTC) Base Address
AT91C_BASE_SHDWC          EQU (0xFFFFFD10) ;- (SHDWC) Base Address
AT91C_BASE_RTTC0          EQU (0xFFFFFD20) ;- (RTTC0) Base Address
AT91C_BASE_RTTC1          EQU (0xFFFFFD50) ;- (RTTC1) Base Address
AT91C_BASE_PITC           EQU (0xFFFFFD30) ;- (PITC) Base Address
AT91C_BASE_WDTC           EQU (0xFFFFFD40) ;- (WDTC) Base Address
AT91C_BASE_TC0            EQU (0xFFF7C000) ;- (TC0) Base Address
AT91C_BASE_TC1            EQU (0xFFF7C040) ;- (TC1) Base Address
AT91C_BASE_TC2            EQU (0xFFF7C080) ;- (TC2) Base Address
AT91C_BASE_TCB0           EQU (0xFFF7C000) ;- (TCB0) Base Address
AT91C_BASE_TCB1           EQU (0xFFF7C040) ;- (TCB1) Base Address
AT91C_BASE_TCB2           EQU (0xFFF7C080) ;- (TCB2) Base Address
AT91C_BASE_PDC_MCI0       EQU (0xFFF80100) ;- (PDC_MCI0) Base Address
AT91C_BASE_MCI0           EQU (0xFFF80000) ;- (MCI0) Base Address
AT91C_BASE_PDC_MCI1       EQU (0xFFF84100) ;- (PDC_MCI1) Base Address
AT91C_BASE_MCI1           EQU (0xFFF84000) ;- (MCI1) Base Address
AT91C_BASE_TWI            EQU (0xFFF88000) ;- (TWI) Base Address
AT91C_BASE_PDC_US0        EQU (0xFFF8C100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0xFFF8C000) ;- (US0) Base Address
AT91C_BASE_PDC_US1        EQU (0xFFF90100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0xFFF90000) ;- (US1) Base Address
AT91C_BASE_PDC_US2        EQU (0xFFF94100) ;- (PDC_US2) Base Address
AT91C_BASE_US2            EQU (0xFFF94000) ;- (US2) Base Address
AT91C_BASE_PDC_SSC0       EQU (0xFFF98100) ;- (PDC_SSC0) Base Address
AT91C_BASE_SSC0           EQU (0xFFF98000) ;- (SSC0) Base Address
AT91C_BASE_PDC_SSC1       EQU (0xFFF9C100) ;- (PDC_SSC1) Base Address
AT91C_BASE_SSC1           EQU (0xFFF9C000) ;- (SSC1) Base Address
AT91C_BASE_PDC_AC97C      EQU (0xFFFA0100) ;- (PDC_AC97C) Base Address
AT91C_BASE_AC97C          EQU (0xFFFA0000) ;- (AC97C) Base Address
AT91C_BASE_PDC_SPI0       EQU (0xFFFA4100) ;- (PDC_SPI0) Base Address
AT91C_BASE_SPI0           EQU (0xFFFA4000) ;- (SPI0) Base Address
AT91C_BASE_PDC_SPI1       EQU (0xFFFA8100) ;- (PDC_SPI1) Base Address
AT91C_BASE_SPI1           EQU (0xFFFA8000) ;- (SPI1) Base Address
AT91C_BASE_CAN_MB0        EQU (0xFFFAC200) ;- (CAN_MB0) Base Address
AT91C_BASE_CAN_MB1        EQU (0xFFFAC220) ;- (CAN_MB1) Base Address
AT91C_BASE_CAN_MB2        EQU (0xFFFAC240) ;- (CAN_MB2) Base Address
AT91C_BASE_CAN_MB3        EQU (0xFFFAC260) ;- (CAN_MB3) Base Address
AT91C_BASE_CAN_MB4        EQU (0xFFFAC280) ;- (CAN_MB4) Base Address
AT91C_BASE_CAN_MB5        EQU (0xFFFAC2A0) ;- (CAN_MB5) Base Address
AT91C_BASE_CAN_MB6        EQU (0xFFFAC2C0) ;- (CAN_MB6) Base Address
AT91C_BASE_CAN_MB7        EQU (0xFFFAC2E0) ;- (CAN_MB7) Base Address
AT91C_BASE_CAN_MB8        EQU (0xFFFAC300) ;- (CAN_MB8) Base Address
AT91C_BASE_CAN_MB9        EQU (0xFFFAC320) ;- (CAN_MB9) Base Address
AT91C_BASE_CAN_MB10       EQU (0xFFFAC340) ;- (CAN_MB10) Base Address
AT91C_BASE_CAN_MB11       EQU (0xFFFAC360) ;- (CAN_MB11) Base Address
AT91C_BASE_CAN_MB12       EQU (0xFFFAC380) ;- (CAN_MB12) Base Address
AT91C_BASE_CAN_MB13       EQU (0xFFFAC3A0) ;- (CAN_MB13) Base Address
AT91C_BASE_CAN_MB14       EQU (0xFFFAC3C0) ;- (CAN_MB14) Base Address
AT91C_BASE_CAN_MB15       EQU (0xFFFAC3E0) ;- (CAN_MB15) Base Address
AT91C_BASE_CAN            EQU (0xFFFAC000) ;- (CAN) Base Address
AT91C_BASE_PWMC_CH0       EQU (0xFFFB8200) ;- (PWMC_CH0) Base Address
AT91C_BASE_PWMC_CH1       EQU (0xFFFB8220) ;- (PWMC_CH1) Base Address
AT91C_BASE_PWMC_CH2       EQU (0xFFFB8240) ;- (PWMC_CH2) Base Address
AT91C_BASE_PWMC_CH3       EQU (0xFFFB8260) ;- (PWMC_CH3) Base Address
AT91C_BASE_PWMC           EQU (0xFFFB8000) ;- (PWMC) Base Address
AT91C_BASE_MACB           EQU (0xFFFBC000) ;- (MACB) Base Address
AT91C_BASE_LCDC           EQU (0x00700000) ;- (LCDC) Base Address
AT91C_BASE_DMA            EQU (0x00800000) ;- (DMA) Base Address
AT91C_BASE_UDP            EQU (0xFFF78000) ;- (UDP) Base Address
AT91C_BASE_UHP            EQU (0x00A00000) ;- (UHP) Base Address
AT91C_BASE_TBOX           EQU (0x70000000) ;- (TBOX) Base Address
AT91C_BASE_HECC0          EQU (0xFFFFE000) ;- (HECC0) Base Address
AT91C_BASE_HECC1          EQU (0xFFFFE600) ;- (HECC1) Base Address
AT91C_BASE_HISI           EQU (0xFFFC4000) ;- (HISI) Base Address

