una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9263.h
/* - ******************************************************************************/
/* -               MEMORY MAPPING DEFINITIONS FOR AT91SAM9263*/
/* - ******************************************************************************/
/* - ITCM*/
AT91C_ITCM                EQU (0x00100000) ;- Maximum ITCM Area base address
AT91C_ITCM_SIZE           EQU (0x00010000) ;- Maximum ITCM Area size in byte (64 Kbytes)
/* - DTCM*/
AT91C_DTCM                EQU (0x00200000) ;- Maximum DTCM Area base address
AT91C_DTCM_SIZE           EQU (0x00010000) ;- Maximum DTCM Area size in byte (64 Kbytes)
/* - IRAM*/
AT91C_IRAM                EQU (0x00300000) ;- Maximum Internal SRAM base address
AT91C_IRAM_SIZE           EQU (0x00014000) ;- Maximum Internal SRAM size in byte (80 Kbytes)
/* - IRAM_MIN*/
AT91C_IRAM_MIN            EQU (0x00300000) ;- Minimum Internal RAM base address
AT91C_IRAM_MIN_SIZE       EQU (0x00004000) ;- Minimum Internal RAM size in byte (16 Kbytes)
/* - IROM*/
AT91C_IROM                EQU (0x00400000) ;- Internal ROM base address
AT91C_IROM_SIZE           EQU (0x00020000) ;- Internal ROM size in byte (128 Kbytes)
/* - IRAM2*/
AT91C_IRAM2               EQU (0x00500000) ;- IRAM2 base address
AT91C_IRAM2_SIZE          EQU (0x00004000) ;- IRAM2 size in byte (16 Kbytes)
/* - EBI0_CS0*/
AT91C_EBI0_CS0            EQU (0x10000000) ;- EBI0 Chip Select 0 base address
AT91C_EBI0_CS0_SIZE       EQU (0x10000000) ;- EBI0 Chip Select 0 size in byte (262144 Kbytes)
/* - EBI0_CS1*/
AT91C_EBI0_CS1            EQU (0x20000000) ;- EBI0 Chip Select 1 base address
AT91C_EBI0_CS1_SIZE       EQU (0x10000000) ;- EBI0 Chip Select 1 size in byte (262144 Kbytes)
/* - EBI0_SDRAM*/
AT91C_EBI0_SDRAM          EQU (0x20000000) ;- SDRAM on EBI0 Chip Select 1 base address
AT91C_EBI0_SDRAM_SIZE     EQU (0x10000000) ;- SDRAM on EBI0 Chip Select 1 size in byte (262144 Kbytes)
/* - EBI0_SDRAM_16BIT*/
AT91C_EBI0_SDRAM_16BIT    EQU (0x20000000) ;- SDRAM on EBI0 Chip Select 1 base address
AT91C_EBI0_SDRAM_16BIT_SIZE EQU (0x02000000) ;- SDRAM on EBI0 Chip Select 1 size in byte (32768 Kbytes)
/* - EBI0_SDRAM_32BIT*/
AT91C_EBI0_SDRAM_32BIT    EQU (0x20000000) ;- SDRAM on EBI0 Chip Select 1 base address
AT91C_EBI0_SDRAM_32BIT_SIZE EQU (0x04000000) ;- SDRAM on EBI0 Chip Select 1 size in byte (65536 Kbytes)
/* - EBI0_CS2*/
AT91C_EBI0_CS2            EQU (0x30000000) ;- EBI0 Chip Select 2 base address
AT91C_EBI0_CS2_SIZE       EQU (0x10000000) ;- EBI0 Chip Select 2 size in byte (262144 Kbytes)
/* - EBI0_CS3*/
AT91C_EBI0_CS3            EQU (0x40000000) ;- EBI0 Chip Select 3 base address
AT91C_EBI0_CS3_SIZE       EQU (0x10000000) ;- EBI0 Chip Select 3 size in byte (262144 Kbytes)
/* - EBI0_SM*/
AT91C_EBI0_SM             EQU (0x40000000) ;- SmartMedia on EBI0 Chip Select 3 base address
AT91C_EBI0_SM_SIZE        EQU (0x10000000) ;- SmartMedia on EBI0 Chip Select 3 size in byte (262144 Kbytes)
/* - EBI0_CS4*/
AT91C_EBI0_CS4            EQU (0x50000000) ;- EBI0 Chip Select 4 base address
AT91C_EBI0_CS4_SIZE       EQU (0x10000000) ;- EBI0 Chip Select 4 size in byte (262144 Kbytes)
/* - EBI0_CF0*/
AT91C_EBI0_CF0            EQU (0x50000000) ;- CompactFlash 0 on EBI0 Chip Select 4 base address
AT91C_EBI0_CF0_SIZE       EQU (0x10000000) ;- CompactFlash 0 on EBI0 Chip Select 4 size in byte (262144 Kbytes)
/* - EBI0_CS5*/
AT91C_EBI0_CS5            EQU (0x60000000) ;- EBI0 Chip Select 5 base address
AT91C_EBI0_CS5_SIZE       EQU (0x10000000) ;- EBI0 Chip Select 5 size in byte (262144 Kbytes)
/* - EBI0_CF1*/
AT91C_EBI0_CF1            EQU (0x60000000) ;- CompactFlash 1 on EBI0Chip Select 5 base address
AT91C_EBI0_CF1_SIZE       EQU (0x10000000) ;- CompactFlash 1 on EBI0Chip Select 5 size in byte (262144 Kbytes)
/* - EBI1_CS0*/
AT91C_EBI1_CS0            EQU (0x70000000) ;- EBI1 Chip Select 0 base address
AT91C_EBI1_CS0_SIZE       EQU (0x10000000) ;- EBI1 Chip Select 0 size in byte (262144 Kbytes)
/* - EBI1_CS1*/
AT91C_EBI1_CS1            EQU (0x80000000) ;- EBI1 Chip Select 1 base address
AT91C_EBI1_CS1_SIZE       EQU (0x10000000) ;- EBI1 Chip Select 1 size in byte (262144 Kbytes)
/* - EBI1_SDRAM_16BIT*/
AT91C_EBI1_SDRAM_16BIT    EQU (0x80000000) ;- SDRAM on EBI1 Chip Select 1 base address
AT91C_EBI1_SDRAM_16BIT_SIZE EQU (0x02000000) ;- SDRAM on EBI1 Chip Select 1 size in byte (32768 Kbytes)
/* - EBI1_SDRAM_32BIT*/
AT91C_EBI1_SDRAM_32BIT    EQU (0x80000000) ;- SDRAM on EBI1 Chip Select 1 base address
AT91C_EBI1_SDRAM_32BIT_SIZE EQU (0x04000000) ;- SDRAM on EBI1 Chip Select 1 size in byte (65536 Kbytes)
/* - EBI1_CS2*/
AT91C_EBI1_CS2            EQU (0x90000000) ;- EBI1 Chip Select 2 base address
AT91C_EBI1_CS2_SIZE       EQU (0x10000000) ;- EBI1 Chip Select 2 size in byte (262144 Kbytes)
/* - EBI1_SM*/
AT91C_EBI1_SM             EQU (0x90000000) ;- SmartMedia on EBI1 Chip Select 2 base address
AT91C_EBI1_SM_SIZE        EQU (0x10000000) ;- SmartMedia on EBI1 Chip Select 2 size in byte (262144 Kbytes)
#endif /* __IAR_SYSTEMS_ASM__ */


#endif /* AT91SAM9263_H */
